[
        {
            "sura":"",
            "questions":[
                {
                
                }
            ]
        },
        {
            "sura":"البقرة",
            "questions": [
                {
                    "id": 1,
                    "question": "هداية الكتاب للمتقين، وبيان صفاتهم وفلاحهم ",
                    "ayat":[ "الم ١ ذَلِكَ الْكِتَابُ لاَ رَيْبَ فِيهِ هُدًى لِّلْمُتَّقِينَ ٢ الَّذِينَ يُؤْمِنُونَ بِالْغَيْبِ وَيُقِيمُونَ الصَّلاةَ وَمِمَّا رَزَقْنَاهُمْ يُنفِقُونَ ٣ وَالَّذِينَ يُؤْمِنُونَ بِمَا أُنزِلَ إِلَيْكَ وَمَا أُنزِلَ مِن قَبْلِكَ وَبِالآخِرَةِ هُمْ يُوقِنُونَ ٤ أُوْلَئِكَ عَلَى هُدًى مِّن رَّبِّهِمْ وَأُولَئِكَ هُمُ الْمُفْلِحُونَ ٥"
                ]},
                {
                    "id": 2,
                    "question": "ختم وغشاوة للكفار ",
                    "ayat":[ "إِنَّ الَّذِينَ كَفَرُواْ سَوَاءٌ عَلَيْهِمْ أَأَنذَرْتَهُمْ أَمْ لَمْ تُنذِرْهُمْ لاَ يُؤْمِنُونَ ٦ خَتَمَ اللَّهُ عَلَى قُلُوبِهِمْ وَعَلَى سَمْعِهِمْ وَعَلَى أَبْصَارِهِمْ غِشَاوَةٌ وَلَهُمْ عَذَابٌ عَظِيمٌ ٧"
                ]},
                {
                    "id": 3,
                    "question": "حقيقة المنافقين، وإفسادهم وإعراضهم عن الإيمان، واستهزاؤهم بالمؤمنين عند شياطينهم، وشراؤهم للضلالة، وضرب مثلين لهم مائي وناري",
                    "ayat":[ "وَمِنَ النَّاسِ مَن يَقُولُ آمَنَّا بِاللَّهِ وَبِالْيَوْمِ الآخِرِ وَمَا هُم بِمُؤْمِنِينَ ٨ يُخَادِعُونَ اللَّهَ وَالَّذِينَ آمَنُوا وَمَا يَخْدَعُونَ إِلاَّ أَنفُسَهُم وَمَا يَشْعُرُونَ ٩ فِي قُلُوبِهِم مَّرَضٌ فَزَادَهُمُ اللَّهُ مَرَضاً وَلَهُم عَذَابٌ أَلِيمٌ بِمَا كَانُوا يَكْذِبُونَ ١٠ وَإِذَا قِيلَ لَهُمْ لاَ تُفْسِدُواْ فِي الأَرْضِ قَالُواْ إِنَّمَا نَحْنُ مُصْلِحُونَ ١١ أَلا إِنَّهُمْ هُمُ الْمُفْسِدُونَ وَلَكِن لاَّ يَشْعُرُونَ ١٢ وَإِذَا قِيلَ لَهُمْ آمِنُواْ كَمَا آمَنَ النَّاسُ قَالُواْ أَنُؤْمِنُ كَمَا آمَنَ السُّفَهَاء أَلا إِنَّهُمْ هُمُ السُّفَهَاء وَلَكِن لاَّ يَعْلَمُونَ ١٣ وَإِذَا لَقُواْ الَّذِينَ آمَنُواْ قَالُواْ آمَنَّا وَإِذَا خَلَوْا إِلَى شَيَاطِينِهِمْ قَالُواْ إِنَّا مَعَكُمْ إِنَّمَا نَحْنُ مُسْتَهْزِؤُونَ ١٤ اللَّهُ يَسْتَهْزِئُ بِهِمْ وَيَمُدُّهُمْ فِي طُغْيَانِهِمْ يَعْمَهُونَ ١٥ أُوْلَئِكَ الَّذِينَ اشْتَرُوُاْ الضَّلالَةَ بِالْهُدَى فَمَا رَبِحَت تِّجَارَتُهُمْ وَمَا كَانُواْ مُهْتَدِينَ ١٦ مَثَلُهُمْ كَمَثَلِ الَّذِي اسْتَوْقَدَ نَارًا فَلَمَّا أَضَاءَتْ مَا حَوْلَهُ ذَهَبَ اللَّهُ بِنُورِهِمْ وَتَرَكَهُمْ فِي ظُلُمَاتٍ لاَّ يُبْصِرُونَ ١٧ صُمٌّ بُكْمٌ عُمْيٌ فَهُمْ لاَ يَرْجِعُونَ ١٨ أَوْ كَصَيِّبٍ مِّنَ السَّمَاء فِيهِ ظُلُمَاتٌ وَرَعْدٌ وَبَرْقٌ يَجْعَلُونَ أَصَابِعَهُمْ فِي آذَانِهِم مِّنَ الصَّوَاعِقِ حَذَرَ الْمَوْتِ وَاللَّهُ مُحِيطٌ بِالْكَافِرِينَ ١٩ يَكَادُ الْبَرْقُ يَخْطَفُ أَبْصَارَهُمْ كُلَّمَا أَضَاء لَهُم مَّشَوْا فِيهِ وَإِذَا أَظْلَمَ عَلَيْهِمْ قَامُواْ وَلَوْ شَاء اللَّهُ لَذَهَبَ بِسَمْعِهِمْ وَأَبْصَارِهِمْ إِنَّ اللَّه عَلَى كُلِّ شَيْءٍ قَدِيرٌ ٢٠"
                ]},
                {
                    "id": 4,
                    "question": "الأمر بعبادة الله تعالى، ودلائل الوحدانية ",
                    "ayat":[ "يَا أَيُّهَا النَّاسُ اعْبُدُواْ رَبَّكُمُ الَّذِي خَلَقَكُمْ وَالَّذِينَ مِن قَبْلِكُمْ لَعَلَّكُمْ تَتَّقُونَ ٢١ الَّذِي جَعَلَ لَكُمُ الأَرْضَ فِرَاشاً وَالسَّمَاء بِنَاء وَأَنزَلَ مِنَ السَّمَاء مَاء فَأَخْرَجَ بِهِ مِنَ الثَّمَرَاتِ رِزْقًا لَّكُمْ فَلاَ تَجْعَلُواْ لِلَّهِ أَندَادًا وَأَنتُمْ تَعْلَمُونَ ٢٢"
                ]},
                {
                    "id": 5,
                    "question": "التحدي بسورة من مثل القرآن وتوعد الكافرين، وبشارة المؤمنين ",
                    "ayat":[ "وَإِن كُنتُمْ فِي رَيْبٍ مِّمَّا نَزَّلْنَا عَلَى عَبْدِنَا فَأْتُواْ بِسُورَةٍ مِّن مِّثْلِهِ وَادْعُواْ شُهَدَاءَكُم مِّن دُونِ اللَّهِ إِنْ كُنتُمْ صَادِقِينَ ٢٣ فَإِن لَّمْ تَفْعَلُواْ وَلَن تَفْعَلُواْ فَاتَّقُواْ النَّارَ الَّتِي وَقُودُهَا النَّاسُ وَالْحِجَارَةُ أُعِدَّتْ لِلْكَافِرِينَ ٢٤ وَبَشِّرِ الَّذِين آمَنُواْ وَعَمِلُواْ الصَّالِحَاتِ أَنَّ لَهُمْ جَنَّاتٍ تَجْرِي مِن تَحْتِهَا الأَنْهَارُ كُلَّمَا رُزِقُواْ مِنْهَا مِن ثَمَرَةٍ رِّزْقًا قَالُواْ هَذَا الَّذِي رُزِقْنَا مِن قَبْلُ وَأُتُواْ بِهِ مُتَشَابِهًا وَلَهُمْ فِيهَا أَزْوَاجٌ مُّطَهَّرَةٌ وَهُمْ فِيهَا خَالِدُونَ ٢٥"
                ]},
                {
                    "id": 6,
                    "question": "ضرب مثل البعوضة، وموقف المؤمنين والكفار منه، وصفات الفاسقين وخسرانهم ",
                    "ayat":[ "إِنَّ اللَّهَ لاَ يَسْتَحْيِي أَن يَضْرِبَ مَثَلاً مَّا بَعُوضَةً فَمَا فَوْقَهَا فَأَمَّا الَّذِينَ آمَنُواْ فَيَعْلَمُونَ أَنَّهُ الْحَقُّ مِن رَّبِّهِمْ وَأَمَّا الَّذِينَ كَفَرُواْ فَيَقُولُونَ مَاذَا أَرَادَ اللَّهُ بِهَذَا مَثَلاً يُضِلُّ بِهِ كَثِيرًا وَيَهْدِي بِهِ كَثِيرًا وَمَا يُضِلُّ بِهِ إِلاَّ الْفَاسِقِينَ ٢٦ الَّذِينَ يَنقُضُونَ عَهْدَ اللَّهِ مِن بَعْدِ مِيثَاقِهِ وَيَقْطَعُونَ مَا أَمَرَ اللَّهُ بِهِ أَن يُوصَلَ وَيُفْسِدُونَ فِي الأَرْضِ أُوْلَئِكَ هُمُ الْخَاسِرُونَ ٢٧"
                ]},
                {
                    "id": 7,
                    "question": "استنكار الكفر مع ظهور دلائل القدرة والخلق والعلم ",
                    "ayat":[ "كَيْفَ تَكْفُرُونَ بِاللَّهِ وَكُنتُمْ أَمْوَاتًا فَأَحْيَاكُمْ ثُمَّ يُمِيتُكُمْ ثُمَّ يُحْيِيكُمْ ثُمَّ إِلَيْهِ تُرْجَعُونَ ٢٨ هُوَ الَّذِي خَلَقَ لَكُم مَّا فِي الأَرْضِ جَمِيعًا ثُمَّ اسْتَوَى إِلَى السَّمَاء فَسَوَّاهُنَّ سَبْعَ سَمَاوَاتٍ وَهُوَ بِكُلِّ شَيْءٍ عَلِيمٌ ٢٩"
                ]},
                {
                    "id": 8,
                    "question": "إعلام الملائكة بجعل خليفة في الأرض ورأيهم ",
                    "ayat":[ "وَإِذْ قَالَ رَبُّكَ لِلْمَلائِكَةِ إِنِّي جَاعِلٌ فِي الأَرْضِ خَلِيفَةً قَالُواْ أَتَجْعَلُ فِيهَا مَن يُفْسِدُ فِيهَا وَيَسْفِكُ الدِّمَاء وَنَحْنُ نُسَبِّحُ بِحَمْدِكَ وَنُقَدِّسُ لَكَ قَالَ إِنِّي أَعْلَمُ مَا لاَ تَعْلَمُونَ ٣٠"
                ]},
                {
                    "id": 9,
                    "question": "تعليم آدم واستعراض علمه أمام الملائكة",
                    "ayat":[ "وَعَلَّمَ آدَمَ الأَسْمَاء كُلَّهَا ثُمَّ عَرَضَهُمْ عَلَى الْمَلائِكَةِ فَقَالَ أَنبِئُونِي بِأَسْمَاء هَؤُلاء إِن كُنتُمْ صَادِقِينَ ٣١ قَالُواْ سُبْحَانَكَ لاَ عِلْمَ لَنَا إِلاَّ مَا عَلَّمْتَنَا إِنَّكَ أَنتَ الْعَلِيمُ الْحَكِيمُ ٣٢ قَالَ يَا آدَمُ أَنبِئْهُم بِأَسْمَائِهِمْ فَلَمَّا أَنبَأَهُمْ بِأَسْمَائِهِمْ قَالَ أَلَمْ أَقُل لَّكُمْ إِنِّي أَعْلَمُ غَيْبَ السَّمَاوَاتِ وَالأَرْضِ وَأَعْلَمُ مَا تُبْدُونَ وَمَا كُنتُمْ تَكْتُمُونَ ٣٣"
                ]},
                {
                    "id": 10,
                    "question": "أمر الملائكة بالسجود وطاعتهم، وإباء إبليس واستكباره",
                    "ayat":[ "وَإِذْ قُلْنَا لِلْمَلائِكَةِ اسْجُدُواْ لآدَمَ فَسَجَدُواْ إِلاَّ إِبْلِيسَ أَبَى وَاسْتَكْبَرَ وَكَانَ مِنَ الْكَافِرِينَ ٣٤"
                ]},
                {
                    "id": 11,
                    "question": "سكنى الجنة، والتحذير من الشجرة",
                    "ayat":[ "وَقُلْنَا يَا آدَمُ اسْكُنْ أَنتَ وَزَوْجُكَ الْجَنَّةَ وَكُلاَ مِنْهَا رَغَدًا حَيْثُ شِئْتُمَا وَلاَ تَقْرَبَا هَذِهِ الشَّجَرَةَ فَتَكُونَا مِنَ الظَّالِمِينَ ٣٥"
                ]},
                {
                    "id": 12,
                    "question": "استزلال الشيطان، والإهباط إلى الأرض، والتوبة",
                    "ayat":[ "فَأَزَلَّهُمَا الشَّيْطَانُ عَنْهَا فَأَخْرَجَهُمَا مِمَّا كَانَا فِيهِ وَقُلْنَا اهْبِطُواْ بَعْضُكُمْ لِبَعْضٍ عَدُوٌّ وَلَكُمْ فِي الأَرْضِ مُسْتَقَرٌّ وَمَتَاعٌ إِلَى حِينٍ ٣٦ فَتَلَقَّى آدَمُ مِن رَّبِّهِ كَلِمَاتٍ فَتَابَ عَلَيْهِ إِنَّهُ هُوَ التَّوَّابُ الرَّحِيمُ ٣٧"
                ]},
                {
                    "id": 13,
                    "question": "تقرير الإهباط والتكليف والجزاء",
                    "ayat":[ "قُلْنَا اهْبِطُواْ مِنْهَا جَمِيعًا فَإِمَّا يَأْتِيَنَّكُم مِّنِّي هُدًى فَمَن تَبِعَ هُدَايَ فَلاَ خَوْفٌ عَلَيْهِمْ وَلاَ هُمْ يَحْزَنُونَ ٣٨ وَالَّذِينَ كَفَرُواْ وَكَذَّبُواْ بِآيَاتِنَا أُوْلَئِكَ أَصْحَابُ النَّارِ هُمْ فِيهَا خَالِدُونَ ٣٩"
                ]},
                {
                    "id": 14,
                    "question": "تذكير النعمة والوفاء بالعهد وخشية الله ",
                    "ayat":[ "يَا بَنِي إِسْرَائِيلَ اذْكُرُواْ نِعْمَتِيَ الَّتِي أَنْعَمْتُ عَلَيْكُمْ وَأَوْفُواْ بِعَهْدِي أُوفِ بِعَهْدِكُمْ وَإِيَّايَ فَارْهَبُونِ ٤٠"
                ]},
                {
                    "id": 15,
                    "question": "الإيمان بالقرآن وتقوى الله ",
                    "ayat":[ "وَآمِنُواْ بِمَا أَنزَلْتُ مُصَدِّقًا لِّمَا مَعَكُمْ وَلاَ تَكُونُواْ أَوَّلَ كَافِرٍ بِهِ وَلاَ تَشْتَرُواْ بِآيَاتِي ثَمَنًا قَلِيلاً وَإِيَّايَ فَاتَّقُونِ ٤١"
                ]},
                {
                    "id": 16,
                    "question": "النهي عن لبس الحق بالباطل أو كتمانه ",
                    "ayat":[ "وَلاَ تَلْبِسُواْ الْحَقَّ بِالْبَاطِلِ وَتَكْتُمُواْ الْحَقَّ وَأَنتُمْ تَعْلَمُونَ ٤٢"
                ]},
                {
                    "id": 17,
                    "question": "إقامة الصلاة والزكاة والخضوع لله ",
                    "ayat":[ "وَأَقِيمُواْ الصَّلاةَ وَآتُواْ الزَّكَاةَ وَارْكَعُواْ مَعَ الرَّاكِعِينَ ٤٣"
                ]},
                {
                    "id": 18,
                    "question": "أمر أنفسهم بالبر ",
                    "ayat":[ "أَتَأْمُرُونَ النَّاسَ بِالْبِرِّ وَتَنسَوْنَ أَنفُسَكُمْ وَأَنتُمْ تَتْلُونَ الْكِتَابَ أَفَلاَ تَعْقِلُونَ ٤٤"
                ]},
                {
                    "id": 19,
                    "question": "الاستعانة بالصبر والصلاة ",
                    "ayat":[ "وَاسْتَعِينُواْ بِالصَّبْرِ وَالصَّلاةِ وَإِنَّهَا لَكَبِيرَةٌ إِلاَّ عَلَى الْخَاشِعِينَ ٤٥ الَّذِينَ يَظُنُّونَ أَنَّهُم مُّلاقُوا رَبِّهِمْ وَأَنَّهُمْ إِلَيْهِ رَاجِعُونَ ٤٦"
                ]},
                {
                    "id": 20,
                    "question": "تذكر النعمة واصطفاء الله لهم ",
                    "ayat":[ "يَا بَنِي إِسْرَائِيلَ اذْكُرُواْ نِعْمَتِيَ الَّتِي أَنْعَمْتُ عَلَيْكُمْ وَأَنِّي فَضَّلْتُكُمْ عَلَى الْعَالَمِينَ ٤٧"
                ]},
                {
                    "id": 21,
                    "question": "تقوى يوم القيامة ",
                    "ayat":[ "وَاتَّقُواْ يَوْمًا لاَّ تَجْزِي نَفْسٌ عَن نَّفْسٍ شَيْئًا وَلاَ يُقْبَلُ مِنْهَا شَفَاعَةٌ وَلاَ يُؤْخَذُ مِنْهَا عَدْلٌ وَلاَ هُمْ يُنصَرُونَ ٤٨"
                ]},
                {
                    "id": 22,
                    "question": "النجاة من آل فرعون ",
                    "ayat":[ "وَإِذْ نَجَّيْنَاكُم مِّنْ آلِ فِرْعَوْنَ يَسُومُونَكُمْ سُوءَ الْعَذَابِ يُذَبِّحُونَ أَبْنَاءَكُمْ وَيَسْتَحْيُونَ نِسَاءكُمْ وَفِي ذَلِكُم بَلاء مِّن رَّبِّكُمْ عَظِيمٌ ٤٩"
                ]},
                {
                    "id": 23,
                    "question": "فرق البحر وغرق فرعون ",
                    "ayat":[ "وَإِذْ فَرَقْنَا بِكُمُ الْبَحْرَ فَأَنجَيْنَاكُمْ وَأَغْرَقْنَا آلَ فِرْعَوْنَ وَأَنتُمْ تَنظُرُونَ ٥٠"
                ]},
                {
                    "id": 24,
                    "question": "ميقات الأربعين ليلة وعبادتهم العجل ثم العفو عنهم ",
                    "ayat":[ "وَإِذْ وَاعَدْنَا مُوسَى أَرْبَعِينَ لَيْلَةً ثُمَّ اتَّخَذْتُمُ الْعِجْلَ مِن بَعْدِهِ وَأَنتُمْ ظَالِمُونَ ٥١ ثُمَّ عَفَوْنَا عَنكُمِ مِّن بَعْدِ ذَلِكَ لَعَلَّكُمْ تَشْكُرُونَ ٥٢"
                ]},
                {
                    "id": 25,
                    "question": "ايتاء موسى الكتاب والفرقان ",
                    "ayat":[ "وَإِذْ آتَيْنَا مُوسَى الْكِتَابَ وَالْفُرْقَانَ لَعَلَّكُمْ تَهْتَدُونَ ٥٣"
                ]},
                {
                    "id": 26,
                    "question": "التوبة من عبادة العجل بقتل بعضهم بعضا ",
                    "ayat":[ "وَإِذْ قَالَ مُوسَى لِقَوْمِهِ يَا قَوْمِ إِنَّكُمْ ظَلَمْتُمْ أَنفُسَكُمْ بِاتِّخَاذِكُمُ الْعِجْلَ فَتُوبُواْ إِلَى بَارِئِكُمْ فَاقْتُلُواْ أَنفُسَكُمْ ذَلِكُمْ خَيْرٌ لَّكُمْ عِندَ بَارِئِكُمْ فَتَابَ عَلَيْكُمْ إِنَّهُ هُوَ التَّوَّابُ الرَّحِيمُ ٥٤"
                ]},
                {
                    "id": 27,
                    "question": "طلبهم رؤبة الله وصعقهم ثم بعثهم الانعام عليهم ",
                    "ayat":[ "وَإِذْ قُلْتُمْ يَا مُوسَى لَن نُّؤْمِنَ لَكَ حَتَّى نَرَى اللَّهَ جَهْرَةً فَأَخَذَتْكُمُ الصَّاعِقَةُ وَأَنتُمْ تَنظُرُونَ ٥٥ ثُمَّ بَعَثْنَاكُم مِّن بَعْدِ مَوْتِكُمْ لَعَلَّكُمْ تَشْكُرُونَ ٥٦ وَظَلَّلْنَا عَلَيْكُمُ الْغَمَامَ وَأَنزَلْنَا عَلَيْكُمُ الْمَنَّ وَالسَّلْوَى كُلُواْ مِن طَيِّبَاتِ مَا رَزَقْنَاكُمْ وَمَا ظَلَمُونَا وَلَكِن كَانُواْ أَنفُسَهُمْ يَظْلِمُونَ ٥٧"
                ]},
                {
                    "id": 28,
                    "question": "أمرهم بدخول الأرض المقدسة ونكولهم ",
                    "ayat":[ "وَإِذْ قُلْنَا ادْخُلُواْ هَذِهِ الْقَرْيَةَ فَكُلُواْ مِنْهَا حَيْثُ شِئْتُمْ رَغَدًا وَادْخُلُواْ الْبَابَ سُجَّدًا وَقُولُواْ حِطَّةٌ نَّغْفِرْ لَكُمْ خَطَايَاكُمْ وَسَنَزِيدُ الْمُحْسِنِينَ ٥٨"
                ]},
                {
                    "id": 29,
                    "question": "الاستسقاء وانفجار الماء ",
                    "ayat":[ "فَبَدَّلَ الَّذِينَ ظَلَمُواْ قَوْلاً غَيْرَ الَّذِي قِيلَ لَهُمْ فَأَنزَلْنَا عَلَى الَّذِينَ ظَلَمُواْ رِجْزًا مِّنَ السَّمَاء بِمَا كَانُواْ يَفْسُقُونَ ٥٩"
                ]},
                {
                    "id": 30,
                    "question": "الاستطعام، ولزومهم الذل والغضب، وإثابة المؤمنين من جميع الملل ",
                    "ayat":[ "وَإِذِ اسْتَسْقَى مُوسَى لِقَوْمِهِ فَقُلْنَا اضْرِب بِّعَصَاكَ الْحَجَرَ فَانفَجَرَتْ مِنْهُ اثْنَتَا عَشْرَةَ عَيْنًا قَدْ عَلِمَ كُلُّ أُنَاسٍ مَّشْرَبَهُمْ كُلُواْ وَاشْرَبُواْ مِن رِّزْقِ اللَّهِ وَلاَ تَعْثَوْا فِي الأَرْضِ مُفْسِدِينَ ٦٠ وَإِذْ قُلْتُمْ يَا مُوسَى لَن نَّصْبِرَ عَلَىَ طَعَامٍ وَاحِدٍ فَادْعُ لَنَا رَبَّكَ يُخْرِجْ لَنَا مِمَّا تُنبِتُ الأَرْضُ مِن بَقْلِهَا وَقِثَّائِهَا وَفُومِهَا وَعَدَسِهَا وَبَصَلِهَا قَالَ أَتَسْتَبْدِلُونَ الَّذِي هُوَ أَدْنَى بِالَّذِي هُوَ خَيْرٌ اهْبِطُواْ مِصْراً فَإِنَّ لَكُم مَّا سَأَلْتُمْ وَضُرِبَتْ عَلَيْهِمُ الذِّلَّةُ وَالْمَسْكَنَةُ وَبَاؤُواْ بِغَضَبٍ مِّنَ اللَّهِ ذَلِكَ بِأَنَّهُمْ كَانُواْ يَكْفُرُونَ بِآيَاتِ اللَّهِ وَيَقْتُلُونَ النَّبِيِّينَ بِغَيْرِ الْحَقِّ ذَلِكَ بِمَا عَصَواْ وَّكَانُواْ يَعْتَدُونَ ٦١ إِنَّ الَّذِينَ آمَنُواْ وَالَّذِينَ هَادُواْ وَالنَّصَارَى وَالصَّابِئِينَ مَنْ آمَنَ بِاللَّهِ وَالْيَوْمِ الآخِرِ وَعَمِلَ صَالِحًا فَلَهُمْ أَجْرُهُمْ عِندَ رَبِّهِمْ وَلاَ خَوْفٌ عَلَيْهِمْ وَلاَ هُمْ يَحْزَنُونَ ٦٢"
                ]},
                {
                    "id": 31,
                    "question": "ميثاق الطور، واعتداؤهم في السبت ",
                    "ayat":[ "وَإِذْ أَخَذْنَا مِيثَاقَكُمْ وَرَفَعْنَا فَوْقَكُمُ الطُّورَ خُذُواْ مَا آتَيْنَاكُم بِقُوَّةٍ وَاذْكُرُواْ مَا فِيهِ لَعَلَّكُمْ تَتَّقُونَ ٦٣ ثُمَّ تَوَلَّيْتُم مِّن بَعْدِ ذَلِكَ فَلَوْلاَ فَضْلُ اللَّهِ عَلَيْكُمْ وَرَحْمَتُهُ لَكُنتُم مِّنَ الْخَاسِرِينَ ٦٤ وَلَقَدْ عَلِمْتُمُ الَّذِينَ اعْتَدَوْا مِنكُمْ فِي السَّبْتِ فَقُلْنَا لَهُمْ كُونُواْ قِرَدَةً خَاسِئِينَ ٦٥ فَجَعَلْنَاهَا نَكَالاً لِّمَا بَيْنَ يَدَيْهَا وَمَا خَلْفَهَا وَمَوْعِظَةً لِّلْمُتَّقِينَ ٦٦"
                ]},
                {
                    "id": 32,
                    "question": "قصتهم مع البقرة، وبيان قسوة قلوبهم ",
                    "ayat":[ "وَإِذْ قَالَ مُوسَى لِقَوْمِهِ إِنَّ اللَّهَ يَأْمُرُكُمْ أَنْ تَذْبَحُواْ بَقَرَةً قَالُواْ أَتَتَّخِذُنَا هُزُوًا قَالَ أَعُوذُ بِاللَّهِ أَنْ أَكُونَ مِنَ الْجَاهِلِينَ ٦٧ قَالُواْ ادْعُ لَنَا رَبَّكَ يُبَيِّن لَّنَا مَا هِيَ قَالَ إِنَّهُ يَقُولُ إِنَّهَا بَقَرَةٌ لاَّ فَارِضٌ وَلاَ بِكْرٌ عَوَانٌ بَيْنَ ذَلِكَ فَافْعَلُواْ مَا تُؤْمَرُونَ ٦٨ قَالُواْ ادْعُ لَنَا رَبَّكَ يُبَيِّن لَّنَا مَا لَوْنُهَا قَالَ إِنَّهُ يَقُولُ إِنَّهَا بَقَرَةٌ صَفْرَاء فَاقِعٌ لَّوْنُهَا تَسُرُّ النَّاظِرِينَ ٦٩ قَالُواْ ادْعُ لَنَا رَبَّكَ يُبَيِّن لَّنَا مَا هِيَ إِنَّ الْبَقَرَ تَشَابَهَ عَلَيْنَا وَإِنَّا إِن شَاء اللَّهُ لَمُهْتَدُونَ ٧٠ قَالَ إِنَّهُ يَقُولُ إِنَّهَا بَقَرَةٌ لاَّ ذَلُولٌ تُثِيرُ الأَرْضَ وَلاَ تَسْقِي الْحَرْثَ مُسَلَّمَةٌ لاَّ شِيَةَ فِيهَا قَالُواْ الآنَ جِئْتَ بِالْحَقِّ فَذَبَحُوهَا وَمَا كَادُواْ يَفْعَلُونَ ٧١ وَإِذْ قَتَلْتُمْ نَفْسًا فَادَّارَأْتُمْ فِيهَا وَاللَّهُ مُخْرِجٌ مَّا كُنتُمْ تَكْتُمُونَ ٧٢ فَقُلْنَا اضْرِبُوهُ بِبَعْضِهَا كَذَلِكَ يُحْيِي اللَّهُ الْمَوْتَى وَيُرِيكُمْ آيَاتِهِ لَعَلَّكُمْ تَعْقِلُونَ ٧٣ ثُمَّ قَسَتْ قُلُوبُكُم مِّن بَعْدِ ذَلِكَ فَهِيَ كَالْحِجَارَةِ أَوْ أَشَدُّ قَسْوَةً وَإِنَّ مِنَ الْحِجَارَةِ لَمَا يَتَفَجَّرُ مِنْهُ الأَنْهَارُ وَإِنَّ مِنْهَا لَمَا يَشَّقَّقُ فَيَخْرُجُ مِنْهُ الْمَاء وَإِنَّ مِنْهَا لَمَا يَهْبِطُ مِنْ خَشْيَةِ اللَّهِ وَمَا اللَّهُ بِغَافِلٍ عَمَّا تَعْمَلُونَ ٧٤"
                ]},
                {
                    "id": 33,
                    "question": "تحريف بني إسرائيل لكلام الله تعالى، وبيان كذبهم في ادعاء الإيمان، وبيان جهلهم وتوعدهم ",
                    "ayat":[ "أَفَتَطْمَعُونَ أَن يُؤْمِنُواْ لَكُمْ وَقَدْ كَانَ فَرِيقٌ مِّنْهُمْ يَسْمَعُونَ كَلامَ اللَّهِ ثُمَّ يُحَرِّفُونَهُ مِن بَعْدِ مَا عَقَلُوهُ وَهُمْ يَعْلَمُونَ ٧٥ وَإِذَا لَقُواْ الَّذِينَ آمَنُواْ قَالُواْ آمَنَّا وَإِذَا خَلاَ بَعْضُهُمْ إِلَىَ بَعْضٍ قَالُواْ أَتُحَدِّثُونَهُم بِمَا فَتَحَ اللَّهُ عَلَيْكُمْ لِيُحَاجُّوكُم بِهِ عِندَ رَبِّكُمْ أَفَلاَ تَعْقِلُونَ ٧٦ أَوَلاَ يَعْلَمُونَ أَنَّ اللَّهَ يَعْلَمُ مَا يُسِرُّونَ وَمَا يُعْلِنُونَ ٧٧ وَمِنْهُمْ أُمِّيُّونَ لاَ يَعْلَمُونَ الْكِتَابَ إِلاَّ أَمَانِيَّ وَإِنْ هُمْ إِلاَّ يَظُنُّونَ ٧٨ فَوَيْلٌ لِّلَّذِينَ يَكْتُبُونَ الْكِتَابَ بِأَيْدِيهِمْ ثُمَّ يَقُولُونَ هَذَا مِنْ عِندِ اللَّهِ لِيَشْتَرُواْ بِهِ ثَمَنًا قَلِيلاً فَوَيْلٌ لَّهُم مِّمَّا كَتَبَتْ أَيْدِيهِمْ وَوَيْلٌ لَّهُمْ مِّمَّا يَكْسِبُونَ ٧٩"
                ]},
                {
                    "id": 34,
                    "question": "زعمهم أن النار إنما تمسهم لأيام معدودة، والرد عليهم ",
                    "ayat":[ "وَقَالُواْ لَن تَمَسَّنَا النَّارُ إِلاَّ أَيَّامًا مَّعْدُودَةً قُلْ أَتَّخَذْتُمْ عِندَ اللَّهِ عَهْدًا فَلَن يُخْلِفَ اللَّهُ عَهْدَهُ أَمْ تَقُولُونَ عَلَى اللَّهِ مَا لاَ تَعْلَمُونَ ٨٠ بَلَى مَن كَسَبَ سَيِّئَةً وَأَحَاطَتْ بِهِ خَطِيئَتُهُ فَأُولَئِكَ أَصْحَابُ النَّارِ هُمْ فِيهَا خَالِدُونَ ٨١ وَالَّذِينَ آمَنُواْ وَعَمِلُواْ الصَّالِحَاتِ أُوْلَئِكَ أَصْحَابُ الْجَنَّةِ هُمْ فِيهَا خَالِدُونَ ٨٢"
                ]},
                {
                    "id": 35,
                    "question": "توليهم وإعراضهم عن الميثاق العام مخالفتهم للميثاق الخاص، وتوعدهم ",
                    "ayat":[ "وَإِذْ أَخَذْنَا مِيثَاقَ بَنِي إِسْرَائِيلَ لاَ تَعْبُدُونَ إِلاَّ اللَّهَ وَبِالْوَالِدَيْنِ إِحْسَانًا وَذِي الْقُرْبَى وَالْيَتَامَى وَالْمَسَاكِينِ وَقُولُواْ لِلنَّاسِ حُسْنًا وَأَقِيمُواْ الصَّلاةَ وَآتُواْ الزَّكَاةَ ثُمَّ تَوَلَّيْتُمْ إِلاَّ قَلِيلاً مِّنكُمْ وَأَنتُم مُّعْرِضُونَ ٨٣ وَإِذْ أَخَذْنَا مِيثَاقَكُمْ لاَ تَسْفِكُونَ دِمَاءَكُمْ وَلاَ تُخْرِجُونَ أَنفُسَكُم مِّن دِيَارِكُمْ ثُمَّ أَقْرَرْتُمْ وَأَنتُمْ تَشْهَدُونَ ٨٤ ثُمَّ أَنتُمْ هَؤُلاء تَقْتُلُونَ أَنفُسَكُمْ وَتُخْرِجُونَ فَرِيقًا مِّنكُم مِّن دِيَارِهِمْ تَظَاهَرُونَ عَلَيْهِم بِالإِثْمِ وَالْعُدْوَانِ وَإِن يَأْتُوكُمْ أُسَارَى تُفَادُوهُمْ وَهُوَ مُحَرَّمٌ عَلَيْكُمْ إِخْرَاجُهُمْ أَفَتُؤْمِنُونَ بِبَعْضِ الْكِتَابِ وَتَكْفُرُونَ بِبَعْضٍ فَمَا جَزَاء مَن يَفْعَلُ ذَلِكَ مِنكُمْ إِلاَّ خِزْيٌ فِي الْحَيَاةِ الدُّنْيَا وَيَوْمَ الْقِيَامَةِ يُرَدُّونَ إِلَى أَشَدِّ الْعَذَابِ وَمَا اللَّهُ بِغَافِلٍ عَمَّا تَعْمَلُونَ ٨٥ أُوْلَئِكَ الَّذِينَ اشْتَرَوُاْ الْحَيَاةَ الدُّنْيَا بِالآخِرَةِ فَلاَ يُخَفَّفُ عَنْهُمُ الْعَذَابُ وَلاَ هُمْ يُنصَرُونَ ٨٦"
                ]},
                {
                    "id": 36,
                    "question": "موقفهم من موسى وعيسى عليهم السلام خصوصا ومن الرسل عموما ",
                    "ayat":[ "وَلَقَدْ آتَيْنَا مُوسَى الْكِتَابَ وَقَفَّيْنَا مِن بَعْدِهِ بِالرُّسُلِ وَآتَيْنَا عِيسَى ابْنَ مَرْيَمَ الْبَيِّنَاتِ وَأَيَّدْنَاهُ بِرُوحِ الْقُدُسِ أَفَكُلَّمَا جَاءَكُمْ رَسُولٌ بِمَا لاَ تَهْوَى أَنفُسُكُمُ اسْتَكْبَرْتُمْ فَفَرِيقاً كَذَّبْتُمْ وَفَرِيقًا تَقْتُلُونَ ٨٧"
                ]},
                {
                    "id": 37,
                    "question": "قولهم: قلوبنا غلف، والرد عليهم ",
                    "ayat":[ "وَقَالُواْ قُلُوبُنَا غُلْفٌ بَل لَّعَنَهُمُ اللَّه بِكُفْرِهِمْ فَقَلِيلاً مَّا يُؤْمِنُونَ ٨٨"
                ]},
                {
                    "id": 38,
                    "question": "موقفهم من القرآن، والرد عليهم ",
                    "ayat":[ "وَلَمَّا جَاءَهُمْ كِتَابٌ مِّنْ عِندِ اللَّهِ مُصَدِّقٌ لِّمَا مَعَهُمْ وَكَانُواْ مِن قَبْلُ يَسْتَفْتِحُونَ عَلَى الَّذِينَ كَفَرُواْ فَلَمَّا جَاءَهُم مَّا عَرَفُواْ كَفَرُواْ بِهِ فَلَعْنَةُ اللَّه عَلَى الْكَافِرِينَ ٨٩ بِئْسَمَا اشْتَرَوْا بِهِ أَنفُسَهُمْ أَن يَكْفُرُواْ بِمَا أَنزَلَ اللَّهُ بَغْيًا أَن يُنَزِّلُ اللَّهُ مِن فَضْلِهِ عَلَى مَن يَشَاء مِنْ عِبَادِهِ فَبَاؤُواْ بِغَضَبٍ عَلَى غَضَبٍ وَلِلْكَافِرِينَ عَذَابٌ مُّهِينٌ ٩٠"
                ]},
                {
                    "id": 39,
                    "question": "موقفهم من الدعوة إلى الإيمان، والرد عليهم ",
                    "ayat":[ "وَإِذَا قِيلَ لَهُمْ آمِنُواْ بِمَا أَنزَلَ اللَّهُ قَالُواْ نُؤْمِنُ بِمَا أُنزِلَ عَلَيْنَا وَيَكْفُرُونَ بِمَا وَرَاءهُ وَهُوَ الْحَقُّ مُصَدِّقًا لِّمَا مَعَهُمْ قُلْ فَلِمَ تَقْتُلُونَ أَنبِيَاء اللَّهِ مِن قَبْلُ إِن كُنتُم مُّؤْمِنِينَ ٩١ وَلَقَدْ جَاءَكُم مُّوسَى بِالْبَيِّنَاتِ ثُمَّ اتَّخَذْتُمُ الْعِجْلَ مِن بَعْدِهِ وَأَنتُمْ ظَالِمُونَ ٩٢"
                ]},
                {
                    "id": 40,
                    "question": "موقفهم من ميثاق الطور ",
                    "ayat":[ "وَإِذْ أَخَذْنَا مِيثَاقَكُمْ وَرَفَعْنَا فَوْقَكُمُ الطُّورَ خُذُواْ مَا آتَيْنَاكُم بِقُوَّةٍ وَاسْمَعُواْ قَالُواْ سَمِعْنَا وَعَصَيْنَا وَأُشْرِبُواْ فِي قُلُوبِهِمُ الْعِجْلَ بِكُفْرِهِمْ قُلْ بِئْسَمَا يَأْمُرُكُمْ بِهِ إِيمَانُكُمْ إِن كُنتُمْ مُّؤْمِنِينَ ٩٣"
                ]},
                {
                    "id": 41,
                    "question": "تحديهم بتمني الموت، وبيان حرصهم على الحياة ",
                    "ayat":[ "قُلْ إِن كَانَتْ لَكُمُ الدَّارُ الآخِرَةُ عِندَ اللَّهِ خَالِصَةً مِّن دُونِ النَّاسِ فَتَمَنَّوُاْ الْمَوْتَ إِن كُنتُمْ صَادِقِينَ ٩٤ وَلَن يَتَمَنَّوْهُ أَبَدًا بِمَا قَدَّمَتْ أَيْدِيهِمْ وَاللَّهُ عَلِيمٌ بِالظَّالِمِينَ ٩٥ وَلَتَجِدَنَّهُمْ أَحْرَصَ النَّاسِ عَلَى حَيَاةٍ وَمِنَ الَّذِينَ أَشْرَكُواْ يَوَدُّ أَحَدُهُمْ لَوْ يُعَمَّرُ أَلْفَ سَنَةٍ وَمَا هُوَ بِمُزَحْزِحِهِ مِنَ الْعَذَابِ أَن يُعَمَّرَ وَاللَّهُ بَصِيرٌ بِمَا يَعْمَلُونَ ٩٦"
                ]},
                {
                    "id": 42,
                    "question": "الرد على عداوتهم لجبريل عليه السلام، وتوعدهم ",
                    "ayat":[ "قُلْ مَن كَانَ عَدُوًّا لِّجِبْرِيلَ فَإِنَّهُ نَزَّلَهُ عَلَى قَلْبِكَ بِإِذْنِ اللَّهِ مُصَدِّقًا لِّمَا بَيْنَ يَدَيْهِ وَهُدًى وَبُشْرَى لِلْمُؤْمِنِينَ ٩٧ مَن كَانَ عَدُوًّا لِّلَّهِ وَمَلائِكَتِهِ وَرُسُلِهِ وَجِبْرِيلَ وَمِيكَالَ فَإِنَّ اللَّهَ عَدُوٌّ لِّلْكَافِرِينَ ٩٨"
                ]},
                {
                    "id": 43,
                    "question": "بيان فسقهم بكفرهم بآيات الله ونبذهم العهود ",
                    "ayat":[ "وَلَقَدْ أَنزَلْنَا إِلَيْكَ آيَاتٍ بَيِّنَاتٍ وَمَا يَكْفُرُ بِهَا إِلاَّ الْفَاسِقُونَ ٩٩ أَوَكُلَّمَا عَاهَدُواْ عَهْدًا نَّبَذَهُ فَرِيقٌ مِّنْهُم بَلْ أَكْثَرُهُمْ لاَ يُؤْمِنُونَ ١٠٠"
                ]},
                {
                    "id": 44,
                    "question": "موقفهم من إرسال الرسول ﷺ",
                    "ayat":[ "وَلَمَّا جَاءَهُمْ رَسُولٌ مِّنْ عِندِ اللَّهِ مُصَدِّقٌ لِّمَا مَعَهُمْ نَبَذَ فَرِيقٌ مِّنَ الَّذِينَ أُوتُواْ الْكِتَابَ كِتَابَ اللَّهِ وَرَاء ظُهُورِهِمْ كَأَنَّهُمْ لاَ يَعْلَمُونَ ١٠١"
                ]},
                {
                    "id": 45,
                    "question": "اتباعهم للسحر، تبرئة سليمان عليه السلام منه، سوء عاقبتهم وجهلهم ",
                    "ayat":[ "وَاتَّبَعُواْ مَا تَتْلُواْ الشَّيَاطِينُ عَلَى مُلْكِ سُلَيْمَانَ وَمَا كَفَرَ سُلَيْمَانُ وَلَكِنَّ الشَّيَاطِينَ كَفَرُواْ يُعَلِّمُونَ النَّاسَ السِّحْرَ وَمَا أُنزِلَ عَلَى الْمَلَكَيْنِ بِبَابِلَ هَارُوتَ وَمَارُوتَ وَمَا يُعَلِّمَانِ مِنْ أَحَدٍ حَتَّى يَقُولاَ إِنَّمَا نَحْنُ فِتْنَةٌ فَلاَ تَكْفُرْ فَيَتَعَلَّمُونَ مِنْهُمَا مَا يُفَرِّقُونَ بِهِ بَيْنَ الْمَرْءِ وَزَوْجِهِ وَمَا هُم بِضَارِّينَ بِهِ مِنْ أَحَدٍ إِلاَّ بِإِذْنِ اللَّهِ وَيَتَعَلَّمُونَ مَا يَضُرُّهُمْ وَلاَ يَنفَعُهُمْ وَلَقَدْ عَلِمُواْ لَمَنِ اشْتَرَاهُ مَا لَهُ فِي الآخِرَةِ مِنْ خَلاقٍ وَلَبِئْسَ مَا شَرَوْا بِهِ أَنفُسَهُمْ لَوْ كَانُواْ يَعْلَمُونَ ١٠٢ وَلَوْ أَنَّهُمْ آمَنُواْ وَاتَّقَوْا لَمَثُوبَةٌ مِّنْ عِندِ اللَّه خَيْرٌ لَّوْ كَانُواْ يَعْلَمُونَ ١٠٣"
                ]},
                {
                    "id": 46,
                    "question": "توجيه المؤمنين للبعد عن الألفاظ المحتملة للسوء ",
                    "ayat":[ "َا أَيُّهَا الَّذِينَ آمَنُواْ لاَ تَقُولُواْ رَاعِنَا وَقُولُواْ انظُرْنَا وَاسْمَعُوا وَلِلْكَافِرِينَ عَذَابٌ أَلِيمٌ ١٠٤"
                ]},
                {
                    "id": 47,
                    "question": "بيان حسد أهل الكتاب والمشركين للمؤمنين ",
                    "ayat":[ "مَّا يَوَدُّ الَّذِينَ كَفَرُواْ مِنْ أَهْلِ الْكِتَابِ وَلاَ الْمُشْرِكِينَ أَن يُنَزَّلَ عَلَيْكُم مِّنْ خَيْرٍ مِّن رَّبِّكُمْ وَاللَّهُ يَخْتَصُّ بِرَحْمَتِهِ مَن يَشَاء وَاللَّهُ ذُو الْفَضْلِ الْعَظِيمِ ١٠٥"
                ]},
                {
                    "id": 48,
                    "question": "ثبوت النسخ في القرآن، والرد على منكريه ",
                    "ayat":[ "مَا نَنسَخْ مِنْ آيَةٍ أَوْ نُنسِهَا نَأْتِ بِخَيْرٍ مِّنْهَا أَوْ مِثْلِهَا أَلَمْ تَعْلَمْ أَنَّ اللَّهَ عَلَىَ كُلِّ شَيْءٍ قَدِيرٌ ١٠٦ أَلَمْ تَعْلَمْ أَنَّ اللَّهَ لَهُ مُلْكُ السَّمَاوَاتِ وَالأَرْضِ وَمَا لَكُم مِّن دُونِ اللَّهِ مِن وَلِيٍّ وَلاَ نَصِيرٍ ١٠٧"
                ]},
                {
                    "id": 49,
                    "question": "تحذير المؤمنين من التعنت في الأسئلة كقوم موسى عليه السلام ",
                    "ayat":[ "أَمْ تُرِيدُونَ أَن تَسْأَلُواْ رَسُولَكُمْ كَمَا سُئِلَ مُوسَى مِن قَبْلُ وَمَن يَتَبَدَّلِ الْكُفْرَ بِالإِيمَانِ فَقَدْ ضَلَّ سَوَاء السَّبِيلِ ١٠٨"
                ]},
                {
                    "id": 50,
                    "question": "التحذير من حسد أهل الكتاب خصوصا، وبيان كيفية مواجهتهم ",
                    "ayat":[ "وَدَّ كَثِيرٌ مِّنْ أَهْلِ الْكِتَابِ لَوْ يَرُدُّونَكُم مِّن بَعْدِ إِيمَانِكُمْ كُفَّاراً حَسَدًا مِّنْ عِندِ أَنفُسِهِم مِّن بَعْدِ مَا تَبَيَّنَ لَهُمُ الْحَقُّ فَاعْفُواْ وَاصْفَحُواْ حَتَّى يَأْتِيَ اللَّهُ بِأَمْرِهِ إِنَّ اللَّهَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ ١٠٩ وَأَقِيمُواْ الصَّلاةَ وَآتُواْ الزَّكَاةَ وَمَا تُقَدِّمُواْ لأَنفُسِكُم مِّنْ خَيْرٍ تَجِدُوهُ عِندَ اللَّهِ إِنَّ اللَّهَ بِمَا تَعْمَلُونَ بَصِيرٌ ١١٠"
                ]},
                {
                    "id": 51,
                    "question": "الرد على زعم أهل الكتاب أن الجنة خاصة باليهود والنصارى، وبيان تعاديهم فيما بينهم ",
                    "ayat":[ "وَقَالُواْ لَن يَدْخُلَ الْجَنَّةَ إِلاَّ مَن كَانَ هُودًا أَوْ نَصَارَى تِلْكَ أَمَانِيُّهُمْ قُلْ هَاتُواْ بُرْهَانَكُمْ إِن كُنتُمْ صَادِقِينَ ١١١ بَلَى مَنْ أَسْلَمَ وَجْهَهُ لِلَّهِ وَهُوَ مُحْسِنٌ فَلَهُ أَجْرُهُ عِندَ رَبِّهِ وَلاَ خَوْفٌ عَلَيْهِمْ وَلاَ هُمْ يَحْزَنُونَ ١١٢ وَقَالَتِ الْيَهُودُ لَيْسَتِ النَّصَارَى عَلَىَ شَيْءٍ وَقَالَتِ النَّصَارَى لَيْسَتِ الْيَهُودُ عَلَى شَيْءٍ وَهُمْ يَتْلُونَ الْكِتَابَ كَذَلِكَ قَالَ الَّذِينَ لاَ يَعْلَمُونَ مِثْلَ قَوْلِهِمْ فَاللَّهُ يَحْكُمُ بَيْنَهُمْ يَوْمَ الْقِيَامَةِ فِيمَا كَانُواْ فِيهِ يَخْتَلِفُونَ ١١٣"
                ]},
                {
                    "id": 52,
                    "question": "ذم النصارى لتخريبهم مساجد الله وجزاؤهم ",
                    "ayat":[ "وَمَنْ أَظْلَمُ مِمَّن مَّنَعَ مَسَاجِدَ اللَّهِ أَن يُذْكَرَ فِيهَا اسْمُهُ وَسَعَى فِي خَرَابِهَا أُوْلَئِكَ مَا كَانَ لَهُمْ أَن يَدْخُلُوهَا إِلاَّ خَائِفِينَ لَهُمْ فِي الدُّنْيَا خِزْيٌ وَلَهُمْ فِي الآخِرَةِ عَذَابٌ عَظِيمٌ ١١٤"
                ]},
                {
                    "id": 53,
                    "question": "عموم ملك الله وتنزيهه جل جلاله عن الولد، وبيان عظيم قدرته ",
                    "ayat":[ "وَلِلَّهِ الْمَشْرِقُ وَالْمَغْرِبُ فَأَيْنَمَا تُوَلُّواْ فَثَمَّ وَجْهُ اللَّهِ إِنَّ اللَّهَ وَاسِعٌ عَلِيمٌ ١١٥ وَقَالُواْ اتَّخَذَ اللَّهُ وَلَدًا سُبْحَانَهُ بَل لَّهُ مَا فِي السَّمَاوَاتِ وَالأَرْضِ كُلٌّ لَّهُ قَانِتُونَ ١١٦ بَدِيعُ السَّمَاوَاتِ وَالأَرْضِ وَإِذَا قَضَى أَمْرًا فَإِنَّمَا يَقُولُ لَهُ كُن فَيَكُونُ ١١٧"
                ]},
                {
                    "id": 54,
                    "question": "جهل النصارى بطلبهم تكليم الله لهم ",
                    "ayat":[ "وَقَالَ الَّذِينَ لاَ يَعْلَمُونَ لَوْلاَ يُكَلِّمُنَا اللَّهُ أَوْ تَأْتِيَنَا آيَةٌ كَذَلِكَ قَالَ الَّذِينَ مِن قَبْلِهِم مِّثْلَ قَوْلِهِمْ تَشَابَهَتْ قُلُوبُهُمْ قَدْ بَيَّنَّا الآيَاتِ لِقَوْمٍ يُوقِنُونَ ١١٨"
                ]},
                {
                    "id": 55,
                    "question": "تسلية: بيان مهام الرسول، وحقيقة أطماع اليهود والنصارى، والتحذير من اتباعهم ",
                    "ayat":[ "إِنَّا أَرْسَلْنَاكَ بِالْحَقِّ بَشِيرًا وَنَذِيرًا وَلاَ تُسْأَلُ عَنْ أَصْحَابِ الْجَحِيمِ ١١٩ وَلَن تَرْضَى عَنكَ الْيَهُودُ وَلاَ النَّصَارَى حَتَّى تَتَّبِعَ مِلَّتَهُمْ قُلْ إِنَّ هُدَى اللَّهِ هُوَ الْهُدَى وَلَئِنِ اتَّبَعْتَ أَهْوَاءهُم بَعْدَ الَّذِي جَاءَكَ مِنَ الْعِلْمِ مَا لَكَ مِنَ اللَّهِ مِن وَلِيٍّ وَلاَ نَصِيرٍ١٢٠"
                ]},
                {
                    "id": 56,
                    "question": "الثناء على مؤمني أهل الكتاب لتلاوتهم كتاب الله وعملهم به ",
                    "ayat":[ "الَّذِينَ آتَيْنَاهُمُ الْكِتَابَ يَتْلُونَهُ حَقَّ تِلاوَتِهِ أُوْلَئِكَ يُؤْمِنُونَ بِهِ وَمَن يَكْفُرْ بِهِ فَأُولَئِكَ هُمُ الْخَاسِرُونَ ١٢١"
                ]},
                {
                    "id": 57,
                    "question": "أمر بني إسرائيل بتذكير نعمة الله، والاستعداد ليوم القيامة ",
                    "ayat":[ "يَا بَنِي إِسْرَائِيلَ اذْكُرُواْ نِعْمَتِيَ الَّتِي أَنْعَمْتُ عَلَيْكُمْ وَأَنِّي فَضَّلْتُكُمْ عَلَى الْعَالَمِينَ ١٢٢ وَاتَّقُواْ يَوْمًا لاَّ تَجْزِي نَفْسٌ عَن نَّفْسٍ شَيْئًا وَلاَ يُقْبَلُ مِنْهَا عَدْلٌ وَلاَ تَنفَعُهَا شَفَاعَةٌ وَلاَ هُمْ يُنصَرُونَ ١٢٣"
                ]},
                {
                    "id": 58,
                    "question": "الابتلاء والإمامة ",
                    "ayat":[ "وَإِذِ ابْتَلَى إِبْرَاهِيمَ رَبُّهُ بِكَلِمَاتٍ فَأَتَمَّهُنَّ قَالَ إِنِّي جَاعِلُكَ لِلنَّاسِ إِمَامًا قَالَ وَمِن ذُرِّيَّتِي قَالَ لاَ يَنَالُ عَهْدِي الظَّالِمِينَ ١٢٤"
                ]},
                {
                    "id": 59,
                    "question": "خصائص البيت الحرام، وتشريف مقام إبراهيم عليه السلام، وتكليفه وإسماعيل ببناء البيت الحرام ودعوات إبراهيم وإسماعيل عليهما السلام ",
                    "ayat":[ "وَإِذْ جَعَلْنَا الْبَيْتَ مَثَابَةً لِّلنَّاسِ وَأَمْناً وَاتَّخِذُواْ مِن مَّقَامِ إِبْرَاهِيمَ مُصَلًّى وَعَهِدْنَا إِلَى إِبْرَاهِيمَ وَإِسْمَاعِيلَ أَن طَهِّرَا بَيْتِيَ لِلطَّائِفِينَ وَالْعَاكِفِينَ وَالرُّكَّعِ السُّجُودِ ١٢٥ وَإِذْ قَالَ إِبْرَاهِيمُ رَبِّ اجْعَلْ هَذَا بَلَدًا آمِنًا وَارْزُقْ أَهْلَهُ مِنَ الثَّمَرَاتِ مَنْ آمَنَ مِنْهُم بِاللَّهِ وَالْيَوْمِ الآخِرِ قَالَ وَمَن كَفَرَ فَأُمَتِّعُهُ قَلِيلاً ثُمَّ أَضْطَرُّهُ إِلَى عَذَابِ النَّارِ وَبِئْسَ الْمَصِيرُ ١٢٦ وَإِذْ يَرْفَعُ إِبْرَاهِيمُ الْقَوَاعِدَ مِنَ الْبَيْتِ وَإِسْمَاعِيلُ رَبَّنَا تَقَبَّلْ مِنَّا إِنَّكَ أَنتَ السَّمِيعُ الْعَلِيمُ ١٢٧ رَبَّنَا وَاجْعَلْنَا مُسْلِمَيْنِ لَكَ وَمِن ذُرِّيَّتِنَا أُمَّةً مُّسْلِمَةً لَّكَ وَأَرِنَا مَنَاسِكَنَا وَتُبْ عَلَيْنَا إِنَّكَ أَنتَ التَّوَّابُ الرَّحِيمُ ١٢٨ رَبَّنَا وَابْعَثْ فِيهِمْ رَسُولاً مِّنْهُمْ يَتْلُو عَلَيْهِمْ آيَاتِكَ وَيُعَلِّمُهُمُ الْكِتَابَ وَالْحِكْمَةَ وَيُزَكِّيهِمْ إِنَّكَ أَنتَ الْعَزِيزُ الْحَكِيمُ ١٢٩"
                ]},
                {
                    "id": 60,
                    "question": "ملة إبراهيم عليه السلام، واصطفاؤه وسببه ",
                    "ayat":[ "وَمَن يَرْغَبُ عَن مِّلَّةِ إِبْرَاهِيمَ إِلاَّ مَن سَفِهَ نَفْسَهُ وَلَقَدِ اصْطَفَيْنَاهُ فِي الدُّنْيَا وَإِنَّهُ فِي الآخِرَةِ لَمِنَ الصَّالِحِينَ ١٣٠ إِذْ قَالَ لَهُ رَبُّهُ أَسْلِمْ قَالَ أَسْلَمْتُ لِرَبِّ الْعَالَمِينَ ١٣١"
                ]},
                {
                    "id": 61,
                    "question": "وصية إبراهيم ويعقوب عليهما السلام، ومسؤولية الإنسان عن كسبه ",
                    "ayat":[ "وَوَصَّى بِهَا إِبْرَاهِيمُ بَنِيهِ وَيَعْقُوبُ يَا بَنِيَّ إِنَّ اللَّهَ اصْطَفَى لَكُمُ الدِّينَ فَلاَ تَمُوتُنَّ إِلاَّ وَأَنتُم مُّسْلِمُونَ ١٣٢ أَمْ كُنتُمْ شُهَدَاء إِذْ حَضَرَ يَعْقُوبَ الْمَوْتُ إِذْ قَالَ لِبَنِيهِ مَا تَعْبُدُونَ مِن بَعْدِي قَالُواْ نَعْبُدُ إِلَهَكَ وَإِلَهَ آبَائِكَ إِبْرَاهِيمَ وَإِسْمَاعِيلَ وَإِسْحَاقَ إِلَهًا وَاحِدًا وَنَحْنُ لَهُ مُسْلِمُونَ ١٣٣ تِلْكَ أُمَّةٌ قَدْ خَلَتْ لَهَا مَا كَسَبَتْ وَلَكُم مَّا كَسَبْتُمْ وَلاَ تُسْأَلُونَ عَمَّا كَانُوا يَعْمَلُونَ ١٣٤"
                ]},
                {
                    "id": 62,
                    "question": "مزاعم اليهود والنصارى في الهداية والرد عليهم بأن لزوم ملة إبراهيم والأنبياء جميعا هو طريق الهداية، تهديد المتولين عن ذلك، وظهور دين الله، وبطلان محاجاة اليهود والنصارى، وتأكيد مسؤولية الإنسان عن كسبه ",
                    "ayat":[ "وَقَالُواْ كُونُواْ هُودًا أَوْ نَصَارَى تَهْتَدُواْ قُلْ بَلْ مِلَّةَ إِبْرَاهِيمَ حَنِيفًا وَمَا كَانَ مِنَ الْمُشْرِكِينَ ١٣٥ قُولُواْ آمَنَّا بِاللَّهِ وَمَا أُنزِلَ إِلَيْنَا وَمَا أُنزِلَ إِلَى إِبْرَاهِيمَ وَإِسْمَاعِيلَ وَإِسْحَاقَ وَيَعْقُوبَ وَالأَسْبَاطِ وَمَا أُوتِيَ مُوسَى وَعِيسَى وَمَا أُوتِيَ النَّبِيُّونَ مِن رَّبِّهِمْ لاَ نُفَرِّقُ بَيْنَ أَحَدٍ مِّنْهُمْ وَنَحْنُ لَهُ مُسْلِمُونَ ١٣٦ فَإِنْ آمَنُواْ بِمِثْلِ مَا آمَنتُم بِهِ فَقَدِ اهْتَدَوْا وَّإِن تَوَلَّوْا فَإِنَّمَا هُمْ فِي شِقَاقٍ فَسَيَكْفِيكَهُمُ اللَّهُ وَهُوَ السَّمِيعُ الْعَلِيمُ ١٣٧ صِبْغَةَ اللَّهِ وَمَنْ أَحْسَنُ مِنَ اللَّهِ صِبْغَةً وَنَحْنُ لَهُ عَابِدُونَ ١٣٨ قُلْ أَتُحَاجُّونَنَا فِي اللَّهِ وَهُوَ رَبُّنَا وَرَبُّكُمْ وَلَنَا أَعْمَالُنَا وَلَكُمْ أَعْمَالُكُمْ وَنَحْنُ لَهُ مُخْلِصُونَ ١٣٩ أَمْ تَقُولُونَ إِنَّ إِبْرَاهِيمَ وَإِسْمَاعِيلَ وَإِسْحَاقَ وَيَعْقُوبَ وَالأَسْبَاطَ كَانُواْ هُودًا أَوْ نَصَارَى قُلْ أَأَنتُمْ أَعْلَمُ أَمِ اللَّهُ وَمَنْ أَظْلَمُ مِمَّن كَتَمَ شَهَادَةً عِندَهُ مِنَ اللَّهِ وَمَا اللَّهُ بِغَافِلٍ عَمَّا تَعْمَلُونَ ١٤٠ تِلْكَ أُمَّةٌ قَدْ خَلَتْ لَهَا مَا كَسَبَتْ وَلَكُم مَّا كَسَبْتُمْ وَلاَ تُسْأَلُونَ عَمَّا كَانُواْ يَعْمَلُونَ ١٤١"
                ]},
                {
                    "id": 63,
                    "question": "الإخبار عن موقف اليهود من تحويل القبلة والرد عليهم ",
                    "ayat":[ "سَيَقُولُ السُّفَهَاء مِنَ النَّاسِ مَا وَلاَّهُمْ عَن قِبْلَتِهِمُ الَّتِي كَانُواْ عَلَيْهَا قُل لِّلَّهِ الْمَشْرِقُ وَالْمَغْرِبُ يَهْدِي مَن يَشَاء إِلَى صِرَاطٍ مُّسْتَقِيمٍ ١٤٢"
                ]},
                {
                    "id": 64,
                    "question": "وسطية الأمة المحمدية وشهادتها على الأمم وسبب استقبال بيت المقدس ",
                    "ayat":[ "١وَكَذَلِكَ جَعَلْنَاكُمْ أُمَّةً وَسَطًا لِّتَكُونُواْ شُهَدَاء عَلَى النَّاسِ وَيَكُونَ الرَّسُولُ عَلَيْكُمْ شَهِيدًا وَمَا جَعَلْنَا الْقِبْلَةَ الَّتِي كُنتَ عَلَيْهَا إِلاَّ لِنَعْلَمَ مَن يَتَّبِعُ الرَّسُولَ مِمَّن يَنقَلِبُ عَلَى عَقِبَيْهِ وَإِن كَانَتْ لَكَبِيرَةً إِلاَّ عَلَى الَّذِينَ هَدَى اللَّهُ وَمَا كَانَ اللَّهُ لِيُضِيعَ إِيمَانَكُمْ إِنَّ اللَّهَ بِالنَّاسِ لَرَؤُوفٌ رَّحِيمٌ ٤٣"
                ]},
                {
                    "id": 65,
                    "question": "قرار عين الرسول ﷺ بتحويل القبلة إلى البيت الحرام، وبيان ضلال أهل الكتاب وعنادهم والتحذير من اتباع أههوائهم، وكتمان بعضهم للحق بعد معرفته، وتثبيت المؤمنين وحثهم على المسابقة للخيرات ",
                    "ayat":[ "قَدْ نَرَى تَقَلُّبَ وَجْهِكَ فِي السَّمَاء فَلَنُوَلِّيَنَّكَ قِبْلَةً تَرْضَاهَا فَوَلِّ وَجْهَكَ شَطْرَ الْمَسْجِدِ الْحَرَامِ وَحَيْثُ مَا كُنتُمْ فَوَلُّواْ وُجُوهَكُمْ شَطْرَهُ وَإِنَّ الَّذِينَ أُوتُواْ الْكِتَابَ لَيَعْلَمُونَ أَنَّهُ الْحَقُّ مِن رَّبِّهِمْ وَمَا اللَّهُ بِغَافِلٍ عَمَّا يَعْمَلُونَ ١٤٤ وَلَئِنْ أَتَيْتَ الَّذِينَ أُوتُواْ الْكِتَابَ بِكُلِّ آيَةٍ مَّا تَبِعُواْ قِبْلَتَكَ وَمَا أَنتَ بِتَابِعٍ قِبْلَتَهُمْ وَمَا بَعْضُهُم بِتَابِعٍ قِبْلَةَ بَعْضٍ وَلَئِنِ اتَّبَعْتَ أَهْوَاءهُم مِّن بَعْدِ مَا جَاءَكَ مِنَ الْعِلْمِ إِنَّكَ إِذَاً لَّمِنَ الظَّالِمِينَ ١٤٥ الَّذِينَ آتَيْنَاهُمُ الْكِتَابَ يَعْرِفُونَهُ كَمَا يَعْرِفُونَ أَبْنَاءَهُمْ وَإِنَّ فَرِيقًا مِّنْهُمْ لَيَكْتُمُونَ الْحَقَّ وَهُمْ يَعْلَمُونَ ١٤٦ الْحَقُّ مِن رَّبِّكَ فَلاَ تَكُونَنَّ مِنَ الْمُمْتَرِينَ ١٤٧ وَلِكُلٍّ وِجْهَةٌ هُوَ مُوَلِّيهَا فَاسْتَبِقُواْ الْخَيْرَاتِ أَيْنَ مَا تَكُونُواْ يَأْتِ بِكُمُ اللَّهُ جَمِيعًا إِنَّ اللَّهَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ ١٤٨"
                ]},
                {
                    "id": 66,
                    "question": "أمر النبي ﷺ ثم الأمة باستقبال المسجد الحرام في الأمصار والأسفار، وتثبيت المؤمنين وهدايتهم ",
                    "ayat":[ "وَمِنْ حَيْثُ خَرَجْتَ فَوَلِّ وَجْهَكَ شَطْرَ الْمَسْجِدِ الْحَرَامِ وَإِنَّهُ لَلْحَقُّ مِن رَّبِّكَ وَمَا اللَّهُ بِغَافِلٍ عَمَّا تَعْمَلُونَ ١٤٩ وَمِنْ حَيْثُ خَرَجْتَ فَوَلِّ وَجْهَكَ شَطْرَ الْمَسْجِدِ الْحَرَامِ وَحَيْثُ مَا كُنتُمْ فَوَلُّواْ وُجُوهَكُمْ شَطْرَهُ لِئَلاَّ يَكُونَ لِلنَّاسِ عَلَيْكُمْ حُجَّةٌ إِلاَّ الَّذِينَ ظَلَمُواْ مِنْهُمْ فَلاَ تَخْشَوْهُمْ وَاخْشَوْنِي وَلأُتِمَّ نِعْمَتِي عَلَيْكُمْ وَلَعَلَّكُمْ تَهْتَدُونَ ١٥٠"
                ]},
                {
                    "id": 67,
                    "question": "المنة بإرسال النبي ﷺ والأمر بالذكر والشكر ",
                    "ayat":[ "كَمَا أَرْسَلْنَا فِيكُمْ رَسُولاً مِّنكُمْ يَتْلُو عَلَيْكُمْ آيَاتِنَا وَيُزَكِّيكُمْ وَيُعَلِّمُكُمُ الْكِتَابَ وَالْحِكْمَةَ وَيُعَلِّمُكُم مَّا لَمْ تَكُونُواْ تَعْلَمُونَ ١٥١ فَاذْكُرُونِي أَذْكُرْكُمْ وَاشْكُرُواْ لِي وَلاَ تَكْفُرُونِ ١٥٢"
                ]},
                {
                    "id": 68,
                    "question": "أمر المؤمنين بالصبر والصلاة، وفضيلة الشهداء؛ والابتلاء وبشارة الصابرين وجزاؤهم ",
                    "ayat":[ "يَا أَيُّهَا الَّذِينَ آمَنُواْ اسْتَعِينُواْ بِالصَّبْرِ وَالصَّلاةِ إِنَّ اللَّهَ مَعَ الصَّابِرِينَ ١٥٣ وَلاَ تَقُولُواْ لِمَنْ يُقْتَلُ فِي سَبِيلِ اللَّهِ أَمْوَاتٌ بَلْ أَحْيَاء وَلَكِن لاَّ تَشْعُرُونَ ١٥٤ وَلَنَبْلُوَنَّكُمْ بِشَيْءٍ مِّنَ الْخَوْفْ وَالْجُوعِ وَنَقْصٍ مِّنَ الأَمْوَالِ وَالأنفُسِ وَالثَّمَرَاتِ وَبَشِّرِ الصَّابِرِينَ ١٥٥الَّذِينَ إِذَا أَصَابَتْهُم مُّصِيبَةٌ قَالُواْ إِنَّا لِلَّهِ وَإِنَّا إِلَيْهِ رَاجِعُونَ ١٥٦ أُوْلَئِكَ عَلَيْهِمْ صَلَوَاتٌ مِّن رَّبِّهِمْ وَرَحْمَةٌ وَأُولَئِكَ هُمُ الْمُهْتَدُونَ ١٥٧"
                ]},
                {
                    "id": 69,
                    "question": "تقرير أن الصفا والمروة من شعائر الحج والعمرة ",
                    "ayat":[ "إِنَّ الصَّفَا وَالْمَرْوَةَ مِن شَعَائِرِ اللَّهِ فَمَنْ حَجَّ الْبَيْتَ أَوِ اعْتَمَرَ فَلاَ جُنَاحَ عَلَيْهِ أَن يَطَّوَّفَ بِهِمَا وَمَن تَطَوَّعَ خَيْرًا فَإِنَّ اللَّهَ شَاكِرٌ عَلِيمٌ ١٥٨"
                ]},
                {
                    "id": 70,
                    "question": "لعن من يكتم العلم ومن يموت على الكفر ",
                    "ayat":[ "إِنَّ الَّذِينَ يَكْتُمُونَ مَا أَنزَلْنَا مِنَ الْبَيِّنَاتِ وَالْهُدَى مِن بَعْدِ مَا بَيَّنَّاهُ لِلنَّاسِ فِي الْكِتَابِ أُوْلَئِكَ يَلْعَنُهُمُ اللَّهُ وَيَلْعَنُهُمُ اللاَّعِنُونَ ١٥٩ إِلاَّ الَّذِينَ تَابُواْ وَأَصْلَحُواْ وَبَيَّنُواْ فَأُولَئِكَ أَتُوبُ عَلَيْهِمْ وَأَنَا التَّوَّابُ الرَّحِيمُ ١٦٠ إِنَّ الَّذِينَ كَفَرُوا وَمَاتُوا وَهُمْ كُفَّارٌ أُوْلَئِكَ عَلَيْهِمْ لَعْنَةُ اللَّهِ وَالْمَلائِكَةِ وَالنَّاسِ أَجْمَعِينَ ١٦١ خَالِدِينَ فِيهَا لاَ يُخَفَّفُ عَنْهُمُ الْعَذَابُ وَلاَ هُمْ يُنظَرُونَ ١٦٢"
                ]},
                {
                    "id": 71,
                    "question": "إثبات الوحدانية ودلائلها الكونية، والتنديد بشرك المحبة، وتبرؤ وحسرة الأتباع والمتبوعين يوم القيامة ",
                    "ayat":[ "وَإِلَهُكُمْ إِلَهٌ وَاحِدٌ لاَّ إِلَهَ إِلاَّ هُوَ الرَّحْمَنُ الرَّحِيمُ ١٦٣ إِنَّ فِي خَلْقِ السَّمَاوَاتِ وَالأَرْضِ وَاخْتِلافِ اللَّيْلِ وَالنَّهَارِ وَالْفُلْكِ الَّتِي تَجْرِي فِي الْبَحْرِ بِمَا يَنفَعُ النَّاسَ وَمَا أَنزَلَ اللَّهُ مِنَ السَّمَاء مِن مَّاء فَأَحْيَا بِهِ الأَرْضَ بَعْدَ مَوْتِهَا وَبَثَّ فِيهَا مِن كُلِّ دَابَّةٍ وَتَصْرِيفِ الرِّيَاحِ وَالسَّحَابِ الْمُسَخَّرِ بَيْنَ السَّمَاء وَالأَرْضِ لَآيَاتٍ لِّقَوْمٍ يَعْقِلُونَ ١٦٤ وَمِنَ النَّاسِ مَن يَتَّخِذُ مِن دُونِ اللَّهِ أَندَادًا يُحِبُّونَهُمْ كَحُبِّ اللَّهِ وَالَّذِينَ آمَنُواْ أَشَدُّ حُبًّا لِّلَّهِ وَلَوْ يَرَى الَّذِينَ ظَلَمُواْ إِذْ يَرَوْنَ الْعَذَابَ أَنَّ الْقُوَّةَ لِلَّهِ جَمِيعًا وَأَنَّ اللَّهَ شَدِيدُ الْعَذَابِ ١٦٥ إِذْ تَبَرَّأَ الَّذِينَ اتُّبِعُواْ مِنَ الَّذِينَ اتَّبَعُواْ وَرَأَوُاْ الْعَذَابَ وَتَقَطَّعَتْ بِهِمُ الأَسْبَابُ ١٦٦ وَقَالَ الَّذِينَ اتَّبَعُواْ لَوْ أَنَّ لَنَا كَرَّةً فَنَتَبَرَّأَ مِنْهُمْ كَمَا تَبَرَّؤُواْ مِنَّا كَذَلِكَ يُرِيهِمُ اللَّهُ أَعْمَالَهُمْ حَسَرَاتٍ عَلَيْهِمْ وَمَا هُم بِخَارِجِينَ مِنَ النَّارِ ١٦٧"
                ]},
                {
                    "id": 72,
                    "question": "إباحة الطيبات والتحذير من الشيطان، وبيان وجه عداوته، وإصرار الكفار على اتباع آبائهم، وضرب مثل لحالهم ",
                    "ayat":[ "يَا أَيُّهَا النَّاسُ كُلُواْ مِمَّا فِي الأَرْضِ حَلالاً طَيِّبًا وَلاَ تَتَّبِعُواْ خُطُوَاتِ الشَّيْطَانِ إِنَّهُ لَكُمْ عَدُوٌّ مُّبِينٌ ١٦٨ إِنَّمَا يَأْمُرُكُمْ بِالسُّوءِ وَالْفَحْشَاء وَأَن تَقُولُواْ عَلَى اللَّهِ مَا لاَ تَعْلَمُونَ ١٦٩ وَإِذَا قِيلَ لَهُمُ اتَّبِعُوا مَا أَنزَلَ اللَّهُ قَالُواْ بَلْ نَتَّبِعُ مَا أَلْفَيْنَا عَلَيْهِ آبَاءَنَا أَوَلَوْ كَانَ آبَاؤُهُمْ لاَ يَعْقِلُونَ شَيْئًا وَلاَ يَهْتَدُونَ ١٧٠ وَمَثَلُ الَّذِينَ كَفَرُواْ كَمَثَلِ الَّذِي يَنْعِقُ بِمَا لاَ يَسْمَعُ إِلاَّ دُعَاء وَنِدَاء صُمٌّ بُكْمٌ عُمْيٌ فَهُمْ لاَ يَعْقِلُونَ ١٧١"
                ]},
                {
                    "id": 73,
                    "question": "أمر المؤمنين بالأكل من الطيبات مع الشكر، وبيان أصناف المحرمات ",
                    "ayat":[ "يَا أَيُّهَا الَّذِينَ آمَنُواْ كُلُواْ مِن طَيِّبَاتِ مَا رَزَقْنَاكُمْ وَاشْكُرُواْ لِلَّهِ إِن كُنتُمْ إِيَّاهُ تَعْبُدُونَ ١٧٢ إِنَّمَا حَرَّمَ عَلَيْكُمُ الْمَيْتَةَ وَالدَّمَ وَلَحْمَ الْخِنزِيرِ وَمَا أُهِلَّ بِهِ لِغَيْرِ اللَّهِ فَمَنِ اضْطُرَّ غَيْرَ بَاغٍ وَلاَ عَادٍ فَلا إِثْمَ عَلَيْهِ إِنَّ اللَّهَ غَفُورٌ رَّحِيمٌ ١٧٣"
                ]},
                {
                    "id": 74,
                    "question": "تأكيد ذم كتم العلم ببيان جزائهم يوم القيامة، وتقرير ضلالهم واختلافهم فيما بينهم ",
                    "ayat":[ "إِنَّ الَّذِينَ يَكْتُمُونَ مَا أَنزَلَ اللَّهُ مِنَ الْكِتَابِ وَيَشْتَرُونَ بِهِ ثَمَنًا قَلِيلاً أُوْلَئِكَ مَا يَأْكُلُونَ فِي بُطُونِهِمْ إِلاَّ النَّارَ وَلاَ يُكَلِّمُهُمُ اللَّهُ يَوْمَ الْقِيَامَةِ وَلاَ يُزَكِّيهِمْ وَلَهُمْ عَذَابٌ أَلِيمٌ ١٧٤ أُوْلَئِكَ الَّذِينَ اشْتَرَوُاْ الضَّلالَةَ بِالْهُدَى وَالْعَذَابَ بِالْمَغْفِرَةِ فَمَا أَصْبَرَهُمْ عَلَى النَّارِ ١٧٥ ذَلِكَ بِأَنَّ اللَّهَ نَزَّلَ الْكِتَابَ بِالْحَقِّ وَإِنَّ الَّذِينَ اخْتَلَفُواْ فِي الْكِتَابِ لَفِي شِقَاقٍ بَعِيدٍ ١٧٦"
                ]},
                {
                    "id": 75,
                    "question": "بيان وجوه البر ردا على السفهاء ",
                    "ayat":[ "لَّيْسَ الْبِرَّ أَن تُوَلُّواْ وُجُوهَكُمْ قِبَلَ الْمَشْرِقِ وَالْمَغْرِبِ وَلَكِنَّ الْبِرَّ مَنْ آمَنَ بِاللَّهِ وَالْيَوْمِ الآخِرِ وَالْمَلائِكَةِ وَالْكِتَابِ وَالنَّبِيِّينَ وَآتَى الْمَالَ عَلَى حُبِّهِ ذَوِي الْقُرْبَى وَالْيَتَامَى وَالْمَسَاكِينَ وَابْنَ السَّبِيلِ وَالسَّائِلِينَ وَفِي الرِّقَابِ وَأَقَامَ الصَّلاةَ وَآتَى الزَّكَاةَ وَالْمُوفُونَ بِعَهْدِهِمْ إِذَا عَاهَدُواْ وَالصَّابِرِينَ فِي الْبَأْسَاء وَالضَّرَّاء وَحِينَ الْبَأْسِ أُوْلَئِكَ الَّذِينَ صَدَقُوا وَأُولَئِكَ هُمُ الْمُتَّقُونَ ١٧٧"
                ]},
                {
                    "id": 76,
                    "question": "من أحكام القصاص والوصية ",
                    "ayat":[ "يَا أَيُّهَا الَّذِينَ آمَنُواْ كُتِبَ عَلَيْكُمُ الْقِصَاصُ فِي الْقَتْلَى الْحُرُّ بِالْحُرِّ وَالْعَبْدُ بِالْعَبْدِ وَالأُنثَى بِالأُنثَى فَمَنْ عُفِيَ لَهُ مِنْ أَخِيهِ شَيْءٌ فَاتِّبَاعٌ بِالْمَعْرُوفِ وَأَدَاء إِلَيْهِ بِإِحْسَانٍ ذَلِكَ تَخْفِيفٌ مِّن رَّبِّكُمْ وَرَحْمَةٌ فَمَنِ اعْتَدَى بَعْدَ ذَلِكَ فَلَهُ عَذَابٌ أَلِيمٌ ١٧٨ وَلَكُمْ فِي الْقِصَاصِ حَيَاةٌ يَاْ أُولِيْ الأَلْبَابِ لَعَلَّكُمْ تَتَّقُونَ ١٧٩ كُتِبَ عَلَيْكُمْ إِذَا حَضَرَ أَحَدَكُمُ الْمَوْتُ إِن تَرَكَ خَيْرًا الْوَصِيَّةُ لِلْوَالِدَيْنِ وَالأَقْرَبِينَ بِالْمَعْرُوفِ حَقًّا عَلَى الْمُتَّقِينَ ١٨٠ فَمَن بَدَّلَهُ بَعْدَمَا سَمِعَهُ فَإِنَّمَا إِثْمُهُ عَلَى الَّذِينَ يُبَدِّلُونَهُ إِنَّ اللَّهَ سَمِيعٌ عَلِيمٌ ١٨١ فَمَنْ خَافَ مِن مُّوصٍ جَنَفًا أَوْ إِثْمًا فَأَصْلَحَ بَيْنَهُمْ فَلاَ إِثْمَ عَلَيْهِ إِنَّ اللَّهَ غَفُورٌ رَّحِيمٌ ١٨٢"
                ]},
                {
                    "id": 77,
                    "question": "من أحكام الصيام، رمضان والقرآن والدعاء والاعتكاف، وضربٌ من الأكل المحرم ",
                    "ayat":[ "يَا أَيُّهَا الَّذِينَ آمَنُواْ كُتِبَ عَلَيْكُمُ الصِّيَامُ كَمَا كُتِبَ عَلَى الَّذِينَ مِن قَبْلِكُمْ لَعَلَّكُمْ تَتَّقُونَ ١٨٣ أَيَّامًا مَّعْدُودَاتٍ فَمَن كَانَ مِنكُم مَّرِيضًا أَوْ عَلَى سَفَرٍ فَعِدَّةٌ مِّنْ أَيَّامٍ أُخَرَ وَعَلَى الَّذِينَ يُطِيقُونَهُ فِدْيَةٌ طَعَامُ مِسْكِينٍ فَمَن تَطَوَّعَ خَيْرًا فَهُوَ خَيْرٌ لَّهُ وَأَن تَصُومُواْ خَيْرٌ لَّكُمْ إِن كُنتُمْ تَعْلَمُونَ ١٨٤ شَهْرُ رَمَضَانَ الَّذِيَ أُنزِلَ فِيهِ الْقُرْآنُ هُدًى لِّلنَّاسِ وَبَيِّنَاتٍ مِّنَ الْهُدَى وَالْفُرْقَانِ فَمَن شَهِدَ مِنكُمُ الشَّهْرَ فَلْيَصُمْهُ وَمَن كَانَ مَرِيضًا أَوْ عَلَى سَفَرٍ فَعِدَّةٌ مِّنْ أَيَّامٍ أُخَرَ يُرِيدُ اللَّهُ بِكُمُ الْيُسْرَ وَلاَ يُرِيدُ بِكُمُ الْعُسْرَ وَلِتُكْمِلُواْ الْعِدَّةَ وَلِتُكَبِّرُواْ اللَّهَ عَلَى مَا هَدَاكُمْ وَلَعَلَّكُمْ تَشْكُرُونَ ١٨٥ وَإِذَا سَأَلَكَ عِبَادِي عَنِّي فَإِنِّي قَرِيبٌ أُجِيبُ دَعْوَةَ الدَّاعِ إِذَا دَعَانِ فَلْيَسْتَجِيبُواْ لِي وَلْيُؤْمِنُواْ بِي لَعَلَّهُمْ يَرْشُدُونَ ١٨٦ أُحِلَّ لَكُمْ لَيْلَةَ الصِّيَامِ الرَّفَثُ إِلَى نِسَائِكُمْ هُنَّ لِبَاسٌ لَّكُمْ وَأَنتُمْ لِبَاسٌ لَّهُنَّ عَلِمَ اللَّهُ أَنَّكُمْ كُنتُمْ تَخْتَانُونَ أَنفُسَكُمْ فَتَابَ عَلَيْكُمْ وَعَفَا عَنكُمْ فَالآنَ بَاشِرُوهُنَّ وَابْتَغُواْ مَا كَتَبَ اللَّهُ لَكُمْ وَكُلُواْ وَاشْرَبُواْ حَتَّى يَتَبَيَّنَ لَكُمُ الْخَيْطُ الأَبْيَضُ مِنَ الْخَيْطِ الأَسْوَدِ مِنَ الْفَجْرِ ثُمَّ أَتِمُّواْ الصِّيَامَ إِلَى اللَّيْلِ وَلاَ تُبَاشِرُوهُنَّ وَأَنتُمْ عَاكِفُونَ فِي الْمَسَاجِدِ تِلْكَ حُدُودُ اللَّهِ فَلاَ تَقْرَبُوهَا كَذَلِكَ يُبَيِّنُ اللَّهُ آيَاتِهِ لِلنَّاسِ لَعَلَّهُمْ يَتَّقُونَ ١٨٧ وَلاَ تَأْكُلُواْ أَمْوَالَكُم بَيْنَكُم بِالْبَاطِلِ وَتُدْلُواْ بِهَا إِلَى الْحُكَّامِ لِتَأْكُلُواْ فَرِيقًا مِّنْ أَمْوَالِ النَّاسِ بِالإِثْمِ وَأَنتُمْ تَعْلَمُونَ ١٨٨"
                ]},
                {
                    "id": 78,
                    "question": "جواب السائلين عن الأهلة ",
                    "ayat":[ "يَسْأَلُونَكَ عَنِ الأهِلَّةِ قُلْ هِيَ مَوَاقِيتُ لِلنَّاسِ وَالْحَجِّ وَلَيْسَ الْبِرُّ بِأَنْ تَأْتُوْا الْبُيُوتَ مِن ظُهُورِهَا وَلَكِنَّ الْبِرَّ مَنِ اتَّقَى وَأْتُواْ الْبُيُوتَ مِنْ أَبْوَابِهَا وَاتَّقُواْ اللَّهَ لَعَلَّكُمْ تُفْلِحُونَ ١٨٩"
                ]},
                {
                    "id": 79,
                    "question": "قتال الدفع، وحكمه في الأشهر الحرم، والحث على الانفاق في سبيل الله ",
                    "ayat":[ "وَقَاتِلُواْ فِي سَبِيلِ اللَّهِ الَّذِينَ يُقَاتِلُونَكُمْ وَلاَ تَعْتَدُواْ إِنَّ اللَّهَ لاَ يُحِبُّ الْمُعْتَدِينَ ١٩٠ وَاقْتُلُوهُمْ حَيْثُ ثَقِفْتُمُوهُمْ وَأَخْرِجُوهُم مِّنْ حَيْثُ أَخْرَجُوكُمْ وَالْفِتْنَةُ أَشَدُّ مِنَ الْقَتْلِ وَلاَ تُقَاتِلُوهُمْ عِندَ الْمَسْجِدِ الْحَرَامِ حَتَّى يُقَاتِلُوكُمْ فِيهِ فَإِن قَاتَلُوكُمْ فَاقْتُلُوهُمْ كَذَلِكَ جَزَاء الْكَافِرِينَ ١٩١ فَإِنِ انتَهَوْا فَإِنَّ اللَّهَ غَفُورٌ رَّحِيمٌ ١٩٢ وَقَاتِلُوهُمْ حَتَّى لاَ تَكُونَ فِتْنَةٌ وَيَكُونَ الدِّينُ لِلَّهِ فَإِنِ انتَهَوْا فَلاَ عُدْوَانَ إِلاَّ عَلَى الظَّالِمِينَ ١٩٣ الشَّهْرُ الْحَرَامُ بِالشَّهْرِ الْحَرَامِ وَالْحُرُمَاتُ قِصَاصٌ فَمَنِ اعْتَدَى عَلَيْكُمْ فَاعْتَدُواْ عَلَيْهِ بِمِثْلِ مَا اعْتَدَى عَلَيْكُمْ وَاتَّقُواْ اللَّهَ وَاعْلَمُواْ أَنَّ اللَّهَ مَعَ الْمُتَّقِينَ ١٩٤ وَأَنفِقُواْ فِي سَبِيلِ اللَّهِ وَلاَ تُلْقُواْ بِأَيْدِيكُمْ إِلَى التَّهْلُكَةِ وَأَحْسِنُواْ إِنَّ اللَّهَ يُحِبُّ الْمُحْسِنِينَ ١٩٥"
                ]},
                {
                    "id": 80,
                    "question": "من أحكام الحج والعمرة \"الاحرام والزاد والكسب والذكر والإفاضة والدعاء والتعجل\" ",
                    "ayat":[ "وَأَتِمُّواْ الْحَجَّ وَالْعُمْرَةَ لِلَّهِ فَإِنْ أُحْصِرْتُمْ فَمَا اسْتَيْسَرَ مِنَ الْهَدْيِ وَلاَ تَحْلِقُواْ رُؤُوسَكُمْ حَتَّى يَبْلُغَ الْهَدْيُ مَحِلَّهُ فَمَن كَانَ مِنكُم مَّرِيضًا أَوْ بِهِ أَذًى مِّن رَّأْسِهِ فَفِدْيَةٌ مِّن صِيَامٍ أَوْ صَدَقَةٍ أَوْ نُسُكٍ فَإِذَا أَمِنتُمْ فَمَن تَمَتَّعَ بِالْعُمْرَةِ إِلَى الْحَجِّ فَمَا اسْتَيْسَرَ مِنَ الْهَدْيِ فَمَن لَّمْ يَجِدْ فَصِيَامُ ثَلاثَةِ أَيَّامٍ فِي الْحَجِّ وَسَبْعَةٍ إِذَا رَجَعْتُمْ تِلْكَ عَشَرَةٌ كَامِلَةٌ ذَلِكَ لِمَن لَّمْ يَكُنْ أَهْلُهُ حَاضِرِي الْمَسْجِدِ الْحَرَامِ وَاتَّقُواْ اللَّهَ وَاعْلَمُواْ أَنَّ اللَّهَ شَدِيدُ الْعِقَابِ ١٩٦ الْحَجُّ أَشْهُرٌ مَّعْلُومَاتٌ فَمَن فَرَضَ فِيهِنَّ الْحَجَّ فَلاَ رَفَثَ وَلاَ فُسُوقَ وَلاَ جِدَالَ فِي الْحَجِّ وَمَا تَفْعَلُواْ مِنْ خَيْرٍ يَعْلَمْهُ اللَّهُ وَتَزَوَّدُواْ فَإِنَّ خَيْرَ الزَّادِ التَّقْوَى وَاتَّقُونِ يَا أُولِي الأَلْبَابِ ١٩٧ لَيْسَ عَلَيْكُمْ جُنَاحٌ أَن تَبْتَغُواْ فَضْلاً مِّن رَّبِّكُمْ فَإِذَا أَفَضْتُم مِّنْ عَرَفَاتٍ فَاذْكُرُواْ اللَّهَ عِندَ الْمَشْعَرِ الْحَرَامِ وَاذْكُرُوهُ كَمَا هَدَاكُمْ وَإِن كُنتُم مِّن قَبْلِهِ لَمِنَ الضَّالِّينَ ١٩٨ ثُمَّ أَفِيضُواْ مِنْ حَيْثُ أَفَاضَ النَّاسُ وَاسْتَغْفِرُواْ اللَّهَ إِنَّ اللَّهَ غَفُورٌ رَّحِيمٌ ١٩٩ فَإِذَا قَضَيْتُم مَّنَاسِكَكُمْ فَاذْكُرُواْ اللَّهَ كَذِكْرِكُمْ آبَاءَكُمْ أَوْ أَشَدَّ ذِكْرًا فَمِنَ النَّاسِ مَن يَقُولُ رَبَّنَا آتِنَا فِي الدُّنْيَا وَمَا لَهُ فِي الآخِرَةِ مِنْ خَلاقٍ ٢٠٠ وَمِنْهُم مَّن يَقُولُ رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ ٢٠١ أُوْلَئِكَ لَهُمْ نَصِيبٌ مِّمَّا كَسَبُواْ وَاللَّهُ سَرِيعُ الْحِسَابِ ٢٠٢ وَاذْكُرُواْ اللَّهَ فِي أَيَّامٍ مَّعْدُودَاتٍ فَمَن تَعَجَّلَ فِي يَوْمَيْنِ فَلاَ إِثْمَ عَلَيْهِ وَمَن تَأَخَّرَ فَلا إِثْمَ عَلَيْهِ لِمَنِ اتَّقَى وَاتَّقُواْ اللَّهَ وَاعْلَمُوا أَنَّكُمْ إِلَيْهِ تُحْشَرُونَ ٢٠٣"
                ]},
                {
                    "id": 81,
                    "question": "نموذجي المنافق المفسد والمؤمن المرضي ",
                    "ayat":[ "وَمِنَ النَّاسِ مَن يُعْجِبُكَ قَوْلُهُ فِي الْحَيَاةِ الدُّنْيَا وَيُشْهِدُ اللَّهَ عَلَى مَا فِي قَلْبِهِ وَهُوَ أَلَدُّ الْخِصَامِ ٢٠٤ وَإِذَا تَوَلَّى سَعَى فِي الأَرْضِ لِيُفْسِدَ فِيهَا وَيُهْلِكَ الْحَرْثَ وَالنَّسْلَ وَاللَّهُ لاَ يُحِبُّ الْفَسَادَ ٢٠٥ وَإِذَا قِيلَ لَهُ اتَّقِ اللَّهَ أَخَذَتْهُ الْعِزَّةُ بِالإِثْمِ فَحَسْبُهُ جَهَنَّمُ وَلَبِئْسَ الْمِهَادُ ٢٠٦ وَمِنَ النَّاسِ مَن يَشْرِي نَفْسَهُ ابْتِغَاء مَرْضَاتِ اللَّهِ وَاللَّهُ رَؤُوفٌ بِالْعِبَادِ ٢٠٧"
                ]},
                {
                    "id": 82,
                    "question": "الدعوة للدخول في الإسلام، والتحذير من خطوات الشيطان ووعيد أتباعه، وبيان تبديل بني إسرائيل لنعمة الله واغترار الكفار على المؤمنين بالدنيا ",
                    "ayat":[ "يَا أَيُّهَا الَّذِينَ آمَنُواْ ادْخُلُواْ فِي السِّلْمِ كَافَّةً وَلاَ تَتَّبِعُواْ خُطُوَاتِ الشَّيْطَانِ إِنَّهُ لَكُمْ عَدُوٌّ مُّبِينٌ ٢٠٨ فَإِن زَلَلْتُمْ مِّن بَعْدِ مَا جَاءَتْكُمُ الْبَيِّنَاتُ فَاعْلَمُواْ أَنَّ اللَّهَ عَزِيزٌ حَكِيمٌ ٢٠٩ هَلْ يَنظُرُونَ إِلاَّ أَن يَأْتِيَهُمُ اللَّهُ فِي ظُلَلٍ مِّنَ الْغَمَامِ وَالْمَلائِكَةُ وَقُضِيَ الأَمْرُ وَإِلَى اللَّهِ تُرْجَعُ الأُمُورُ ٢١٠ سَلْ بَنِي إِسْرَائِيلَ كَمْ آتَيْنَاهُم مِّنْ آيَةٍ بَيِّنَةٍ وَمَن يُبَدِّلْ نِعْمَةَ اللَّهِ مِن بَعْدِ مَا جَاءَتْهُ فَإِنَّ اللَّهَ شَدِيدُ الْعِقَابِ ٢١١ زُيِّنَ لِلَّذِينَ كَفَرُواْ الْحَيَاةُ الدُّنْيَا وَيَسْخَرُونَ مِنَ الَّذِينَ آمَنُواْ وَالَّذِينَ اتَّقَواْ فَوْقَهُمْ يَوْمَ الْقِيَامَةِ وَاللَّهُ يَرْزُقُ مَن يَشَاء بِغَيْرِ حِسَابٍ ٢١٢"
                ]},
                {
                    "id": 83,
                    "question": "تاريخ الوحدة والاختلاف والهداية بالرسل والكتب ",
                    "ayat":[ "كَانَ النَّاسُ أُمَّةً وَاحِدَةً فَبَعَثَ اللَّهُ النَّبِيِّينَ مُبَشِّرِينَ وَمُنذِرِينَ وَأَنزَلَ مَعَهُمُ الْكِتَابَ بِالْحَقِّ لِيَحْكُمَ بَيْنَ النَّاسِ فِيمَا اخْتَلَفُواْ فِيهِ وَمَا اخْتَلَفَ فِيهِ إِلاَّ الَّذِينَ أُوتُوهُ مِن بَعْدِ مَا جَاءَتْهُمُ الْبَيِّنَاتُ بَغْيًا بَيْنَهُمْ فَهَدَى اللَّهُ الَّذِينَ آمَنُواْ لِمَا اخْتَلَفُواْ فِيهِ مِنَ الْحَقِّ بِإِذْنِهِ وَاللَّهُ يَهْدِي مَن يَشَاء إِلَى صِرَاطٍ مُّسْتَقِيمٍ ٢١٣"
                ]},
                {
                    "id": 84,
                    "question": "تسلية: الابتلاء سنة كونية للرسل والمؤمنين ",
                    "ayat":[ "أَمْ حَسِبْتُمْ أَن تَدْخُلُواْ الْجَنَّةَ وَلَمَّا يَأْتِكُم مَّثَلُ الَّذِينَ خَلَوْا مِن قَبْلِكُم مَّسَّتْهُمُ الْبَأْسَاء وَالضَّرَّاء وَزُلْزِلُواْ حَتَّى يَقُولَ الرَّسُولُ وَالَّذِينَ آمَنُواْ مَعَهُ مَتَى نَصْرُ اللَّهِ أَلا إِنَّ نَصْرَ اللَّهِ قَرِيبٌ ٢١٤"
                ]},
                {
                    "id": 85,
                    "question": "جواب السائلين عن نفقة التطوع والحث عليها ",
                    "ayat":[ "يَسْأَلُونَكَ مَاذَا يُنفِقُونَ قُلْ مَا أَنفَقْتُم مِّنْ خَيْرٍ فَلِلْوَالِدَيْنِ وَالأَقْرَبِينَ وَالْيَتَامَى وَالْمَسَاكِينِ وَابْنِ السَّبِيلِ وَمَا تَفْعَلُواْ مِنْ خَيْرٍ فَإِنَّ اللَّهَ بِهِ عَلِيمٌ ٢١٥"
                ]},
                {
                    "id": 86,
                    "question": "فرضية القتال والتحذير من كرهه.  وجواب السائلين عن القتال في الأشهر الحرم، والثناء على المهاجرين المجاهدين ",
                    "ayat":[ "كُتِبَ عَلَيْكُمُ الْقِتَالُ وَهُوَ كُرْهٌ لَّكُمْ وَعَسَى أَن تَكْرَهُواْ شَيْئًا وَهُوَ خَيْرٌ لَّكُمْ وَعَسَى أَن تُحِبُّواْ شَيْئًا وَهُوَ شَرٌّ لَّكُمْ وَاللَّهُ يَعْلَمُ وَأَنتُمْ لاَ تَعْلَمُونَ ٢١٦ يَسْأَلُونَكَ عَنِ الشَّهْرِ الْحَرَامِ قِتَالٍ فِيهِ قُلْ قِتَالٌ فِيهِ كَبِيرٌ وَصَدٌّ عَن سَبِيلِ اللَّهِ وَكُفْرٌ بِهِ وَالْمَسْجِدِ الْحَرَامِ وَإِخْرَاجُ أَهْلِهِ مِنْهُ أَكْبَرُ عِندَ اللَّهِ وَالْفِتْنَةُ أَكْبَرُ مِنَ الْقَتْلِ وَلاَ يَزَالُونَ يُقَاتِلُونَكُمْ حَتَّىَ يَرُدُّوكُمْ عَن دِينِكُمْ إِنِ اسْتَطَاعُواْ وَمَن يَرْتَدِدْ مِنكُمْ عَن دِينِهِ فَيَمُتْ وَهُوَ كَافِرٌ فَأُولَئِكَ حَبِطَتْ أَعْمَالُهُمْ فِي الدُّنْيَا وَالآخِرَةِ وَأُولَئِكَ أَصْحَابُ النَّارِ هُمْ فِيهَا خَالِدُونَ ٢١٧ إِنَّ الَّذِينَ آمَنُواْ وَالَّذِينَ هَاجَرُواْ وَجَاهَدُواْ فِي سَبِيلِ اللَّهِ أُوْلَئِكَ يَرْجُونَ رَحْمَتَ اللَّهِ وَاللَّهُ غَفُورٌ رَّحِيمٌ ٢١٨"
                ]},
                {
                    "id": 87,
                    "question": "جواب السائلين عن الخمر والميسر، وتكرار السؤال عن النفقة، وجواب السائلين عن اليتامى ",
                    "ayat":[ "يَسْأَلُونَكَ عَنِ الْخَمْرِ وَالْمَيْسِرِ قُلْ فِيهِمَا إِثْمٌ كَبِيرٌ وَمَنَافِعُ لِلنَّاسِ وَإِثْمُهُمَا أَكْبَرُ مِن نَّفْعِهِمَا وَيَسْأَلُونَكَ مَاذَا يُنفِقُونَ قُلِ الْعَفْوَ كَذَلِكَ يُبَيِّنُ اللَّهُ لَكُمُ الآيَاتِ لَعَلَّكُمْ تَتَفَكَّرُونَ ٢١٩ فِي الدُّنْيَا وَالآخِرَةِ وَيَسْأَلُونَكَ عَنِ الْيَتَامَى قُلْ إِصْلاحٌ لَّهُمْ خَيْرٌ وَإِنْ تُخَالِطُوهُمْ فَإِخْوَانُكُمْ وَاللَّهُ يَعْلَمُ الْمُفْسِدَ مِنَ الْمُصْلِحِ وَلَوْ شَاء اللَّهُ لأعْنَتَكُمْ إِنَّ اللَّهَ عَزِيزٌ حَكِيمٌ ٢٢٠"
                ]},
                {
                    "id": 88,
                    "question": "حكم نكاح المشركات والمشركين ",
                    "ayat":[ "وَلاَ تَنكِحُواْ الْمُشْرِكَاتِ حَتَّى يُؤْمِنَّ وَلأَمَةٌ مُّؤْمِنَةٌ خَيْرٌ مِّن مُّشْرِكَةٍ وَلَوْ أَعْجَبَتْكُمْ وَلاَ تُنكِحُواْ الْمُشْرِكِينَ حَتَّى يُؤْمِنُواْ وَلَعَبْدٌ مُّؤْمِنٌ خَيْرٌ مِّن مُّشْرِكٍ وَلَوْ أَعْجَبَكُمْ أُوْلَئِكَ يَدْعُونَ إِلَى النَّارِ وَاللَّهُ يَدْعُوَ إِلَى الْجَنَّةِ وَالْمَغْفِرَةِ بِإِذْنِهِ وَيُبَيِّنُ آيَاتِهِ لِلنَّاسِ لَعَلَّهُمْ يَتَذَكَّرُونَ ٢٢١"
                ]},
                {
                    "id": 89,
                    "question": "جواب السائلين عن المحيض ",
                    "ayat":[ "وَيَسْأَلُونَكَ عَنِ الْمَحِيضِ قُلْ هُوَ أَذًى فَاعْتَزِلُواْ النِّسَاء فِي الْمَحِيضِ وَلاَ تَقْرَبُوهُنَّ حَتَّىَ يَطْهُرْنَ فَإِذَا تَطَهَّرْنَ فَأْتُوهُنَّ مِنْ حَيْثُ أَمَرَكُمُ اللَّهُ إِنَّ اللَّهَ يُحِبُّ التَّوَّابِينَ وَيُحِبُّ الْمُتَطَهِّرِينَ ٢٢٢ نِسَاؤُكُمْ حَرْثٌ لَّكُمْ فَأْتُواْ حَرْثَكُمْ أَنَّى شِئْتُمْ وَقَدِّمُواْ لأَنفُسِكُمْ وَاتَّقُواْ اللَّهَ وَاعْلَمُواْ أَنَّكُم مُّلاقُوهُ وَبَشِّرِ الْمُؤْمِنِينَ ٢٢٣"
                ]},
                {
                    "id": 90,
                    "question": "النهي عن اتخاذ اليمين مانعا من الخيرات، وحكم يمين اللغو ",
                    "ayat":[ "وَلاَ تَجْعَلُواْ اللَّهَ عُرْضَةً لِّأَيْمَانِكُمْ أَن تَبَرُّواْ وَتَتَّقُواْ وَتُصْلِحُواْ بَيْنَ النَّاسِ وَاللَّهُ سَمِيعٌ عَلِيمٌ ٢٢٤ لاَّ يُؤَاخِذُكُمُ اللَّهُ بِاللَّغْوِ فِيَ أَيْمَانِكُمْ وَلَكِن يُؤَاخِذُكُم بِمَا كَسَبَتْ قُلُوبُكُمْ وَاللَّهُ غَفُورٌ حَلِيمٌ ٢٢٥"
                ]},
                {
                    "id": 91,
                    "question": "يمين الإيلاء ",
                    "ayat":[ "لِّلَّذِينَ يُؤْلُونَ مِن نِّسَائِهِمْ تَرَبُّصُ أَرْبَعَةِ أَشْهُرٍ فَإِنْ فَاءوا فَإِنَّ اللَّهَ غَفُورٌ رَّحِيمٌ ٢٢٦ وَإِنْ عَزَمُواْ الطَّلاقَ فَإِنَّ اللَّهَ سَمِيعٌ عَلِيمٌ ٢٢٧"
                ]},
                {
                    "id": 92,
                    "question": "يمين الطلاق \"العدة، عدد مرات الطلاق، وما يترتب على البينونة الكبرى، والنهي عن المضارة والعضل",
                    "ayat":[ "وَالْمُطَلَّقَاتُ يَتَرَبَّصْنَ بِأَنفُسِهِنَّ ثَلاثَةَ قُرُوءٍ وَلاَ يَحِلُّ لَهُنَّ أَن يَكْتُمْنَ مَا خَلَقَ اللَّهُ فِي أَرْحَامِهِنَّ إِن كُنَّ يُؤْمِنَّ بِاللَّهِ وَالْيَوْمِ الآخِرِ وَبُعُولَتُهُنَّ أَحَقُّ بِرَدِّهِنَّ فِي ذَلِكَ إِنْ أَرَادُواْ إِصْلاحًا وَلَهُنَّ مِثْلُ الَّذِي عَلَيْهِنَّ بِالْمَعْرُوفِ وَلِلرِّجَالِ عَلَيْهِنَّ دَرَجَةٌ وَاللَّهُ عَزِيزٌ حَكِيمٌ ٢٢٨ الطَّلاقُ مَرَّتَانِ فَإِمْسَاكٌ بِمَعْرُوفٍ أَوْ تَسْرِيحٌ بِإِحْسَانٍ وَلاَ يَحِلُّ لَكُمْ أَن تَأْخُذُواْ مِمَّا آتَيْتُمُوهُنَّ شَيْئًا إِلاَّ أَن يَخَافَا أَلاَّ يُقِيمَا حُدُودَ اللَّهِ فَإِنْ خِفْتُمْ أَلاَّ يُقِيمَا حُدُودَ اللَّهِ فَلاَ جُنَاحَ عَلَيْهِمَا فِيمَا افْتَدَتْ بِهِ تِلْكَ حُدُودُ اللَّهِ فَلاَ تَعْتَدُوهَا وَمَن يَتَعَدَّ حُدُودَ اللَّهِ فَأُولَئِكَ هُمُ الظَّالِمُونَ ٢٢٩ فَإِن طَلَّقَهَا فَلاَ تَحِلُّ لَهُ مِن بَعْدُ حَتَّىَ تَنكِحَ زَوْجًا غَيْرَهُ فَإِن طَلَّقَهَا فَلاَ جُنَاحَ عَلَيْهِمَا أَن يَتَرَاجَعَا إِن ظَنَّا أَن يُقِيمَا حُدُودَ اللَّهِ وَتِلْكَ حُدُودُ اللَّهِ يُبَيِّنُهَا لِقَوْمٍ يَعْلَمُونَ ٢٣٠ وَإِذَا طَلَّقْتُمُ النِّسَاء فَبَلَغْنَ أَجَلَهُنَّ فَأَمْسِكُوهُنَّ بِمَعْرُوفٍ أَوْ سَرِّحُوهُنَّ بِمَعْرُوفٍ وَلاَ تُمْسِكُوهُنَّ ضِرَارًا لِّتَعْتَدُواْ وَمَن يَفْعَلْ ذَلِكَ فَقَدْ ظَلَمَ نَفْسَهُ وَلاَ تَتَّخِذُواْ آيَاتِ اللَّهِ هُزُوًا وَاذْكُرُواْ نِعْمَتَ اللَّهِ عَلَيْكُمْ وَمَا أَنزَلَ عَلَيْكُمْ مِّنَ الْكِتَابِ وَالْحِكْمَةِ يَعِظُكُم بِهِ وَاتَّقُواْ اللَّهَ وَاعْلَمُواْ أَنَّ اللَّهَ بِكُلِّ شَيْءٍ عَلِيمٌ ٢٣١ وَإِذَا طَلَّقْتُمُ النِّسَاء فَبَلَغْنَ أَجَلَهُنَّ فَلاَ تَعْضُلُوهُنَّ أَن يَنكِحْنَ أَزْوَاجَهُنَّ إِذَا تَرَاضَوْا بَيْنَهُم بِالْمَعْرُوفِ ذَلِكَ يُوعَظُ بِهِ مَن كَانَ مِنكُمْ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخِرِ ذَلِكُمْ أَزْكَى لَكُمْ وَأَطْهَرُ وَاللَّهُ يَعْلَمُ وَأَنتُمْ لاَ تَعْلَمُونَ ٢٣٢"
                ]},
                {
                    "id": 93,
                    "question": "من أحكام الرضاع والنفقة للمواليد ",
                    "ayat":[ "وَالْوَالِدَاتُ يُرْضِعْنَ أَوْلادَهُنَّ حَوْلَيْنِ كَامِلَيْنِ لِمَنْ أَرَادَ أَن يُتِمَّ الرَّضَاعَةَ وَعَلَى الْمَوْلُودِ لَهُ رِزْقُهُنَّ وَكِسْوَتُهُنَّ بِالْمَعْرُوفِ لاَ تُكَلَّفُ نَفْسٌ إِلاَّ وُسْعَهَا لاَ تُضَارَّ وَالِدَةٌ بِوَلَدِهَا وَلاَ مَوْلُودٌ لَّهُ بِوَلَدِهِ وَعَلَى الْوَارِثِ مِثْلُ ذَلِكَ فَإِنْ أَرَادَا فِصَالاً عَن تَرَاضٍ مِّنْهُمَا وَتَشَاوُرٍ فَلاَ جُنَاحَ عَلَيْهِمَا وَإِنْ أَرَدتُّمْ أَن تَسْتَرْضِعُواْ أَوْلادَكُمْ فَلاَ جُنَاحَ عَلَيْكُمْ إِذَا سَلَّمْتُم مَّا آتَيْتُم بِالْمَعْرُوفِ وَاتَّقُواْ اللَّهَ وَاعْلَمُواْ أَنَّ اللَّهَ بِمَا تَعْمَلُونَ بَصِيرٌ ٢٣٣"
                ]},
                {
                    "id": 94,
                    "question": "من أحكام المعتدة: عدة المتوفى عنها زوجها، وحكم خطبة المعتدة ",
                    "ayat":[ "وَالَّذِينَ يُتَوَفَّوْنَ مِنكُمْ وَيَذَرُونَ أَزْوَاجًا يَتَرَبَّصْنَ بِأَنفُسِهِنَّ أَرْبَعَةَ أَشْهُرٍ وَعَشْرًا فَإِذَا بَلَغْنَ أَجَلَهُنَّ فَلاَ جُنَاحَ عَلَيْكُمْ فِيمَا فَعَلْنَ فِي أَنفُسِهِنَّ بِالْمَعْرُوفِ وَاللَّهُ بِمَا تَعْمَلُونَ خَبِيرٌ ٢٣٤ وَلاَ جُنَاحَ عَلَيْكُمْ فِيمَا عَرَّضْتُم بِهِ مِنْ خِطْبَةِ النِّسَاء أَوْ أَكْنَنتُمْ فِي أَنفُسِكُمْ عَلِمَ اللَّهُ أَنَّكُمْ سَتَذْكُرُونَهُنَّ وَلَكِن لاَّ تُوَاعِدُوهُنَّ سِرًّا إِلاَّ أَن تَقُولُواْ قَوْلاً مَّعْرُوفًا وَلاَ تَعْزِمُواْ عُقْدَةَ النِّكَاحِ حَتَّىَ يَبْلُغَ الْكِتَابُ أَجَلَهُ وَاعْلَمُواْ أَنَّ اللَّهَ يَعْلَمُ مَا فِي أَنفُسِكُمْ فَاحْذَرُوهُ وَاعْلَمُواْ أَنَّ اللَّهَ غَفُورٌ حَلِيمٌ ٢٣٥"
                ]},
                {
                    "id": 95,
                    "question": "عودة لأحكام الطلاق: حكم المطلقة قبل المس: غير المسمى مهرها، والمسمى مهرها ",
                    "ayat":[ "لاَّ جُنَاحَ عَلَيْكُمْ إِن طَلَّقْتُمُ النِّسَاء مَا لَمْ تَمَسُّوهُنُّ أَوْ تَفْرِضُواْ لَهُنَّ فَرِيضَةً وَمَتِّعُوهُنَّ عَلَى الْمُوسِعِ قَدَرُهُ وَعَلَى الْمُقْتِرِ قَدَرُهُ مَتَاعًا بِالْمَعْرُوفِ حَقًّا عَلَى الْمُحْسِنِينَ ٢٣٦ وَإِن طَلَّقْتُمُوهُنَّ مِن قَبْلِ أَن تَمَسُّوهُنَّ وَقَدْ فَرَضْتُمْ لَهُنَّ فَرِيضَةً فَنِصْفُ مَا فَرَضْتُمْ إِلاَّ أَن يَعْفُونَ أَوْ يَعْفُوَ الَّذِي بِيَدِهِ عُقْدَةُ النِّكَاحِ وَأَن تَعْفُواْ أَقْرَبُ لِلتَّقْوَى وَلاَ تَنسَوُاْ الْفَضْلَ بَيْنَكُمْ إِنَّ اللَّهَ بِمَا تَعْمَلُونَ بَصِيرٌ ٢٣٧"
                ]},
                {
                    "id": 96,
                    "question": "الأمر بالمحافظة على الصلاة في كل الأحوال ",
                    "ayat":[ "حَافِظُواْ عَلَى الصَّلَوَاتِ وَالصَّلاةِ الْوُسْطَى وَقُومُواْ لِلَّهِ قَانِتِينَ ٢٣٨ فَإِنْ خِفْتُمْ فَرِجَالاً أَوْ رُكْبَانًا فَإِذَا أَمِنتُمْ فَاذْكُرُواْ اللَّهَ كَمَا عَلَّمَكُم مَّا لَمْ تَكُونُواْ تَعْلَمُونَ ٢٣٩"
                ]},
                {
                    "id": 97,
                    "question": "عودة لأحكام المعتدة: حق المعتدة بالوفاة في المكث في بيت الزوجية عاما ",
                    "ayat":[ "وَالَّذِينَ يُتَوَفَّوْنَ مِنكُمْ وَيَذَرُونَ أَزْوَاجًا وَصِيَّةً لِّأَزْوَاجِهِم مَّتَاعًا إِلَى الْحَوْلِ غَيْرَ إِخْرَاجٍ فَإِنْ خَرَجْنَ فَلاَ جُنَاحَ عَلَيْكُمْ فِي مَا فَعَلْنَ فِيَ أَنفُسِهِنَّ مِن مَّعْرُوفٍ وَاللَّهُ عَزِيزٌ حَكِيمٌ ٢٤٠"
                ]},
                {
                    "id": 98,
                    "question": "تأكيد حق المطلقات في المتاع، والامتنان ببيان الله للأحكام ",
                    "ayat":[ "وَلِلْمُطَلَّقَاتِ مَتَاعٌ بِالْمَعْرُوفِ حَقًّا عَلَى الْمُتَّقِينَ ٢٤١ كَذَلِكَ يُبَيِّنُ اللَّهُ لَكُمْ آيَاتِهِ لَعَلَّكُمْ تَعْقِلُونَ ٢٤٢"
                ]},
                {
                    "id": 99,
                    "question": "قصة الفارين من الموت ",
                    "ayat":[ "أَلَمْ تَرَ إِلَى الَّذِينَ خَرَجُواْ مِن دِيَارِهِمْ وَهُمْ أُلُوفٌ حَذَرَ الْمَوْتِ فَقَالَ لَهُمُ اللَّهُ مُوتُواْ ثُمَّ أَحْيَاهُمْ إِنَّ اللَّهَ لَذُو فَضْلٍ عَلَى النَّاسِ وَلَكِنَّ أَكْثَرَ النَّاسِ لاَ يَشْكُرُونَ ٢٤٣"
                ]},
                {
                    "id": 100,
                    "question": "الحث على القتال والإنفاق في سبيل الله ",
                    "ayat":[ "وَقَاتِلُواْ فِي سَبِيلِ اللَّهِ وَاعْلَمُواْ أَنَّ اللَّهَ سَمِيعٌ عَلِيمٌ ٢٤٤ مَّن ذَا الَّذِي يُقْرِضُ اللَّهَ قَرْضًا حَسَنًا فَيُضَاعِفَهُ لَهُ أَضْعَافًا كَثِيرَةً وَاللَّهُ يَقْبِضُ وَيَبْسُطُ وَإِلَيْهِ تُرْجَعُونَ ٢٤٥"
                ]},
                {
                    "id": 101,
                    "question": "قصة الملأ من بني إسرائيل مع طالوت \"طلب القتال، تعين طالوت ملكا، الاختبار ، القتال، النصر، وايتاء داوود الملك والنبوة\" ",
                    "ayat":[ "أَلَمْ تَرَ إِلَى الْمَلإِ مِن بَنِي إِسْرَائِيلَ مِن بَعْدِ مُوسَى إِذْ قَالُواْ لِنَبِيٍّ لَّهُمُ ابْعَثْ لَنَا مَلِكًا نُّقَاتِلْ فِي سَبِيلِ اللَّهِ قَالَ هَلْ عَسَيْتُمْ إِن كُتِبَ عَلَيْكُمُ الْقِتَالُ أَلاَّ تُقَاتِلُواْ قَالُواْ وَمَا لَنَا أَلاَّ نُقَاتِلَ فِي سَبِيلِ اللَّهِ وَقَدْ أُخْرِجْنَا مِن دِيَارِنَا وَأَبْنَائِنَا فَلَمَّا كُتِبَ عَلَيْهِمُ الْقِتَالُ تَوَلَّوْا إِلاَّ قَلِيلاً مِّنْهُمْ وَاللَّهُ عَلِيمٌ بِالظَّالِمِينَ ٢٤٦ وَقَالَ لَهُمْ نَبِيُّهُمْ إِنَّ اللَّهَ قَدْ بَعَثَ لَكُمْ طَالُوتَ مَلِكًا قَالُواْ أَنَّى يَكُونُ لَهُ الْمُلْكُ عَلَيْنَا وَنَحْنُ أَحَقُّ بِالْمُلْكِ مِنْهُ وَلَمْ يُؤْتَ سَعَةً مِّنَ الْمَالِ قَالَ إِنَّ اللَّهَ اصْطَفَاهُ عَلَيْكُمْ وَزَادَهُ بَسْطَةً فِي الْعِلْمِ وَالْجِسْمِ وَاللَّهُ يُؤْتِي مُلْكَهُ مَن يَشَاء وَاللَّهُ وَاسِعٌ عَلِيمٌ ٢٤٧ وَقَالَ لَهُمْ نَبِيُّهُمْ إِنَّ آيَةَ مُلْكِهِ أَن يَأْتِيَكُمُ التَّابُوتُ فِيهِ سَكِينَةٌ مِّن رَّبِّكُمْ وَبَقِيَّةٌ مِّمَّا تَرَكَ آلُ مُوسَى وَآلُ هَارُونَ تَحْمِلُهُ الْمَلائِكَةُ إِنَّ فِي ذَلِكَ لآيَةً لَّكُمْ إِن كُنتُم مُّؤْمِنِينَ ٢٤٨ فَلَمَّا فَصَلَ طَالُوتُ بِالْجُنُودِ قَالَ إِنَّ اللَّهَ مُبْتَلِيكُم بِنَهَرٍ فَمَن شَرِبَ مِنْهُ فَلَيْسَ مِنِّي وَمَن لَّمْ يَطْعَمْهُ فَإِنَّهُ مِنِّي إِلاَّ مَنِ اغْتَرَفَ غُرْفَةً بِيَدِهِ فَشَرِبُواْ مِنْهُ إِلاَّ قَلِيلاً مِّنْهُمْ فَلَمَّا جَاوَزَهُ هُوَ وَالَّذِينَ آمَنُواْ مَعَهُ قَالُواْ لاَ طَاقَةَ لَنَا الْيَوْمَ بِجَالُوتَ وَجُنُودِهِ قَالَ الَّذِينَ يَظُنُّونَ أَنَّهُم مُّلاقُوا اللَّهِ كَم مِّن فِئَةٍ قَلِيلَةٍ غَلَبَتْ فِئَةً كَثِيرَةً بِإِذْنِ اللَّهِ وَاللَّهُ مَعَ الصَّابِرِينَ ٢٤٩ وَلَمَّا بَرَزُواْ لِجَالُوتَ وَجُنُودِهِ قَالُواْ رَبَّنَا أَفْرِغْ عَلَيْنَا صَبْرًا وَثَبِّتْ أَقْدَامَنَا وَانصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ ٢٥٠ فَهَزَمُوهُم بِإِذْنِ اللَّهِ وَقَتَلَ دَاوُدُ جَالُوتَ وَآتَاهُ اللَّهُ الْمُلْكَ وَالْحِكْمَةَ وَعَلَّمَهُ مِمَّا يَشَاء وَلَوْلاَ دَفْعُ اللَّهِ النَّاسَ بَعْضَهُمْ بِبَعْضٍ لَّفَسَدَتِ الأَرْضُ وَلَكِنَّ اللَّهَ ذُو فَضْلٍ عَلَى الْعَالَمِينَ ٢٥١"
                ]},
                {
                    "id": 102,
                    "question": "تعقيب: تسلية؛ الآيات حق، والرسول حق، وتفاضل الرسل، وحكمة الله في الاختلاف والاقتتال بين الأمم ",
                    "ayat":[ "تِلْكَ آيَاتُ اللَّهِ نَتْلُوهَا عَلَيْكَ بِالْحَقِّ وَإِنَّكَ لَمِنَ الْمُرْسَلِينَ ٢٥٢ تِلْكَ الرُّسُلُ فَضَّلْنَا بَعْضَهُمْ عَلَى بَعْضٍ مِّنْهُم مَّن كَلَّمَ اللَّهُ وَرَفَعَ بَعْضَهُمْ دَرَجَاتٍ وَآتَيْنَا عِيسَى ابْنَ مَرْيَمَ الْبَيِّنَاتِ وَأَيَّدْنَاهُ بِرُوحِ الْقُدُسِ وَلَوْ شَاء اللَّهُ مَا اقْتَتَلَ الَّذِينَ مِن بَعْدِهِم مِّن بَعْدِ مَا جَاءَتْهُمُ الْبَيِّنَاتُ وَلَكِنِ اخْتَلَفُواْ فَمِنْهُم مَّنْ آمَنَ وَمِنْهُم مَّن كَفَرَ وَلَوْ شَاء اللَّهُ مَا اقْتَتَلُواْ وَلَكِنَّ اللَّهَ يَفْعَلُ مَا يُرِيدُ ٢٥٣"
                ]},
                {
                    "id": 103,
                    "question": "حث المؤمنين على الاستعداد ليوم القيامة بالإنفاق ",
                    "ayat":[ "يَا أَيُّهَا الَّذِينَ آمَنُواْ أَنفِقُواْ مِمَّا رَزَقْنَاكُم مِّن قَبْلِ أَن يَأْتِيَ يَوْمٌ لاَّ بَيْعٌ فِيهِ وَلاَ خُلَّةٌ وَلاَ شَفَاعَةٌ وَالْكَافِرُونَ هُمُ الظَّالِمُونَ ٢٥٤"
                ]},
                {
                    "id": 104,
                    "question": "وحدانية الله وقدرته \"آية الكرسي\" ",
                    "ayat":[ "اللَّهُ لاَ إِلَهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِندَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ ٢٥٥"
                ]},
                {
                    "id": 105,
                    "question": "منع الإكراه في الدين، وثمرة ولاية الله وولاية الطاغوت ",
                    "ayat":[ "لاَ إِكْرَاهَ فِي الدِّينِ قَد تَّبَيَّنَ الرُّشْدُ مِنَ الْغَيِّ فَمَنْ يَكْفُرْ بِالطَّاغُوتِ وَيُؤْمِن بِاللَّهِ فَقَدِ اسْتَمْسَكَ بِالْعُرْوَةِ الْوُثْقَىَ لاَ انفِصَامَ لَهَا وَاللَّهُ سَمِيعٌ عَلِيمٌ ٢٥٦ اللَّهُ وَلِيُّ الَّذِينَ آمَنُواْ يُخْرِجُهُم مِّنَ الظُّلُمَاتِ إِلَى النُّورِ وَالَّذِينَ كَفَرُواْ أَوْلِيَاؤُهُمُ الطَّاغُوتُ يُخْرِجُونَهُم مِّنَ النُّورِ إِلَى الظُّلُمَاتِ أُوْلَئِكَ أَصْحَابُ النَّارِ هُمْ فِيهَا خَالِدُونَ ٢٥٧"
                ]},
                {
                    "id": 106,
                    "question": "المحاجة بين إبراهيم عليه السلام والنمرود في الوحدانية ",
                    "ayat":[ "أَلَمْ تَرَ إِلَى الَّذِي حَاجَّ إِبْرَاهِيمَ فِي رَبِّهِ أَنْ آتَاهُ اللَّهُ الْمُلْكَ إِذْ قَالَ إِبْرَاهِيمُ رَبِّيَ الَّذِي يُحْيِي وَيُمِيتُ قَالَ أَنَا أُحْيِي وَأُمِيتُ قَالَ إِبْرَاهِيمُ فَإِنَّ اللَّهَ يَأْتِي بِالشَّمْسِ مِنَ الْمَشْرِقِ فَأْتِ بِهَا مِنَ الْمَغْرِبِ فَبُهِتَ الَّذِي كَفَرَ وَاللَّهُ لاَ يَهْدِي الْقَوْمَ الظَّالِمِينَ ٢٥٨"
                ]},
                {
                    "id": 107,
                    "question": " إثبات البعث من خلال قصتين \"قصة بعث الرجل بعد مائة عام، إبراهيم عليه السلام والطير\"",
                    "ayat":[ "أَوْ كَالَّذِي مَرَّ عَلَى قَرْيَةٍ وَهِيَ خَاوِيَةٌ عَلَى عُرُوشِهَا قَالَ أَنَّىَ يُحْيِي هَذِهِ اللَّهُ بَعْدَ مَوْتِهَا فَأَمَاتَهُ اللَّهُ مِائَةَ عَامٍ ثُمَّ بَعَثَهُ قَالَ كَمْ لَبِثْتَ قَالَ لَبِثْتُ يَوْمًا أَوْ بَعْضَ يَوْمٍ قَالَ بَل لَّبِثْتَ مِائَةَ عَامٍ فَانظُرْ إِلَى طَعَامِكَ وَشَرَابِكَ لَمْ يَتَسَنَّهْ وَانظُرْ إِلَى حِمَارِكَ وَلِنَجْعَلَكَ آيَةً لِّلنَّاسِ وَانظُرْ إِلَى الْعِظَامِ كَيْفَ نُنشِزُهَا ثُمَّ نَكْسُوهَا لَحْمًا فَلَمَّا تَبَيَّنَ لَهُ قَالَ أَعْلَمُ أَنَّ اللَّهَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ ٢٥٩ وَإِذْ قَالَ إِبْرَاهِيمُ رَبِّ أَرِنِي كَيْفَ تُحْيِي الْمَوْتَى قَالَ أَوَلَمْ تُؤْمِن قَالَ بَلَى وَلَكِن لِّيَطْمَئِنَّ قَلْبِي قَالَ فَخُذْ أَرْبَعَةً مِّنَ الطَّيْرِ فَصُرْهُنَّ إِلَيْكَ ثُمَّ اجْعَلْ عَلَى كُلِّ جَبَلٍ مِّنْهُنَّ جُزْءًا ثُمَّ ادْعُهُنَّ يَأْتِينَكَ سَعْيًا وَاعْلَمْ أَنَّ اللَّهَ عَزِيزٌ حَكِيمٌ ٢٦٠"
                ]},
                {
                    "id": 108,
                    "question": "ضرب مثل للنفقة في سبيل الله، وبيان ثواب المنفق ",
                    "ayat":[ "مَّثَلُ الَّذِينَ يُنفِقُونَ أَمْوَالَهُمْ فِي سَبِيلِ اللَّهِ كَمَثَلِ حَبَّةٍ أَنبَتَتْ سَبْعَ سَنَابِلَ فِي كُلِّ سُنبُلَةٍ مِّائَةُ حَبَّةٍ وَاللَّهُ يُضَاعِفُ لِمَن يَشَاء وَاللَّهُ وَاسِعٌ عَلِيمٌ ٢٦١ الَّذِينَ يُنفِقُونَ أَمْوَالَهُمْ فِي سَبِيلِ اللَّهِ ثُمَّ لاَ يُتْبِعُونَ مَا أَنفَقُواُ مَنًّا وَلاَ أَذًى لَّهُمْ أَجْرُهُمْ عِندَ رَبِّهِمْ وَلاَ خَوْفٌ عَلَيْهِمْ وَلاَ هُمْ يَحْزَنُونَ ٢٦٢"
                ]},
                {
                    "id": 109,
                    "question": "الرد الجميل للسائل والعفو عنه، وتحذير المؤمنين من المن والأذى، وضرب مثل للمرائي والمخلص في الصدقة ",
                    "ayat":[ "قَوْلٌ مَّعْرُوفٌ وَمَغْفِرَةٌ خَيْرٌ مِّن صَدَقَةٍ يَتْبَعُهَا أَذًى وَاللَّهُ غَنِيٌّ حَلِيمٌ ٢٦٣ يَا أَيُّهَا الَّذِينَ آمَنُواْ لاَ تُبْطِلُواْ صَدَقَاتِكُم بِالْمَنِّ وَالأَذَى كَالَّذِي يُنفِقُ مَالَهُ رِئَاء النَّاسِ وَلاَ يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخِرِ فَمَثَلُهُ كَمَثَلِ صَفْوَانٍ عَلَيْهِ تُرَابٌ فَأَصَابَهُ وَابِلٌ فَتَرَكَهُ صَلْدًا لاَّ يَقْدِرُونَ عَلَى شَيْءٍ مِّمَّا كَسَبُواْ وَاللَّهُ لاَ يَهْدِي الْقَوْمَ الْكَافِرِينَ ٢٦٤ وَمَثَلُ الَّذِينَ يُنفِقُونَ أَمْوَالَهُمُ ابْتِغَاء مَرْضَاتِ اللَّهِ وَتَثْبِيتًا مِّنْ أَنفُسِهِمْ كَمَثَلِ جَنَّةٍ بِرَبْوَةٍ أَصَابَهَا وَابِلٌ فَآتَتْ أُكُلَهَا ضِعْفَيْنِ فَإِن لَّمْ يُصِبْهَا وَابِلٌ فَطَلٌّ وَاللَّهُ بِمَا تَعْمَلُونَ بَصِيرٌ ٢٦٥"
                ]},
                {
                    "id": 110,
                    "question": "صورة حية تبين إبطال الرياء والمن للأعمال يوم القيامة ",
                    "ayat":[ "أَيَوَدُّ أَحَدُكُمْ أَن تَكُونَ لَهُ جَنَّةٌ مِّن نَّخِيلٍ وَأَعْنَابٍ تَجْرِي مِن تَحْتِهَا الأَنْهَارُ لَهُ فِيهَا مِن كُلِّ الثَّمَرَاتِ وَأَصَابَهُ الْكِبَرُ وَلَهُ ذُرِّيَّةٌ ضُعَفَاء فَأَصَابَهَا إِعْصَارٌ فِيهِ نَارٌ فَاحْتَرَقَتْ كَذَلِكَ يُبَيِّنُ اللَّهُ لَكُمُ الآيَاتِ لَعَلَّكُمْ تَتَفَكَّرُونَ ٢٦٦"
                ]},
                {
                    "id": 111,
                    "question": "الحث على الإنفاق من الطيب لا من الخبيث، التحدثر من وعود الشيطان، وفضل الله على عباده ",
                    "ayat":[ "يَا أَيُّهَا الَّذِينَ آمَنُواْ أَنفِقُواْ مِن طَيِّبَاتِ مَا كَسَبْتُمْ وَمِمَّا أَخْرَجْنَا لَكُم مِّنَ الأَرْضِ وَلاَ تَيَمَّمُواْ الْخَبِيثَ مِنْهُ تُنفِقُونَ وَلَسْتُم بِآخِذِيهِ إِلاَّ أَن تُغْمِضُواْ فِيهِ وَاعْلَمُواْ أَنَّ اللَّهَ غَنِيٌّ حَمِيدٌ ٢٦٧ الشَّيْطَانُ يَعِدُكُمُ الْفَقْرَ وَيَأْمُرُكُم بِالْفَحْشَاء وَاللَّهُ يَعِدُكُم مَّغْفِرَةً مِّنْهُ وَفَضْلاً وَاللَّهُ وَاسِعٌ عَلِيمٌ ٢٦٨ يُؤْتِي الْحِكْمَةَ مَن يَشَاء وَمَن يُؤْتَ الْحِكْمَةَ فَقَدْ أُوتِيَ خَيْرًا كَثِيرًا وَمَا يَذَّكَّرُ إِلاَّ أُوْلُواْ الأَلْبَابِ ٢٦٩"
                ]},
                {
                    "id": 112,
                    "question": "علم الله بالنفقات، والمفاضلة بين صدقة السر والعلن  ",
                    "ayat":[ "وَمَا أَنفَقْتُم مِّن نَّفَقَةٍ أَوْ نَذَرْتُم مِّن نَّذْرٍ فَإِنَّ اللَّهَ يَعْلَمُهُ وَمَا لِلظَّالِمِينَ مِنْ أَنصَارٍ ٢٧٠ إِن تُبْدُواْ الصَّدَقَاتِ فَنِعِمَّا هِيَ وَإِن تُخْفُوهَا وَتُؤْتُوهَا الْفُقَرَاء فَهُوَ خَيْرٌ لَّكُمْ وَيُكَفِّرُ عَنكُم مِّن سَيِّئَاتِكُمْ وَاللَّهُ بِمَا تَعْمَلُونَ خَبِيرٌ ٢٧١"
                ]},
                {
                    "id": 113,
                    "question": "تسلية، والترغيب في الصدقة لوجه الله وتأكيد المثوبة عليها ",
                    "ayat":[ "لَّيْسَ عَلَيْكَ هُدَاهُمْ وَلَكِنَّ اللَّهَ يَهْدِي مَن يَشَاء وَمَا تُنفِقُواْ مِنْ خَيْرٍ فَلأنفُسِكُمْ وَمَا تُنفِقُونَ إِلاَّ ابْتِغَاء وَجْهِ اللَّهِ وَمَا تُنفِقُواْ مِنْ خَيْرٍ يُوَفَّ إِلَيْكُمْ وَأَنتُمْ لاَ تُظْلَمُونَ ٢٧٢"
                ]},
                {
                    "id": 114,
                    "question": "أوصاف مستحقي الصدقة  ",
                    "ayat":[ "لِلْفُقَرَاء الَّذِينَ أُحْصِرُواْ فِي سَبِيلِ اللَّهِ لاَ يَسْتَطِيعُونَ ضَرْبًا فِي الأَرْضِ يَحْسَبُهُمُ الْجَاهِلُ أَغْنِيَاء مِنَ التَّعَفُّفِ تَعْرِفُهُم بِسِيمَاهُمْ لاَ يَسْأَلُونَ النَّاسَ إِلْحَافًا وَمَا تُنفِقُواْ مِنْ خَيْرٍ فَإِنَّ اللَّهَ بِهِ عَلِيمٌ ٢٧٣"
                ]},
                {
                    "id": 115,
                    "question": "جزاء صدقة السر والعلن ",
                    "ayat":[ "الَّذِينَ يُنفِقُونَ أَمْوَالَهُم بِاللَّيْلِ وَالنَّهَارِ سِرًّا وَعَلانِيَةً فَلَهُمْ أَجْرُهُمْ عِندَ رَبِّهِمْ وَلاَ خَوْفٌ عَلَيْهِمْ وَلاَ هُمْ يَحْزَنُونَ ٢٧٤"
                ]},
                {
                    "id": 116,
                    "question": "صورة قيام المرابين من قبورهم، وبيان حل البيع وتحريم الربا، وجزاء المرابين، وبركة الصدقات، وثواب المؤمنين ",
                    "ayat":[ "الَّذِينَ يَأْكُلُونَ الرِّبَا لاَ يَقُومُونَ إِلاَّ كَمَا يَقُومُ الَّذِي يَتَخَبَّطُهُ الشَّيْطَانُ مِنَ الْمَسِّ ذَلِكَ بِأَنَّهُمْ قَالُواْ إِنَّمَا الْبَيْعُ مِثْلُ الرِّبَا وَأَحَلَّ اللَّهُ الْبَيْعَ وَحَرَّمَ الرِّبَا فَمَن جَاءَهُ مَوْعِظَةٌ مِّن رَّبِّهِ فَانتَهَىَ فَلَهُ مَا سَلَفَ وَأَمْرُهُ إِلَى اللَّهِ وَمَنْ عَادَ فَأُولَئِكَ أَصْحَابُ النَّارِ هُمْ فِيهَا خَالِدُونَ ٢٧٥ يَمْحَقُ اللَّهُ الرِّبَا وَيُرْبِي الصَّدَقَاتِ وَاللَّهُ لاَ يُحِبُّ كُلَّ كَفَّارٍ أَثِيمٍ ٢٧٦ إِنَّ الَّذِينَ آمَنُواْ وَعَمِلُواْ الصَّالِحَاتِ وَأَقَامُواْ الصَّلاةَ وَآتَوُاْ الزَّكَاةَ لَهُمْ أَجْرُهُمْ عِندَ رَبِّهِمْ وَلاَ خَوْفٌ عَلَيْهِمْ وَلاَ هُمْ يَحْزَنُونَ ٢٧٧"
                ]},
                {
                    "id": 117,
                    "question": "الحث على ترك الربا والتهديد بحرب الله، والحث على أنظار المعسر أو التصدق عليه، والتذكير بيوم القيامة ",
                    "ayat":[ "يَا أَيُّهَا الَّذِينَ آمَنُواْ اتَّقُواْ اللَّهَ وَذَرُواْ مَا بَقِيَ مِنَ الرِّبَا إِن كُنتُم مُّؤْمِنِينَ ٢٧٨ فَإِن لَّمْ تَفْعَلُواْ فَأْذَنُواْ بِحَرْبٍ مِّنَ اللَّهِ وَرَسُولِهِ وَإِن تُبْتُمْ فَلَكُمْ رُؤُوسُ أَمْوَالِكُمْ لاَ تَظْلِمُونَ وَلاَ تُظْلَمُونَ ٢٧٩ وَإِن كَانَ ذُو عُسْرَةٍ فَنَظِرَةٌ إِلَى مَيْسَرَةٍ وَأَن تَصَدَّقُواْ خَيْرٌ لَّكُمْ إِن كُنتُمْ تَعْلَمُونَ ٢٨٠ وَاتَّقُواْ يَوْمًا تُرْجَعُونَ فِيهِ إِلَى اللَّهِ ثُمَّ تُوَفَّى كُلُّ نَفْسٍ مَّا كَسَبَتْ وَهُمْ لاَ يُظْلَمُونَ ٢٨١"
                ]},
                {
                    "id": 118,
                    "question": "أحكام الدين والرهن، والتعقيب بملك الله ومحاسبته للعباد   ",
                    "ayat":[ "يَا أَيُّهَا الَّذِينَ آمَنُواْ إِذَا تَدَايَنتُم بِدَيْنٍ إِلَى أَجَلٍ مُّسَمًّى فَاكْتُبُوهُ وَلْيَكْتُب بَّيْنَكُمْ كَاتِبٌ بِالْعَدْلِ وَلاَ يَأْبَ كَاتِبٌ أَنْ يَكْتُبَ كَمَا عَلَّمَهُ اللَّهُ فَلْيَكْتُبْ وَلْيُمْلِلِ الَّذِي عَلَيْهِ الْحَقُّ وَلْيَتَّقِ اللَّهَ رَبَّهُ وَلاَ يَبْخَسْ مِنْهُ شَيْئًا فَإِن كَانَ الَّذِي عَلَيْهِ الْحَقُّ سَفِيهًا أَوْ ضَعِيفًا أَوْ لاَ يَسْتَطِيعُ أَن يُمِلَّ هُوَ فَلْيُمْلِلْ وَلِيُّهُ بِالْعَدْلِ وَاسْتَشْهِدُواْ شَهِيدَيْنِ مِن رِّجَالِكُمْ فَإِن لَّمْ يَكُونَا رَجُلَيْنِ فَرَجُلٌ وَامْرَأَتَانِ مِمَّن تَرْضَوْنَ مِنَ الشُّهَدَاء أَن تَضِلَّ إِحْدَاهُمَا فَتُذَكِّرَ إِحْدَاهُمَا الأُخْرَى وَلاَ يَأْبَ الشُّهَدَاء إِذَا مَا دُعُواْ وَلاَ تَسْأَمُوْا أَن تَكْتُبُوهُ صَغِيرًا أَو كَبِيرًا إِلَى أَجَلِهِ ذَلِكُمْ أَقْسَطُ عِندَ اللَّهِ وَأَقْوَمُ لِلشَّهَادَةِ وَأَدْنَى أَلاَّ تَرْتَابُواْ إِلاَّ أَن تَكُونَ تِجَارَةً حَاضِرَةً تُدِيرُونَهَا بَيْنَكُمْ فَلَيْسَ عَلَيْكُمْ جُنَاحٌ أَلاَّ تَكْتُبُوهَا وَأَشْهِدُواْ إِذَا تَبَايَعْتُمْ وَلاَ يُضَارَّ كَاتِبٌ وَلاَ شَهِيدٌ وَإِن تَفْعَلُواْ فَإِنَّهُ فُسُوقٌ بِكُمْ وَاتَّقُواْ اللَّهَ وَيُعَلِّمُكُمُ اللَّهُ وَاللَّهُ بِكُلِّ شَيْءٍ عَلِيمٌ ٢٨٢ وَإِن كُنتُمْ عَلَى سَفَرٍ وَلَمْ تَجِدُواْ كَاتِبًا فَرِهَانٌ مَّقْبُوضَةٌ فَإِنْ أَمِنَ بَعْضُكُم بَعْضًا فَلْيُؤَدِّ الَّذِي اؤْتُمِنَ أَمَانَتَهُ وَلْيَتَّقِ اللَّهَ رَبَّهُ وَلاَ تَكْتُمُواْ الشَّهَادَةَ وَمَن يَكْتُمْهَا فَإِنَّهُ آثِمٌ قَلْبُهُ وَاللَّهُ بِمَا تَعْمَلُونَ عَلِيمٌ ٢٨٣ لِّلَّهِ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ وَإِن تُبْدُواْ مَا فِي أَنفُسِكُمْ أَوْ تُخْفُوهُ يُحَاسِبْكُم بِهِ اللَّهُ فَيَغْفِرُ لِمَن يَشَاء وَيُعَذِّبُ مَن يَشَاء وَاللَّهُ عَلَى كُلِّ شَيْءٍ قَدِيرٌ ٢٨٤"
                ]},
                {
                    "id": 119,
                    "question": "الخاتمة: الإيمان والسمع والطاعة ودعاء المؤمنين ",
                    "ayat":[ "آمَنَ الرَّسُولُ بِمَا أُنزِلَ إِلَيْهِ مِن رَّبِّهِ وَالْمُؤْمِنُونَ كُلٌّ آمَنَ بِاللَّهِ وَمَلائِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ لاَ نُفَرِّقُ بَيْنَ أَحَدٍ مِّن رُّسُلِهِ وَقَالُواْ سَمِعْنَا وَأَطَعْنَا غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ الْمَصِيرُ ٢٨٥ لاَ يُكَلِّفُ اللَّهُ نَفْسًا إِلاَّ وُسْعَهَا لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ رَبَّنَا لاَ تُؤَاخِذْنَا إِن نَّسِينَا أَوْ أَخْطَأْنَا رَبَّنَا وَلاَ تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِن قَبْلِنَا رَبَّنَا وَلاَ تُحَمِّلْنَا مَا لاَ طَاقَةَ لَنَا بِهِ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا أَنتَ مَوْلانَا فَانصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ ٢٨٦"
                    ]
                }
            ]
        },
        {
            "sura":"آل عمران",
            "questions": [
                {
                    "id": 1,
                    "question": "ثبات عقدي: إثبات الوحدانية، والرسالة، وإنزال الكتب وتوعد الكفار، بيان سعة علم الله تعالى، وتصويره الخلق في الأرحام، وإنزاله الآيات محكمات ومتشابهات وبيان موقف الناس منها ",
                    "ayat":[ " ٩-١"
                ]},
                {
                    "id": 2,
                    "question": "ثبات حربي: إنذار الكفار المغرورين بالمال والولد بمثل ما حل الأمم السابقة، وتوعدهم، وتذكيرهم بهزيمة بدر، وتزهيد المؤمنين بزينة الدنيا، وتشويقهم لنعم الآخرة، وأوصاف مستحقيه ",
                    "ayat":[ "١٧-١٠"
                ]},
                {
                    "id": 3,
                    "question": "الشهادة بالوحدانية، وهيمنة دين الإسلام، وبيان سبب اختلاف أهل الكتاب ",
                    "ayat":[ "١٩-١٨"
                ]},
                {
                    "id": 4,
                    "question": "سبب اختلاف أهل الكتاب، وتثبيت النبي ﷺ في محاجة أهل الكتاب ",
                    "ayat":[ "٢٠"
                ]},
                {
                    "id": 5,
                    "question": " كفرهم وقتلهم الأنبياء والآمرين بالقسط وتبشيرهم بالعذاب وحبوط الأعمال ",
                    "ayat":[ "٢٢-٢١"
                ]},
                {
                    "id": 6,
                    "question": "إعراضهم عن تحكيم كتاب الله ",
                    "ayat":[ "٢٣"
                ]},
                {
                    "id": 7,
                    "question": "زعمهم أن النار لا تمسهم إلا أياما معدودات وغفلتهم عن يوم الجمع والجزاء ",
                    "ayat":[ "٢٥-٢٤"
                ]},
                {
                    "id": 8,
                    "question": "تلقين دعوات مبشرات بغزة الإسلام وأهله والثناء على الله بقدرته ",
                    "ayat":[ "٢٧-٢٦"
                ]},
                {
                    "id": 9,
                    "question": " النهي عن موالاة الكفار، والتنبيه على علم الله بالخفايا، والتذكير بندامة يوم الحساب ",
                    "ayat":[ "٣٠-٢٨"
                ]},
                {
                    "id": 10,
                    "question": "برهان محبة الله، والأمر بطاعة الله ورسوله ",
                    "ayat":[ "٣٢-٣١"
                ]},
                {
                    "id": 11,
                    "question": "اصطفاء الرسل وذرياتهم وعرض قصص اصطفاء آل عمران ",
                    "ayat":[ "٣٤-٣٣"
                ]},
                {
                    "id": 12,
                    "question": "نذر إمرأة عمران، وولادة مريم، وكفالة زكريا لها، ودعاؤه، والبشارة بيحيى، وعلامة ذلك ",
                    "ayat":[ "٤١-٣٥"
                ]},
                {
                    "id": 13,
                    "question": "اصطفاء مريم وأمرها بالمداومة على العبادة، وتعقيب بصدق الوحي للرسول ﷺ بذكر تنافس الأحبار على كفالة مريم ",
                    "ayat":[ "٤٤-٤٢"
                ]},
                {
                    "id": 14,
                    "question": "بشارة مريم بعيسى عليه السلام وذكر أوصافه، ومعجزاته، ومضمون رسالته ",
                    "ayat":[ "٥١-٤٥"
                ]},
                {
                    "id": 15,
                    "question": "موقف عيسى عليه السلام من كفر بني إسرائيل، وموقف الحواريين ودعاؤهم، وظهور النصارى ",
                    "ayat":[ "٥٣-٥٢"
                ]},
                {
                    "id": 16,
                    "question": "مكر ومكر: رفع عيسى عليه السلام إلى السماء، وحكمة تعالى فيمن كفر به، ومن آمن",
                    "ayat":[ "٥٧-٥٤"
                ]},
                {
                    "id": 17,
                    "question": "صدق الوحي فيما أخبر به من قصص وغيره ",
                    "ayat":[ "٥٨"
                ]},
                {
                    "id": 18,
                    "question": "إبطال عقيدة النصارى عقلا، بتمثيل خلق عيسى بخلق آدم عليهما السلام ",
                    "ayat":[ "٥٩"
                ]},
                {
                    "id": 19,
                    "question": "تثبيت النبي  ﷺ على الحق، ومباهلة وفد نصارى نجران، وتأكيد الحقائق وتوعد المتولين ",
                    "ayat":[ "٦٣-٦٠"
                ]},
                {
                    "id": 20,
                    "question": "دعوة أهل الكتاب إلى كلمة التوحيد ",
                    "ayat":[ "٦٤"
                ]},
                {
                    "id": 21,
                    "question": "عتاب أهل الكتاب على محاجتهم في إبراهيم عليه السلام، وبيان ملته، وأولى الناس به، وتحذير المؤمنين من إضلال أهل الكتاب لهم ",
                    "ayat":[ "٦٩-٦٥"
                ]},
                {
                    "id": 22,
                    "question": "عتاب أهل الكتاب على كفرهم وتلبيسهم الحق بالباطل ",
                    "ayat":[ "٧١-٧٠"
                ]},
                {
                    "id": 23,
                    "question": "تحريض أهل الكتاب للناس على النفاق، وتلقين الرد عليهم ببيان مصدر الهدى والفضل والرحمة ",
                    "ayat":[ "٧٤-٧٢"
                ]},
                {
                    "id": 24,
                    "question": "خيانة بعض أهل الكتاب للمسلمين، وبيان سببه والثناء على الموفون بالعهد وتوعد الخائنين ",
                    "ayat":[ "٧٧-٧٥"
                ]},
                {
                    "id": 25,
                    "question": "تحريف أهل الكتاب لكتابهم، وكذبهم على الله ",
                    "ayat":[ "٧٨"
                ]},
                {
                    "id": 26,
                    "question": "تبرئة عيسى عليه السلام من ادعاء الألوهية، أو الأمر بعبادة الملائكة أو النبيين، وميثاق الأنبياء، وتهديد المتولين، وتوبيخ المعرضين عن دين الله ",
                    "ayat":[ "٨٣-٧٩"
                ]},
                {
                    "id": 27,
                    "question": "أمر الرسول ﷺ بإعلان إيمانه بجميع الرسل، وتقرير أن دين الإسلام هو المقبول فقط ",
                    "ayat":[ "٨٥-٨٤"
                ]},
                {
                    "id": 28,
                    "question": "لا هداية لمن ترك دين الإسلام، وجزاؤهم، واستثناء التائبين المصلحين من ذلك ",
                    "ayat":[ "٨٩-٨٦"
                ]},
                {
                    "id": 29,
                    "question": "استحالة قبول التوبة والفداء ممن مات على الكفر ",
                    "ayat":[ "٩١-٩٠"
                ]},
                {
                    "id": 30,
                    "question": "حث المؤمنين على نفقة البر ",
                    "ayat":[ "٩٢"
                ]},
                {
                    "id": 31,
                    "question": "الرد على زعم بطلان النسخ بقضية تحريم يعقوب عليه السلام بعض الأطعمة على نفسه، وتهديد الكاذبين، وبيان صدق الله، والأمر باتباع ملة إبراهيم عليه السلام ",
                    "ayat":[ "٩٥-٩٣"
                ]},
                {
                    "id": 32,
                    "question": "الرد على شبهة تحويل القبلة ببيان منزلة البيت، وفرضية الحج ",
                    "ayat":[ "٩٧-٩٦"
                ]},
                {
                    "id": 33,
                    "question": "تلقين المؤمنين اللوم لأهل الكتاب على كفرهم وصدهم عن سبيل الله ",
                    "ayat":[ "٩٩-٩٨"
                ]},
                {
                    "id": 34,
                    "question": "التحذير من طاعة بعض أهل الكتاب المؤدية للردة، واستبعاد وقوع ذلك من المؤمنين ",
                    "ayat":[ "١٠١-١٠٠"
                ]},
                {
                    "id": 35,
                    "question": "أمر المؤمنين بتقوى الله والاعتصام بحبله، وتذكر نعمته تعالى في تألفهم، والحث على المداومة على الأمر بالمعروف والنهي عن المنكر ",
                    "ayat":[ "١٠٤-١٠٢"
                ]},
                {
                    "id": 36,
                    "question": "التحذير من مشابهة المتفرقين المختلفين والتذكير بيوم القيامة حين التمايز ببياض الوجوه واسودادها ",
                    "ayat":[ "١٠٧-١٠٥"
                ]},
                {
                    "id": 37,
                    "question": "تأكيد صدق الوحي، وتمام عدل الله، وملكه، وتقرير المرجع إليه ",
                    "ayat":[ "١٠٩-١٠٨"
                ]},
                {
                    "id": 38,
                    "question": "خيرية الأمة المحمدية وأسباب ذلك والنعي على أهل الكتاب لتركهم الإيمان، وبيان ضعفهم وجبنهم وذلهم وغضب الله عليهم وأسباب ذلك واستثناء الصالحين منهم",
                    "ayat":[ "١١٥-١١٠"
                ]},
                {
                    "id": 39,
                    "question": "تأكيد عاقبة الكفار المغرورين بالمال والولد وضرب مثل لنفقتهم ",
                    "ayat":[ "١١٧-١١٦"
                ]},
                {
                    "id": 40,
                    "question": "تحذير المؤمنين من موالاة أعدائهم، وبيان أسباب ذلك ",
                    "ayat":[ "١٢٠-١١٨"
                ]},
                {
                    "id": 41,
                    "question": "عسكريا: تنظيم الرسول ﷺ للجيش، وذكر هم طائفتين بالرجوع مع المنافقين ",
                    "ayat":[ "١٢٢-١٢١"
                ]},
                {
                    "id": 42,
                    "question": "نفسيا: تبديد مخاوف المؤمنين بالتذكير بنصر بدر وما كان فيه من الوعد بالإمداد، وبيان حكمته، ومشيئة الله النافذة في العذاب والمغفرة ",
                    "ayat":[ "١٢٩-١٢٣"
                ]},
                {
                    "id": 43,
                    "question": "إيمانيا: الأخذ بأسباب النصر: ترك الربا، والتقوى، والطاعة، والمسارعة إلى المغفرة والجنة، واستطراد لذكر صفات أربابها، وجزاء العاملين ",
                    "ayat":[ "١٣٦-١٣٠"
                ]},
                {
                    "id": 44,
                    "question": "تسلية ١: دعوتهم للاتعاظ بسنن الله في المكذبين، وبيانه وهدايته للمتقين ",
                    "ayat":[ "١٣٨-١٣٧"
                ]},
                {
                    "id": 45,
                    "question": "تسلية ٢: نهيهم عن الوهن والحزن وتقرير علوهم، وتعزيتهم عما أصابهم من جراح وقتل وبيان حكمته ",
                    "ayat":[ "١٤٢-١٣٩"
                ]},
                {
                    "id": 46,
                    "question": "عتاب ١: عتابهم على موقفهم من القتال بعد تمنيه ",
                    "ayat":[ "١٤٣"
                ]},
                {
                    "id": 47,
                    "question": "عتاب ٢: عتابهم على موقفهم من إشاعة قتل النبي ﷺ ",
                    "ayat":[ "١٤٤"
                ]},
                {
                    "id": 48,
                    "question": "عتاب ٣: عتابهم على خوفهم من الموت؛ بالتذكير بأن الآجال بيد الله وحده، والترغيب في ثواب الآخرة دون الدنيا، والتذكير بموقف أتباع الأنبياء في القتال من الصبر والدعاء وما أتاهم عليه من جزاء ",
                    "ayat":[ "١٤٨-١٤٥"
                ]},
                {
                    "id": 49,
                    "question": "تذكير ١: تذكيرهم بخطورة طاعة الكفار، والوعد بولاية الله ونصره بإلقاء الرعب في قلوب المشركين ",
                    "ayat":[ "١٥١-١٤٩"
                ]},
                {
                    "id": 50,
                    "question": "تذكير ٢: تذكيرهم بنصر الله لهم ثم تنازعهم وعصيانهم بعده والامتنان بإبتلائهم وعفو الله عنهم وفضله عليهم ",
                    "ayat":[ "١٥٢"
                ]},
                {
                    "id": 51,
                    "question": "تذكير ٣: تذكيرهم بدعوة الرسول ﷺ  لهم أثناء المعركة، والامتنان بغمٍ يعقبه آمان للمؤمنين، وسوء ظن من الكافرين تنجلي بعده ",
                    "ayat":[ "١٥٤-١٥٣"
                ]},
                {
                    "id": 52,
                    "question": "تقرير سبب الهزيمة الخفي، وهي استزلال الشيطان للمتولين، والامتنان بعفو الله ",
                    "ayat":[ "١٥٥"
                ]},
                {
                    "id": 53,
                    "question": "تحذير المؤمنين من التشبه بالكافرين في أقوال التحسر حول الموت والقتل، ببيان أن الله هو المحي المميت، والترغيب في رحمة الله والحشر إليه ",
                    "ayat":[ "١٥٨-١٥٦"
                ]},
                {
                    "id": 54,
                    "question": "الثناء على النبي ﷺ بما كان عليه من قيادة وأخلاق، وحثه على العفو عنهم ومشاورتهم والتوكل على الله الذي بيده النصر، وتنزيه النبي   ﷺ عن الغلول ",
                    "ayat":[ "١٦١-١٥٩"
                ]},
                {
                    "id": 55,
                    "question": "التفاوت بين من اتبع رضوان الله ومَن باء بسخطه في الدرجات ",
                    "ayat":[ "١٦٣-١٦٢"
                ]},
                {
                    "id": 56,
                    "question": "الامتنان على المؤمنين ببعثة الرسول ﷺ فيهم، وبيان أسباب مصيبة المسلمين يوم أحد، وفضح أقوال المنافقين الرد عليها ",
                    "ayat":[ "١٦٨-١٦٤"
                ]},
                {
                    "id": 57,
                    "question": "منزلة الشهداء ",
                    "ayat":[ "١٧١-١٦٩"
                ]},
                {
                    "id": 58,
                    "question": "غزوة حمراء الأسد والثناء على استجابة المسلمين لها، وبيان مصدر الخوف ",
                    "ayat":[ "١٧٥-١٧٢"
                ]},
                {
                    "id": 59,
                    "question": "لا حزن من الكفر فإنه لا يضر الله شيئا بل هو عذاب عظيم أليم للكفار ",
                    "ayat":[ "١٧٧-١٧٦"
                ]},
                {
                    "id": 60,
                    "question": "من ثمرات الغزوة؛ إملاء الكفار حتى يصيروا إلى عذاب مهين، والتمايز بين الخبيث والطيب، وعظيم الأجر للمؤمنين ",
                    "ayat":[ "١٧٩-١٧٨"
                ]},
                {
                    "id": 61,
                    "question": "ذم البخل وبيان عاقبة منع الزكاة، وتهديد اليهود الذين نسبوا الفقر إلى الله، وقتلوا أنبيائهم، وبيان جزائهم العادل ",
                    "ayat":[ "١٨٢-١٨٠"
                ]},
                {
                    "id": 62,
                    "question": "فضح تعنت اليهود وكذبهم بطلبهم القربان الدال على صدق الرسالة، وتسلية النبي  ﷺ عما يلقاه من تكذيب ",
                    "ayat":[ "١٨٤-١٨٣"
                ]},
                {
                    "id": 63,
                    "question": "بيان حتمية الموت والجزاء، وحقييقة الفوز والحياة ",
                    "ayat":[ "١٨٥"
                ]},
                {
                    "id": 64,
                    "question": "حتمية الابتلاء في النفس والمال والدين، والحث على الصبر والتقوى ",
                    "ayat":[ "١٨٦"
                ]},
                {
                    "id": 65,
                    "question": "ذم أهل الكتاب لمخالفتهم ميثاق الله ",
                    "ayat":[ "١٨٧"
                ]},
                {
                    "id": 66,
                    "question": "ذم أهل الكتاب والمنافقين لفرحهم بكذبهم واحتيالهم، وبيان استحقاقهم العذاب الأليم، وتوعدهم بملك الله تعالى وقدرته ",
                    "ayat":[ "١٨٩-١٨٨"
                ]},
                {
                    "id": 67,
                    "question": "اعتبار ذوي الألباب بخلق السماوات والأرض، وأحوالهم مع الذكر والتفكر والدعاء، واستجابة الله لهم، وتفصيل ثوابهم ",
                    "ayat":[ "١٩٥-١٩٠"
                ]},
                {
                    "id": 68,
                    "question": "حقيقة تقلب الكفار في البلاد وجزاؤهم، ونُزُل المتقين، والثناء على مؤمني أهل الكتاب ",
                    "ayat":[ "١٩٩-١٩٦"
                ]},
                {
                    "id": 69,
                    "question": "وصية خالدة؛ الصبر والمصابرة، والمرابطة والتقوى سبيل الفلاح ",
                    "ayat":[ "٢٠٠"
                    ]
                }
            ]
        },     
        {
            "sura":"النساء",
            "questions": [
                {
                    "id": 1,
                    "question": "المقدمة: أمر الناس بتقوى الله, خالق البشرية، والوصية بمراقبة الله في ذوي الأرحام",
                    "ayat":[ "١"
                ]},
                {
                    "id": 2,
                    "question": "إيتاء اليتامى أموالهم والتحذير من استبدالها أو أكلها",
                    "ayat":[ "٢"
                ]},
                {
                    "id": 3,
                    "question": "نكاح اليتامى وإباحة التعدد مع العدل، أو الاقتصار علي الواحدة أو ملك اليمين عند تعذره",
                    "ayat":[ "٣"
                ]},
                {
                    "id": 4,
                    "question": "حق المرأة في الصداق و حل ما تطيب به نفسها عنه",
                    "ayat":[ "٤"
                ]},
                {
                    "id": 5,
                    "question": "وجوه التصرف في أموال السفهاء",
                    "ayat":[ "٥"
                ]},
                {
                    "id": 6,
                    "question": "اختبار اليتامى قبل دفع أموالهم إليهم، وحكم أكل الولي منها، والإشهاد على تسليمها",
                    "ayat":[ "٦"
                ]},
                {
                    "id": 7,
                    "question": "اشتراك الرجال والنساء في الميراث، واستحباب إكرام من حضر القسمة من غير الورثة",
                    "ayat":[ " ٨ - ٧"
                ]},
                {
                    "id": 8,
                    "question": "وعظ وتهديد؛ وعظ لكل من أمر ونهى في شأن الوصية وأموال اليتامى، وتهديد الظالمين",
                    "ayat":[ " ١٠ - ٩"
                ]},
                {
                    "id": 9,
                    "question": "بيان ما فرض الله للأولاد وللوالدين بعد إخراج الوصية و الدين",
                    "ayat":[ "١١"
                ]},
                {
                    "id": 10,
                    "question": "بيان فرض الزوج والزوجة، والإخوة لأم \"كلالة الشتاء\" بعد إخراج الوصية والدين بغير مضارة",
                    "ayat":[ "١٢"
                ]},
                {
                    "id": 11,
                    "question": "تأكيد ووعد ووعيد؛ تأكيد التزام حدود الله، ووعد الطائعين، ووعيد العصاة المعتدين",
                    "ayat":[ "١٤ - ١٣"
                ]},
                {
                    "id": 12,
                    "question": "عقوبة الفاحشة قبل تشريع حد الزنا، وأحوال قبول التوبة وردها",
                    "ayat":[ "١٨ - ١٥"
                ]},
                {
                    "id": 13,
                    "question": "إبطال عادة الجاهلية في توارث المرأة، وحكم عضلها، والأمر بالمعاشرة بالمعروف، وتقبيح استرجاع شيء من المهر عند رغبة الزوج في الطلاق",
                    "ayat":[ "٢١ - ١٩"
                ]},
                {
                    "id": 14,
                    "question": "تحريم نكاح ما نكح الآباء، وبيان المحرمات من النساء بالنسب والرضاع والمصاهرة والجمع، وشروط نكاح المحصنات",
                    "ayat":[ "٢٤ - ٢٢"
                ]},
                {
                    "id": 15,
                    "question": "الإذن بالزواج من الإماء، وشروطه، وعقوبة فاحشتهن، والترغيب في الصبر عن نكاحهن",
                    "ayat":[ "٢٥"
                ]},
                {
                    "id": 16,
                    "question": "موعظة بين الأحكام: بيان الحكمة من الأحكام الشرعية، والتحذير من أهل الشهوات، وبيان ضعف الإنسان",
                    "ayat":[ "٢٧ - ٢٦"
                ]},
                {
                    "id": 17,
                    "question": "تذكير المؤمنين بحرمة الأموال والأنفس، ووعيد، ووعد",
                    "ayat":[ "٣١ - ٢٩"
                ]},
                {
                    "id": 18,
                    "question": "النهي عن تمني ما خص الله به كلا من الجنسين، وعلاجه، وبيان أن لكل منهما ورثة، وحق الموالي في النصرة وإتمام العهد",
                    "ayat":[ "٣٣ - ٣٢"
                ]},
                {
                    "id": 19,
                    "question": "قوامة الرجال على النساء، وأوصاف الصالحات منهن، وعلاج نشوزهن، وطرق تسوية النزاع بين الأزواج",
                    "ayat":[ "٣٥ - ٣٤"
                ]},
                {
                    "id": 20,
                    "question": "بيان الحقوق العَشَرة، والتحذير من الفخر والبخل، وكتمان فضل الله و الإنفاق رياءً، وخسرانهم بكفرهم",
                    "ayat":[ "٣٩ - ٣٦"
                ]},
                {
                    "id": 21,
                    "question": "التذكير بعدل الله وكرمه، وشهادة الرسول صلي الله عليه وسلم على قومه، وحسرة الكفار العصاة يوم القيامة",
                    "ayat":[ "٤٢ - ٤٠"
                ]},
                {
                    "id": 22,
                    "question": "نهي المؤمنين عن قربان الصلاة حال السكر والجنابة، وتشريع التيمم",
                    "ayat":[ "٤٣"
                ]},
                {
                    "id": 23,
                    "question": "بيان ضلال أهل الكتاب وعداوتهم والتحذي منهم",
                    "ayat":[ "٤٥ - ٤٤"
                ]},
                {
                    "id": 24,
                    "question": "بعض أفعال وأقوال اليهود القبيحة، ولعن الله لهم",
                    "ayat":[ "٤٦"
                ]},
                {
                    "id": 25,
                    "question": "دعوة أهل الكتاب للإيمان وتهديدهم بالطمس واللعن، والحرمان من المغفرة بسبب افتراء الشرك",
                    "ayat":[ "٤٨ - ٤٧"
                ]},
                {
                    "id": 26,
                    "question": "تزكية اليهود لأنفسهم وافترائهم الكذب على الله",
                    "ayat":[ "٥٠ - ٤٩"
                ]},
                {
                    "id": 27,
                    "question": "بيان كفر أهل الكتاب، وتفضيلهم للكفار، ولعن الله لهم، وبيان بخلهم وحسدهم للمسلمين",
                    "ayat":[ "٥٥ - ٥١"
                ]},
                {
                    "id": 28,
                    "question": "عذاب الكفار ونعيم المؤمنين",
                    "ayat":[ "٥٧ - ٥٦"
                ]},
                {
                    "id": 29,
                    "question": "توطئة: الأمر بأداء الأمانات والحكم بالعدل، وطاعة الله ورسوله وأولي الأمر، ورد التنازع إليهما",
                    "ayat":[ "٥٩ - ٥٨"
                ]},
                {
                    "id": 30,
                    "question": "فضح المنافقين بذكر تحاكمهم الى الطاغوت، وصدودهم عن الله ورسوله، وحالهم عند نزول المصيبة، وأمر الرسول ﷺ بالإعراض عنهم ووعظهم وزجرهم",
                    "ayat":[ "٦٣ - ٦٠"
                ]},
                {
                    "id": 31,
                    "question": "بيان لزوم طاعة الرسول وكفارة مخالفته، وأن تحكيم الشريعة والإستسلام لها برهان الإيمان",
                    "ayat":[ "٦٥ - ٦٤"
                ]},
                {
                    "id": 32,
                    "question": "بيان طبع العناد والعصيان عند المنافقين، وحرمانهم من جزاء الطاعة، وفضل الله على المطيعين",
                    "ayat":[ "٧٠ - ٦٦"
                ]},
                {
                    "id": 33,
                    "question": "أمر المؤمنين بالحذر من مباغتة الكفار، والتحذير من تثبيط المنافقين، وبيان أقوالهم حال الهزيمة والنصر",
                    "ayat":[ "٧٣ - ٧١"
                ]},
                {
                    "id": 34,
                    "question": "الترغيب بالقتال في سبيل الله ببيان جزائه وضرورته وغايته المبشرة بالنصر",
                    "ayat":[ "٧٦ - ٧٤"
                ]},
                {
                    "id": 35,
                    "question": "حال من جبن عن القتال بعد تمنيه، والرد عليهم، وتطير بعضهم بالرسول ﷺ، والرد عليهم، وتأكيد رسالته ﷺ، ولزوم طاعته لتحقيق طاعة الله",
                    "ayat":[ "٨٠ - ٧٧"
                ]},
                {
                    "id": 36,
                    "question": "بيان موقف المنافقين من طاعة الرسول ﷺ، وتسليته، والعجب من عدم تدبرهم للقرآن المحكم",
                    "ayat":[ "٨٢ - ٨١"
                ]},
                {
                    "id": 37,
                    "question": "بيان موقف المنافقين من إذاعة الأخبار قبل التحقق من صدقها، تذكير المؤمنين بفضل الله ورحمته",
                    "ayat":[ "٨٣"
                ]},
                {
                    "id": 38,
                    "question": "تسلية: أمر النبي ﷺ بالقتال وتحريض المؤمنين عليه، والترغيب في الشفاعة الحسنة والتحذير من شفاعة السوء، وأدب رد التحية وتمجيد الله وتهديد المكذبين",
                    "ayat":[ "٨٧ - ٨٤"
                ]},
                {
                    "id": 39,
                    "question": "عتاب المؤمنين لإنقسام موقفهم من المنافقين بعد ظهور ضلالهم، وبيان حرصهم علي تكفير المؤمنين، والنهي عن موالاتهم، والأمر بقتالهم إن لم يهاجروا، وإستثناء أصحاب المواثيق والمستسلمون الكارهون لقتال الفريقين، والأمر بقتل المتلاعبين المحاربين",
                    "ayat":[ "٩١ - ٨٨"
                ]},
                {
                    "id": 40,
                    "question": "أحكام القتل الخطأ وجزاء القتل المتعمد",
                    "ayat":[ "٩٣ - ٩٢"
                ]},
                {
                    "id": 41,
                    "question": "أمر المؤمنين بالتبين عند القتل، وعدم التعجل في الحكم بالإسلام أو عدمه",
                    "ayat":[ "٩٤"
                ]},
                {
                    "id": 42,
                    "question": "التفاضل بين المجاهدين والقاعدين من غير أولي الضرر",
                    "ayat":[ "٩٦ - ٩٥"
                ]},
                {
                    "id": 43,
                    "question": "جزاء تاركي الهجرة بغير عذر، والعفو عن أهل الأعذار، والترغيب في الهجرة",
                    "ayat":[ "١٠٠ - ٩٧"
                ]},
                {
                    "id": 44,
                    "question": "قصر صلاة السفر، وصفة صلاة الخوف، والأمر بذكر الله على كل حال وإقامة الصلاة في وقتها، والنهي عن الوهن في الجهاد",
                    "ayat":[ "١٠٤ - ١٠١"
                ]},
                {
                    "id": 45,
                    "question": "عتاب النبي ﷺ، وتوجيه، وبيان",
                    "ayat":[ "١٠٩ - ١٠٥"
                ]},
                {
                    "id": 46,
                    "question": "الحث على الإستغفار، ومسؤولية الفرد عن كسبه، وعظم إثم اتهام البريء",
                    "ayat":[ "١١٢ - ١١٠"
                ]},
                {
                    "id": 47,
                    "question": "تذكير النبي بعصمة الله له وفضله عليه",
                    "ayat":[ "١١٣"
                ]},
                {
                    "id": 48,
                    "question": "التعريض بالنجوى، واستثناء حالات ثلاث",
                    "ayat":[ "١١٤"
                ]},
                {
                    "id": 49,
                    "question": "جزاء مشاقة الله، وحرمان المشرك من مغفرته، وبيان ضعف المعبودات من دونه، وحقيقة الشيطان، وحيله، وجزاء أتباعه، ووعد الله للمؤمنين بالجنات",
                    "ayat":[ "١٢٢ - ١١٥"
                ]},
                {
                    "id": 50,
                    "question": "لا اعتبار للأماني، والجزاء منوط بالعمل",
                    "ayat":[ "١٢٤ - ١٢٣"
                ]},
                {
                    "id": 51,
                    "question": "الثناء على من أسلم وأحسن لله واتبع خليله إبراهيم عليه السلام",
                    "ayat":[ "١٢٥"
                ]},
                {
                    "id": 52,
                    "question": "تمام ملك الله وإحاطته",
                    "ayat":[ "١٢٦"
                ]},
                {
                    "id": 53,
                    "question": "نكاح يتامى النساء، والمستضعفين من الولدان واليتامى",
                    "ayat":[ "١٢٧"
                ]},
                {
                    "id": 54,
                    "question": "علاج نشوز الرجل أو إعراضه، وتحذير الأزواج من الميل عن زوجة إلى أخرى، ومشروعية الفرقة",
                    "ayat":[ "١٣٠ - ١٢٨"
                ]},
                {
                    "id": 55,
                    "question": "عموم ملك الله، ووصيته للمؤمنين وأهل الكتاب بالتقوى، وغناه عن الكفار",
                    "ayat":[ "١٣١"
                ]},
                {
                    "id": 56,
                    "question": "تأكيد ملك الله وقيامه بشؤون خلقه",
                    "ayat":[ "١٣٢"
                ]},
                {
                    "id": 57,
                    "question": "تهديد الناس بالهلاك و الإستبدال، والترغيب بإخلاص الإرادة والقصد",
                    "ayat":[ "١٣٤ - ١٣٣"
                ]},
                {
                    "id": 58,
                    "question": "أمر المؤمنين بشهادة الحق وحكم العدل، والثبات على الإيمان، وبيان ضلال من تردد بين الكفر والإيمان",
                    "ayat":[ "١٣٧ - ١٣٥"
                ]},
                {
                    "id": 59,
                    "question": "تبشير المنافقين بالعذاب بسبب موالاتهم للكفار",
                    "ayat":[ "١٣٩ - ١٣٨"
                ]},
                {
                    "id": 60,
                    "question": "تحذير المؤمنين من مجالستهم حال كفرهم واستهزائهم بآيات الله",
                    "ayat":[ "١٤٠"
                ]},
                {
                    "id": 61,
                    "question": "من صور خداع المنافقين، وبيان كسلهم في العبادة، وذبذبتهم",
                    "ayat":[ "١٤٣ - ١٤١"
                ]},
                {
                    "id": 62,
                    "question": "تحذير المؤمنين من موالاة الكفار",
                    "ayat":[ "١٤٤"
                ]},
                {
                    "id": 63,
                    "question": "منزلة المنافقين في النار، واستثناء التائبين، ورغبة الله عن عذاب المؤمنين",
                    "ayat":[ "١٤٧ - ١٤٥"
                ]},
                {
                    "id": 64,
                    "question": "تحريم الجهر بالسوء إلا لمن ظلم، والتغيب بعمل الخير والعفو",
                    "ayat":[ "١٤٩ - ١٤٨"
                ]},
                {
                    "id": 65,
                    "question": "بيان كفر أهل الكتاب لتفريقهم بين الإيمان باالله والإيمان برسله، وما أُعد لهم من العذاب، وعظيم أجر المؤمنين بجميعهم",
                    "ayat":[ "١٥٢ - ١٥٠"
                ]},
                {
                    "id": 66,
                    "question": "ذم أهل الكتاب لطلبهم كتاباً من السماء وعرض قبائحهم مع موسى عليه السلام",
                    "ayat":[ "١٥٤ - ١٥٣"
                ]},
                {
                    "id": 67,
                    "question": "عرض بعض جرائم اليهود وافترائهم على مريم والمسيح عليه السلام، وتقرير رفع الله له، وإيمانهم به قبل موته، وشهادته عليهم يوم القيامة",
                    "ayat":[ "١٥٩ - ١٥٥"
                ]},
                {
                    "id": 68,
                    "question": "استكمال جرائم اليهود واستحقاقهم العذاب، واستدراك الراسخين والمؤمنين منهم",
                    "ayat":[ "١٦٢ - ١٦٠"
                ]},
                {
                    "id": 69,
                    "question": "بيان أن الوحي للرسول ﷺ من جنس الوحي للرسل قبله تفصيلاً وإجمالاً، وبيان الحكمة من ارسالهم، وشهادة الله وملائكته بصدق الرسالة",
                    "ayat":[ "١٦٦ - ١٦٣"
                ]},
                {
                    "id": 70,
                    "question": "بيان ضلال الكفار وحرمانهم من المغفرة وخلودهم في جهنم",
                    "ayat":[ "١٦٩ - ١٦٧"
                ]},
                {
                    "id": 71,
                    "question": "دعوة الناس إلى الإيمان بالرسول ﷺ وغنى الله عن الكفار",
                    "ayat":[ "١٧٠"
                ]},
                {
                    "id": 72,
                    "question": "دعوة النصارى إلى ترك الغلو والتثليث، وبيان حقيقة عيسى عليه السلام، وتأكيد وحدانية الله وملكه",
                    "ayat":[ "١٧١"
                ]},
                {
                    "id": 73,
                    "question": "بيان عدم امتناع عيسى عليه السلام والملائكة من العبودية لله تعالى وتوعد المستنفكين بالحشر وجزاء المؤمنين والمستنكفين",
                    "ayat":[ "١٧٣ - ١٧٢"
                ]},
                {
                    "id": 74,
                    "question": "دعوة الناس جميعاً إلى الإيمان بالرسول ﷺ والقرآن، وجزاء المؤمنين",
                    "ayat":[ "١٧٥ - ١٧٤"
                ]},
                {
                    "id": 75,
                    "question": "الخاتمة: استفتاء وفتوى \"كلالة الصيف\"",
                    "ayat":[ "١٧٦"
                    ]
                }
            ]
        },
        {
            "sura":"المائدة",
            "questions":  [
                {
                    "id": 1,
                    "question": "الأمر بالوفاء بالعقود، وبيان حل بهيمة الأنعام، واستثناء ما سيُحرم، وتحريم الصيد على المُحْرِم.  ",
                    "ayat":[ "١"
                ]},
                {
                    "id": 2,
                    "question": "النهي عن استحلال حرمات الله، الصيد بعد التحلل، والنهي عن الاعتداء، والأمر بالتعاون على الخير، وتقوى الله شديد العقاب.  ",
                    "ayat":[ "٢"
                ]},
                {
                    "id": 3,
                    "question": "المحرمات من بهيمة الأنعام، وانقطاع طمع الكفار من ارتداد المسلمين، وإكمال الدين، ورفع التحريم للمضطر.  ",
                    "ayat":[ "٣"
                ]},
                {
                    "id": 4,
                    "question": "إجابة السائلين عن المحللات من المطعومات، وتأكيد حلها، وبيان حل طعام أهل الكتاب وحل نكاح الحرائر من المؤمنات ومن الكتابيات.  ",
                    "ayat":[ " ٥-٤"
                ]},
                {
                    "id": 5,
                    "question": "آية الوضوء، ورعاية التشريع لمصالح العباد، وتذكيرهم بنعمة الله وميثاقه، وأمرهم بالتقوى.  ",
                    "ayat":[ " ٧-٦"
                ]},
                {
                    "id": 6,
                    "question": "أمر المؤمنين بالقيام لله والقسط في الشهادة حتى مع الأعداء، والترغيب بالتقوى.  ",
                    "ayat":[ "٨"
                ]},
                {
                    "id": 7,
                    "question": "تعقيب على التشريعات: وعد المؤمنين بالمغفرة والأجر، وتوعد الكفار المكذبين بالجحيم.  ",
                    "ayat":[ " ١٠-٩"
                ]},
                {
                    "id": 8,
                    "question": "تذكير المؤمنين بنعمة إلقاء الرعب في قلوب أعدائهم.  ",
                    "ayat":[ "١١"
                ]},
                {
                    "id": 9,
                    "question": "ميثاق بني إسرائيل، وإقامة النقباء عليهم، وعقوبة الله لهم بسبب نقضهم له، وبيان استمرارية خيانتهم. ",
                    "ayat":[ "١٣-١٢"
                ]},
                {
                    "id": 10,
                    "question": "ميثاق النصارى، وعقوبة الله لهم بسبب تركهم له. ",
                    "ayat":[ "١٤"
                ]},
                {
                    "id": 11,
                    "question": "دعوة أهل الكتاب للإيمان بالرسول ﷺ والقرآن، وبيان ثمرة الاهتداء.  ",
                    "ayat":[ "١٦-١٥"
                ]},
                {
                    "id": 12,
                    "question": "الحكم بكفر النصارى، ومناقشة بطلان اعتقادهم عقلا. ",
                    "ayat":[ "١٧"
                ]},
                {
                    "id": 13,
                    "question": "إحدى دعاوى اليهود والنصارى، وبيان بطلانها.  ",
                    "ayat":[ "١٨"
                ]},
                {
                    "id": 14,
                    "question": "تكرار دعوة أهل الكتاب للإيمان بالرسول ﷺ والامتنان بإرساله. ",
                    "ayat":[ "١٩"
                ]},
                {
                    "id": 15,
                    "question": "قصة نكول بني إسرائيل عن الجهاد مع موسى عليه السلام لدخول الأرض المقدسة، وعقابهم بالتيه. ",
                    "ayat":[ "٢٦-٢٠"
                ]},
                {
                    "id": 16,
                    "question": "قصة قابيل وهابيل، إحدى صور الحسد والإفساد. ",
                    "ayat":[ "٣١-٢٧"
                ]},
                {
                    "id": 17,
                    "question": "حرمة الأنفس، وإسراف كثير من بني إسرائيل في الأرض. ",
                    "ayat":[ "٣٢"
                ]},
                {
                    "id": 18,
                    "question": "الفساد المبيح لقتل النفس، وجزاؤه في الدنيا والآخرة، واستثناء التائبين \"حد الحرابة\". ",
                    "ayat":[ "٣٤-٣٣"
                ]},
                {
                    "id": 19,
                    "question": "موعظة للمؤمنين: الحث على التقوى والقربى والجهاد. ",
                    "ayat":[ "٣٥"
                ]},
                {
                    "id": 20,
                    "question": "بيان ندامة الكفار، واستحالة الفداء والخروج من العذاب. ",
                    "ayat":[ "٣٧-٣٦"
                ]},
                {
                    "id": 21,
                    "question": "حد السرقة، والمغفرة لمن تاب وأصلح. ",
                    "ayat":[ "٣٩-٣٨"
                ]},
                {
                    "id": 22,
                    "question": "عموم ملك الله، وقدرته على العذاب أو المغفرة لمن شاء ",
                    "ayat":[ "٤٠"
                ]},
                {
                    "id": 23,
                    "question": "تسلية الرسول ﷺ عن مسارعة اليهود في الكفر، ومكرهم وتلاعبهم، وبيان فتنة الله لهم وعذابهم. ",
                    "ayat":[ "٤١"
                ]},
                {
                    "id": 24,
                    "question": "ذم فعال اليهود، وتخيير النبي ﷺ بين الحكم بينهم أو الإعراض عنهم، والتعجيب من تحكيمهم للرسول ﷺ مع إعراضهم عن التوراة. ",
                    "ayat":[ "٤٣-٤٢"
                ]},
                {
                    "id": 25,
                    "question": "من أوصاف التوراة ووجوب تحكيمهم لها، وبعض أحكامها التي بدلها اليهود. ",
                    "ayat":[ "٤٥-٤٤"
                ]},
                {
                    "id": 26,
                    "question": "إرسال عيسى عليه السلام بالإنجيل، وبعض أوصافه، ووجوب تحكيمهم له. ",
                    "ayat":[ "٤٧-٤٦"
                ]},
                {
                    "id": 27,
                    "question": "تشريف النبي ﷺ بإنزال الكتاب إليه، وبيان بعض أوصافه، ووجوب تحكيمه، والتحذير من اتباع أهواء اليهود، وقضاء الله في الاختلاف والابتلاء والمرجع",
                    "ayat":[ "٤٨"
                ]},
                {
                    "id": 28,
                    "question": "تأكيد أمر الرسول ﷺ بالحكم بشريعة القرآن، والتحذير من فتنة اليهود له، وبيان سبب توليهم وتوبيخهم. ",
                    "ayat":[ "٥٠-٤٩"
                ]},
                {
                    "id": 29,
                    "question": "تحذير المؤمنين من موالاة اليهود والنصارى، وبيان سببه، وحكم فاعله.  ",
                    "ayat":[ "٥١"
                ]},
                {
                    "id": 30,
                    "question": "موالاة المنافقين لليهود والنصارى، وسببها، وتوعد فاعليها، وموقف المؤمنين من ذلك.  ",
                    "ayat":[ "٥٣-٥٢"
                ]},
                {
                    "id": 31,
                    "question": "تحذير المؤمنين من الردة، وتهديدهم بالاستبدال، وبيان وجوه الولاية الحقة وأنها سبب الغلبة. ",
                    "ayat":[ "٥٦-٥٤"
                ]},
                {
                    "id": 32,
                    "question": "تحذير المؤمنين من موالاة الكفار المستهزئين بالدين، ومن ذلك استهزائهم بالنداء للصلاة.  ",
                    "ayat":[ "٥٨-٥٧"
                ]},
                {
                    "id": 33,
                    "question": "توبيخ أهل الكتاب على عنادهم وحسدهم، والتذكير بسوء فعال من قبلهم وسوء مصيرهم. ",
                    "ayat":[ "٦٠-٥٩"
                ]},
                {
                    "id": 34,
                    "question": "بيان نفاق أهل الكتاب للمسلمين. ",
                    "ayat":[ "٦١"
                ]},
                {
                    "id": 35,
                    "question": "بيان مسارعة أهل الكتاب في الكذب وأكل المحرم، وتوبيخ رؤسائهم لترك نهيهم عن ذلك. ",
                    "ayat":[ "٦٣-٦٢"
                ]},
                {
                    "id": 36,
                    "question": "سوء أدب اليهود في نسبتهم البخل إلى الله تعالى، والرد عليهم. ",
                    "ayat":[ "٦٤"
                ]},
                {
                    "id": 37,
                    "question": "خسران أهل الكتاب لخيرات الدنيا والآخرة بتركهم الإيمان والتقوى، وإقامة أحكام التوراة والإنجيل. ",
                    "ayat":[ "٦٦-٦٥"
                ]},
                {
                    "id": 38,
                    "question": "أمر الرسول ﷺ بالتبليغ التام، وعصمة الله له من الكفار. ",
                    "ayat":[ "٦٧"
                ]},
                {
                    "id": 39,
                    "question": "أمر الرسول ﷺ بمواجهة أهل الكتاب ببطلان اعتقادهم، وبيان ازديادهم في الطغيان والكفر. ",
                    "ayat":[ "٦٨"
                ]},
                {
                    "id": 40,
                    "question": "بشارة المؤمنين العاملين من جميع الملل بالأمن والسلامة يوم القيامة. ",
                    "ayat":[ "٦٩"
                ]},
                {
                    "id": 41,
                    "question": "من قبائح اليهود؛ نقضهم الميثاق، وقتلهم الأنبياء، وعمايتهم وصممهم عن الحق. ",
                    "ayat":[ "٧١-٧٠"
                ]},
                {
                    "id": 42,
                    "question": "من قبائح النصارى؛ كفرهم بزعمهم أن الله هو المسيح مع تحذيره لهم من الشرك، وكفرهم بزعمهم أن الله ثالث ثلاثة، وتهديدهم بالعذاب ودعوتهم للتوبة والاستغفار. ",
                    "ayat":[ "٧٤-٧٢"
                ]},
                {
                    "id": 43,
                    "question": "بيان حقيقة المسيح عليه السلام وأمه، والعجب من انصراف النصارى عن هذا البيان، وتوبيخهم على عبادة غير الله. ",
                    "ayat":[ "٧٦-٧٥"
                ]},
                {
                    "id": 44,
                    "question": "نهي الله لأهل الكتاب عن الغلو في الدين وتتبع الأهواء. ",
                    "ayat":[ "٧٧"
                ]},
                {
                    "id": 45,
                    "question": "لعن بني إسرائيل وأسباب استحقاقهم له. ",
                    "ayat":[ "٧٩-٧٨"
                ]},
                {
                    "id": 46,
                    "question": "موالاة منافقي اليهود للكفار، وبيان أسبابها",
                    "ayat":[ "٨١-٨٠"
                ]},
                {
                    "id": 47,
                    "question": "علاقة اليهود بالمؤمنين، وعلاقة النصارى بهم وبيان أسبابها، والثناء على مؤمنيهم, ووعدهم بالثواب، وتوعد الكفار المكذبين ",
                    "ayat":[ "٨٦-٨٢"
                ]},
                {
                    "id": 48,
                    "question": "نهي المؤمنين عن تحريم الطيبات التي أحلها الله لهم، وأمرهم بالأكل منها وبتقوى الله.  ",
                    "ayat":[ "٨٨-٨٧"
                ]},
                {
                    "id": 49,
                    "question": "أحكام اليمين اللغو واليمين المنعقدة وكفارتها. ",
                    "ayat":[ "٨٩"
                ]},
                {
                    "id": 50,
                    "question": "تحريم الخمر والميسر وبيان مفاسدهما الدنيوية والدينية.  ",
                    "ayat":[ "٩١-٩٠"
                ]},
                {
                    "id": 51,
                    "question": "الأمر بطاعة الله ورسوله ﷺ، والتحذير من التولي عن ذلك، ورفع الجناح عن المؤمنين عما مضى من المطاعم ما داموا على الإيمان والتقوى والإحسان.  ",
                    "ayat":[ "٩٣-٩٢"
                ]},
                {
                    "id": 52,
                    "question": "ابتلاء المؤمنين بتوافر الصيد حال الإحرام، وتحريمه عليهم، وبيان فديته، والتحذير من انتقام الله، وحل صيد البحر وطعامه في الحل والإحرام.  ",
                    "ayat":[ "٩٦-٩٤"
                ]},
                {
                    "id": 53,
                    "question": "الكعبة والأشهر الحرم والهدي والقلائد قيامٌ وصلاح للناس.  ",
                    "ayat":[ "٩٧"
                ]},
                {
                    "id": 54,
                    "question": "ترهيب وترغيب، وإعذار بالبلاغ، وتوعد بعلم الله.  ",
                    "ayat":[ "٩٩-٩٨"
                ]},
                {
                    "id": 55,
                    "question": "لا مساواة بين الخبيث والطيب، والأمر بالتقوى.  ",
                    "ayat":[ "١٠٠"
                ]},
                {
                    "id": 56,
                    "question": "النهي عن السؤال عما لم ينزل به وحي، وبيان علته.  ",
                    "ayat":[ "١٠٢-١٠١"
                ]},
                {
                    "id": 57,
                    "question": "إبطال محرمات الجاهلية في الأنعام، وتوبيخ المتعذرين بتقليد الآباء، وتثبيت المؤمنين على الهداية.  ",
                    "ayat":[ "١٠٥-١٠٣"
                ]},
                {
                    "id": 58,
                    "question": "أحكام الوصية في السفر ",
                    "ayat":[ "١٠٨-١٠٦"
                ]},
                {
                    "id": 59,
                    "question": "التحذير من يوم سؤال الرسل عما أجابهم به أقوامهم، وبيان جوابهم.  ",
                    "ayat":[ "١٠٩"
                ]},
                {
                    "id": 60,
                    "question": "تذكير عيسى عليه السلام بنعم الله عليه وعلى والدته.  ",
                    "ayat":[ "١١١-١١٠"
                ]},
                {
                    "id": 61,
                    "question": "التذكير بطلب الحواريين نزول المائدة، وبيان أسبابه، وسؤال عيسى عليه السلام لها، والوعد بإنزالها، وتهديد من كفر بعد ذلك.  ",
                    "ayat":[ "١١٥-١١٢"
                ]},
                {
                    "id": 62,
                    "question": "مواجهة عيسى عليه السلام باعتقاد النصارى فيه، وتبرئه من عابديه، وجزاء الصادقين وفوزهم.  ",
                    "ayat":[ "١١٩-١١٦"
                ]},
                {
                    "id": 63,
                    "question": "الخاتمة: عموم ملك الله وقدرته.  ",
                    "ayat":[ "١٢٠"
                    ]
                }
            ]
        }, 
        {
            "sura":"الأنعام",
            "questions":  [
                {
                    "id": 1,
                    "question": "المقدمة: حمد الله خالق الكون والإنسان، وبيان اختصاصه بالألوهية وتمام علمه جل جلاله ",
                    "ayat":[ " ٣-١"
                ]},
                {
                    "id": 2,
                    "question": "بيان إعراضهم، وتهديدهم، وتذكيرهم بهلاك القرون بعد استدراجهم بالنعم ",
                    "ayat":[ " ٦-٤"
                ]},
                {
                    "id": 3,
                    "question": "تسلية النبي صلى الله عليه وسلم: ببيان دأبهم على التكذيب ولو عاينوا نزول القرآن ولامسوه ",
                    "ayat":[ "٧"
                ]},
                {
                    "id": 4,
                    "question": "طلبهم نزول ملك، وبيان وجه استحالته ",
                    "ayat":[ " ٩-٨"
                ]},
                {
                    "id": 5,
                    "question": "تسلية النبي صلى الله عليه وسلم: بيان أن الاستهزاء بالرسل وعقوبة المستهزئين بهم سنة ماضية ",
                    "ayat":[ " ١١-١٠"
                ]},
                {
                    "id": 6,
                    "question": "حجج الوحدانية في ملكوت الكون والتدبير؛ وإعلان الإسلام والخوف من عاقبة العصيان، وأن الضر والخير بيد الله، وهو القاهر جل جلاله ",
                    "ayat":[ "١٨-١٢"
                ]},
                {
                    "id": 7,
                    "question": "عند الإشهاد والمفاصلة، وبيان حقيقة أهل الكتاب، وتقرير خسران المكذبين وظلمهم ",
                    "ayat":[ "٢١-١٩"
                ]},
                {
                    "id": 8,
                    "question": "يوم الحشر؛ بيان تبرؤهم من الشرك، وكذبهم على أنفسهم ",
                    "ayat":[ "٢٤-٢٢"
                ]},
                {
                    "id": 9,
                    "question": "في الدنيا؛ مجادلتهم في القرآن والآيات والرسول صلى الله عليه وسلم ",
                    "ayat":[ "٢٦-٢٥"
                ]},
                {
                    "id": 10,
                    "question": "في النار؛ بيان ندامتهم، وتمنيهم الرجعة للإيمان، وكذبهم، وعودتهم لأقاويلهم المكذبة بالبعث ",
                    "ayat":[ "٢٩-٢٧"
                ]},
                {
                    "id": 11,
                    "question": "بين يدي ربهم؛ مواجهة، وإقرار، وجزاء، وخسران، وحسرة، وظهور المفارقة بين دار الدنيا والآخرة ",
                    "ayat":[ "٣٢-٣٠"
                ]},
                {
                    "id": 12,
                    "question": "تسلية النبي صلى الله عليه وسلم ببيان حقيقة تكذيبهم، وتذكيره بأحوال الرسل مع أقوامهم، وتيئيسه من إيمانهم بالآيات، وبيان أسباب ذلك ",
                    "ayat":[ "٣٦-٣٣"
                ]},
                {
                    "id": 13,
                    "question": "طلبهم آية، والرد عليهم ببيان قدرة الله وإحاطة علمه، وبيان تخبط المكذبين في الظلمات ",
                    "ayat":[ "٣٩-٣٧"
                ]},
                {
                    "id": 14,
                    "question": "التهديد بالعذاب والساعة تنبيها على حالهم في التجائهم إلى الله ونسيانهم آلهتهم ",
                    "ayat":[ "٤١-٤٠"
                ]},
                {
                    "id": 15,
                    "question": "تسلية النبي صلى الله عليه وسلم ببيان عذاب الأمم المكذبة واستدراجهم بالنقم والنعم ",
                    "ayat":[ "٤٥-٤٢"
                ]},
                {
                    "id": 16,
                    "question": "التهديد بقدرة الله على سلبهم نعم الجوارح، وعلى إنزال العذاب بهم بغتة أو جهرة ",
                    "ayat":[ "٤٧-٤٦"
                ]},
                {
                    "id": 17,
                    "question": "بيان مهمة الرسل، وجزاء المؤمنين والمكذبين ",
                    "ayat":[ "٤٩-٤٨"
                ]},
                {
                    "id": 18,
                    "question": "تبليغ المشركين بعدم قدرة الرسول صلى الله عليه وسلم على مطالبهم المتعنتة ببيان حقيقة الرسالة لمن تكفر ",
                    "ayat":[ "٥٠"
                ]},
                {
                    "id": 19,
                    "question": "الأمر بإنذار المؤمنين خاصة، والتحذير من طردهم، وفتنة الناس بتفاوت عطاءات الله لهم ",
                    "ayat":[ "٥٣-٥١"
                ]},
                {
                    "id": 20,
                    "question": "توجيه النبي صلى الله عليه وسلم في معاملة المؤمنين التائبين، وتفصيل الآيات وبيان سبيل المجرمين ",
                    "ayat":[ "٥٥-٥٤"
                ]},
                {
                    "id": 21,
                    "question": "توجيه النبي صلى الله عليه سلم لإعلان براءته من اتباع المشركين، وبيان يقينه فيما كذبوا به، وتفويض الحكم والفصل لله تعالى، والرد على استعجالهم العذاب ",
                    "ayat":[ "٥٨-٥٦"
                ]},
                {
                    "id": 22,
                    "question": "الاحتجاج بالربوبية: العلم والقدرة والقهر والحفظ والوفاة والرد والحكم والحساب ",
                    "ayat":[ "٦٢-٥٩"
                ]},
                {
                    "id": 23,
                    "question": "الاحتجاج بالتجاء المشركين إلى الله في الكروب، وتهديدهم بقدرته على تسليط العذاب عليهم ",
                    "ayat":[ "٦٥-٦٣"
                ]},
                {
                    "id": 24,
                    "question": "تسلية النبي صلى الله عليه وسلم عن مسؤولية تكذيب قومه، وتهديدهم ",
                    "ayat":[ "٦٧-٦٦"
                ]},
                {
                    "id": 25,
                    "question": "تعليم النبي صلى الله عليه وسلم أحكام مجالسة الخائضين في القرآن، وكيفية التعامل معهم، وجزاؤهم ",
                    "ayat":[ "٧٠-٦٨"
                ]},
                {
                    "id": 26,
                    "question": "تلقين النبي صلى الله عليه وسلم مواجهة المشركين باستنكار الشرك، وتمثيل حال المرتد، وإعلان الاستسلام والعبودية لله، وذكر دلائل قدرته في الخلق، والملك يوم النفخ. ",
                    "ayat":[ "٧٣-٧١"
                ]},
                {
                    "id": 27,
                    "question": "إنكار إبراهيم عليه السلام على أبيه عبادة للأصنام ",
                    "ayat":[ "٧٤"
                ]},
                {
                    "id": 28,
                    "question": "نظر إبراهيم عليه السلام في ملكوت السماوات والأرض وتبرئه من الشرك ",
                    "ayat":[ "٧٩-٧٥"
                ]},
                {
                    "id": 29,
                    "question": "المحاجة بينه وبين قومه، وبيان فوز الموحدين بالأمن والهداية ",
                    "ayat":[ "٨٢-٨٠"
                ]},
                {
                    "id": 30,
                    "question": "تكريمه والإنعام عليه، والثناء على بعض الأنبياء وغيرهم، وبيان هداية الله لهم ونعمه عليهم والحث على الاقتداء بهم",
                    "ayat":[ "٩٠-٨٣"
                ]},
                {
                    "id": 31,
                    "question": "الأول من جهالاتهم: إنكار الوحي وتوبيخهم على ذلك، والاحتجاج عليهم بإنزال التوراة، وتوبيخ محرفيها، وتقرير إنزال القرآن، وبعض أوصافه، وغاياته، وأوصاف المؤمنين به ",
                    "ayat":[ "٩٢-٩١"
                ]},
                {
                    "id": 32,
                    "question": "تسلية: تقرير ظلم مدعي الوحي، وحال الظالمين عند الموت وتوبيخهم على شركهم ",
                    "ayat":[ "٩٤-٩٣"
                ]},
                {
                    "id": 33,
                    "question": "بيان دلائل الألوهية في الكون: إخراج النبات، والإحياء والإماتة، وفلق الصبح، والأجرام السماوية، والنفس والثمار ",
                    "ayat":[ "٩٩-٩٥"
                ]},
                {
                    "id": 34,
                    "question": "الثاني من جهالاتهم: عبادتهم للجن، والرد عليهم بتنزيه الله عن صور الشرك جميعها وبيان ألوهيته وربوبيته وعظمته ",
                    "ayat":[ "١٠٣-١٠٠"
                ]},
                {
                    "id": 35,
                    "question": "تسلية: في الوحي بصائر وبيان، وأمر النبي صلى الله عليه وسلم باتباعه، ونفوذ مشيئة الله، والنهي عن سب آلهة الكفار، وتزين الأعمال، وتأكيد المرجع لله تعالى. ",
                    "ayat":[ "١٠٨-١٠٤"
                ]},
                {
                    "id": 36,
                    "question": "الثالث من جهالاتهم: أيمانهم ووعودهم بالإيمان والرد عليها بمسلكي المنع والتسليم ",
                    "ayat":[ "١١١-١٠٩"
                ]},
                {
                    "id": 37,
                    "question": "تسلية: عداوة الشياطين للأنبياء سنة ماضية، والتوجيه بالإعراض عنهم، وتحكيم الله منزل الكتاب التام صدقا وعدلا ",
                    "ayat":[ "١١٥-١١٢"
                ]},
                {
                    "id": 38,
                    "question": "التحذير من طاعة الضالين، وإباحة الأكل من المذكى، ونفي المانع منه بعد تفصيل المحرمات، والتحذير من المضلين بالأهواء ",
                    "ayat":[ "١١٩-١١٦"
                ]},
                {
                    "id": 39,
                    "question": "التحذير من الإثم، وتحريم الأكل من غير المذكى، والتحذير من طاعة المشركين ",
                    "ayat":[ "١٢١-١٢٠"
                ]},
                {
                    "id": 40,
                    "question": "المفاضلة بين أهل الإيمان والنور وأهل الكفر والظلمات، وتزين الكفر والمكر للمجرمين، وعرض إحدى صور مكرهم وتوعدهم ",
                    "ayat":[ "١٢٣-١٢٢"
                ]},
                {
                    "id": 41,
                    "question": "بيان أسباب الهداية والضلال، وضرب مثل لضيق قلب الكافر، والتوعد لمن لم يؤمن، وبيان صراط الله وجزاء من لزمه ",
                    "ayat":[ "١٢٧-١٢٤"
                ]},
                {
                    "id": 42,
                    "question": "المواجهة يوم الحشر بتوبيخ الجن لإضلالهم الإنس، ورد الإنس، وبيان جزائهم، وقضاء الله في تولي الظالمين بعضهم وسؤال الجن والإنس عن إرسال الرسل إليهم، وشهادتهم على أنفسهم ",
                    "ayat":[ "١٣٠-١٢٨"
                ]},
                {
                    "id": 43,
                    "question": "سنة الله في إعذار القرى، وتفاضل درجات العاملين في الآخرة أكبر، وكمال غنى الله ورحمته، وبيان قدرته على إهلاكهم واستخلاف غيرهم، وتحقق وعده ",
                    "ayat":[ "١٣٤-١٣١"
                ]},
                {
                    "id": 44,
                    "question": "أمر الرسول صلى الله عليه وسلم بتوعد المشركين الظاملين وتهديدهم ",
                    "ayat":[ "١٣٥"
                ]},
                {
                    "id": 45,
                    "question": "تشريع الجاهلية في قسمة الحرث والأنعام بين الله جل جلاله وشركاؤهم، وتناقضهم، وسوء حكمهم فيه",
                    "ayat":[ "١٣٦"
                ]},
                {
                    "id": 46,
                    "question": "تشريع الجاهلية في وأد البنات، والرد على القدرية، وتوعد المفترين ",
                    "ayat":[ "١٣٧"
                ]},
                {
                    "id": 47,
                    "question": "تشريع الجاهلية في تقسيم الحرث والأنعام إلى ثلاثة أصناف، وتوعدهم على افترائهم ",
                    "ayat":[ "١٣٨"
                ]},
                {
                    "id": 48,
                    "question": "تشريع الجاهلية في قسمة أجنة الأنعام، وتوعدهم ",
                    "ayat":[ "١٣٩"
                ]},
                {
                    "id": 49,
                    "question": "تعقيب: بيان خسران وضلال المشركين في قتلهم أولادهم وتحريمهم ما أحل الله ",
                    "ayat":[ "١٤٠"
                ]},
                {
                    "id": 50,
                    "question": "التذكير بقدرة الله ونعمه في الزروع، وأداء حق الله فيه، والتحذير من الإسراف ",
                    "ayat":[ "١٤١"
                ]},
                {
                    "id": 51,
                    "question": "التذكير بقدرة الله ونعمه في الأنعام، والتحذير من خطوات الشيطان، ونقاش عقلي لإبطال ما حرمه المشركون من الأنعام، والحكم بكذبهم وظلمهم ",
                    "ayat":[ "١٤٤-١٤٢"
                ]},
                {
                    "id": 52,
                    "question": "إبطال ما حرمه المشركون ببيان ما حرم الله من المطعومات على المسلمين وعلى اليهود، وتذكير المكذبين برحمة الله وبأسه ",
                    "ayat":[ "١٤٧-١٤٥"
                ]},
                {
                    "id": 53,
                    "question": "الإعلام باحتجاج المشركين بالمشيئة والرد عليهم بالتوعد والمطالبة بالدليل، وبيان تخرصهم، وظهور حجة الله، ومطالبتهم بالشهود وتوجيهات للنبي صلى الله عليه وسلم تحذر منهم وتذمهم ",
                    "ayat":[ "١٥٠-١٤٨"
                ]},
                {
                    "id": 54,
                    "question": "دعوة المشركين إلى سماع أصول التشريعات الربانية \"الوصايا العشر\" ",
                    "ayat":[ "١٥٣-١٥١"
                ]},
                {
                    "id": 55,
                    "question": "الاحتجاج على المشركين بالتوراة وأوصافها، وبإنزال القرآن قطعا لأعذارهم عن الاتباع وتوعد الصادفين عنه ",
                    "ayat":[ "١٥٧-١٥٤"
                ]},
                {
                    "id": 56,
                    "question": "إنكارٌ وتهديدٌ لتأخر المشركين عن الإيمان والعمل مع قرب انقطاع فائدتهما بحلول الموت أو الساعة أو بعض أشراطها ",
                    "ayat":[ "١٥٨"
                ]},
                {
                    "id": 57,
                    "question": "البراءة من المتفرقين في دينهم وتوعدهم بعدالة الجزاء ",
                    "ayat":[ "١٦٠-١٥٩"
                ]},
                {
                    "id": 58,
                    "question": "الخاتمة: إعلان الرسول صلى الله عليه وسلم هداية الله له إلى ملة إبراهيم، وإخلاصه واستسلامه لله، واستنكار الشرك والتذكير بربوبية الله ونعمته في الاستخلاف والابتلاء والجزاء ",
                    "ayat":[ "١٦٥-١٦١"
                    ]
                }
            ]
        },
        {
            "sura":"الأعراف",
            "questions": [
                {
                    "id": 1,
                    "question": "المقدمة: تثبيت صدر النبي بإنزال الكتاب نذارة وذكرى ",
                    "ayat":[ " ٢-١"
                ]},
                {
                    "id": 2,
                    "question": "الأمر باتباع أمر الله والنهي عن موالاة غيره، والإنذار بهلاك القرى وبيان ندامتهم في الدنيا، وما يكون في الآخرة من السؤال والمواجهة والوزن للمفلحين والخاسرين ",
                    "ayat":[ " ٩-٣"
                ]},
                {
                    "id": 3,
                    "question": "التذكير بنعمة التمكين والعيش في الأرض، والخلق والتصوير والتكريم لآدم عليه السلام بأمر الملائكة بالسجود له، وامتناع إبليس وتعلله، ثم إهباطه وطلبه الإنظار، ثم قسمه على إغواء بني آدم، وإخراجه من الجنة ",
                    "ayat":[ "١٨-١٠"
                ]},
                {
                    "id": 4,
                    "question": "اسكان آدم وزوجه الجنة، والتحذير من الشجرة، ثم وسوسةٌ ومقاسمة، ثم معصيةٌ وعقوبةٌ، وعتابٌ وتوبةٌ، وإهباطٌ حتى البعث ",
                    "ayat":[ "٢٥-١٩"
                ]},
                {
                    "id": 5,
                    "question": "التوجيه الأول: التذكير بنعمة الستر واللباس ",
                    "ayat":[ "٢٦"
                ]},
                {
                    "id": 6,
                    "question": "التوجيه الثاني: التحذير من فتنة الشيطان وولايته، وضرب من فعال وأقوال أوليائه، والرد عليهم ",
                    "ayat":[ "٣٠-٢٧"
                ]},
                {
                    "id": 7,
                    "question": "التوجيه الثالث: الحث على التزين للصلاة، والأكل والشرب بغير إسراف، والرد على من حرم الزينة والطيبات، وتفصيل المحرمات، وتذكير الأمم بحلول الآجال ",
                    "ayat":[ "٣٤-٣١"
                ]},
                {
                    "id": 8,
                    "question": "التوجيه الرابع: الحث على اتباع الرسل، وبيان جزاء أتباعهم وعقوبة المكذبين المستكبرين ",
                    "ayat":[ "٣٦-٣٥"
                ]},
                {
                    "id": 9,
                    "question": "أولا: عقوبة مفتري الكذب في الدنيا، وعند الاحتضار، وتلاعن الأمم الكافرة، والحكم باستحالة دخولهم الجنة، وما أُعد لهم في النار من مهاد وغطاء ",
                    "ayat":[ "٤١-٣٧"
                ]},
                {
                    "id": 10,
                    "question": "ثانيا: جزاء المؤمنين العاملين، ونزع الغل منهم، وإدخالهم الجنة، وحمدهم الله على هدايته لهم وتحقق وعد الرسل، ونداء التهنئة لهم ",
                    "ayat":[ "٤٣-٤٢"
                ]},
                {
                    "id": 11,
                    "question": "ثالثا: نداء أصحاب الجنة لأصحاب النار وردهم عليهم، والأذان بينهم باللعنة على الظالمين ",
                    "ayat":[ "٤٥-٤٤"
                ]},
                {
                    "id": 12,
                    "question": "رابعا: أصحاب الأعراف ينادون أصحاب الجنة مسلمين عليهم، ويستعيذون من النار ثم ينادون أصحاب النار موبخين لهم ",
                    "ayat":[ "٤٩-٤٦"
                ]},
                {
                    "id": 13,
                    "question": "خامسا: نداء أصحاب النار لأصحاب الجنة وردهم عليهم ",
                    "ayat":[ "٥١-٥٠"
                ]},
                {
                    "id": 14,
                    "question": "بيان تفصيل الكتاب، والعجب لتأخر الكفار عن الإيمان، وندامتهم في الآخرة، وخسرانهم بافترائهم ",
                    "ayat":[ "٥٣-٥٢"
                ]},
                {
                    "id": 15,
                    "question": "بيان ربوبية الله، ودلائلها في الكون خلقًا وأمرًا، وما يستلزمها من الدعاء وترك الإفساد ",
                    "ayat":[ "٥٦-٥٤"
                ]},
                {
                    "id": 16,
                    "question": "إرسال الرياح، وإنزال الماء من دلائل قدرة الله على البعث، وبيان التفاوت بين ثمرة البلد الطيب والخبيث ",
                    "ayat":[ "٥٨-٥٧"
                ]},
                {
                    "id": 17,
                    "question": "نوح عليه السلام \"أمرٌ بالعبادة وإنذارٌ من العذاب، واتهامٌ له بالضلالة ورده عليهم، ثم تكذيبهم ونجاة المؤمنين وغرق المكذبين العمين\" ",
                    "ayat":[ "٦٤-٥٩"
                ]},
                {
                    "id": 18,
                    "question": "هود عليه السلام \"أمرٌ بالعبادة والتقوى، واتهامٌ له بالسفاهة ورده عليهم، وتذكيرهم بنعمة الاستخلاف والبسطة في الخلق، وتمسكهم بدين الآباء، وتوعدهم، ثم نجاة المؤمنين وقطع دابر المكذبين\" ",
                    "ayat":[ "٧٢-٦٥"
                ]},
                {
                    "id": 19,
                    "question": "صالح عليه السلام \"أمر بالعبادة، وتذكير بآية الله، ونعمتي الاستخلاف وتبوأ الأرض، والحوار بين مستكبري قومه ومستضعفيهم، ثم عقر الناقة، ثم الرجفة وكلمة الوداع\" ",
                    "ayat":[ "٧٩-٧٣"
                ]},
                {
                    "id": 20,
                    "question": "لوط عليه السلام \"إنكار فاحشتهم في الرجال، وردهم، ثم نجاة المؤمنين، وإمطار المجرمين\" ",
                    "ayat":[ "٨٤-٨٠"
                ]},
                {
                    "id": 21,
                    "question": "شعيب عليه السلام \"أمرٌ بالعبادة، تذكير بالبينة من الله، وأمرٌ بتوفية الكيل والميزان، ونهيٌ عن الإفساد والصد، وتذكير بنعمة التكثير وبعاقبة المفسدين وضرورة الصبر، وتخير القوم له بين الإخراج أو العودة إلى ملة الكفر والرد عليهم، ثم الرجفة وكلمة الوداع\" ",
                    "ayat":[ "٩٣-٨٥"
                ]},
                {
                    "id": 22,
                    "question": "سنة الله في القرى المكذبة؛ ابتلاءٌ بالشدة ثم التبديل إلى النعم، ثم الأخذ بغتة ",
                    "ayat":[ "٩٥-٩٤"
                ]},
                {
                    "id": 23,
                    "question": "حرمان أهل القرى من البركات بسبب كفرهم وتكذيبهم ",
                    "ayat":[ "٩٦"
                ]},
                {
                    "id": 24,
                    "question": "تخويف أهل القرى من الأمن من بأس الله ومكره، وتقرير خسرانهم بذلك ",
                    "ayat":[ "٩٩-٩٧"
                ]},
                {
                    "id": 25,
                    "question": "العجب من عدم اعتبار المتوارثون للأرض بما أصاب من قبلهم بسبب ذنوبهم، وتهديدهم بنظيره ",
                    "ayat":[ "١٠٠"
                ]},
                {
                    "id": 26,
                    "question": "الغاية من قصص القرى تثبيت النبي ﷺ، وإقامة الحجة على الكفار، وبيان سبب كفرهم ",
                    "ayat":[ "١٠٢-١٠١"
                ]},
                {
                    "id": 27,
                    "question": "بعثته إلى فرعون وملته، والحوار بينهما واستعراض آيتي العصا واليد ",
                    "ayat":[ "١٠٨-١٠٣"
                ]},
                {
                    "id": 28,
                    "question": "اتهامات الملأ لموسى عليه السلام، وحشر السحرة واشتراطهم الأجر والموافقة عليه ",
                    "ayat":[ "١١٤-١٠٩"
                ]},
                {
                    "id": 29,
                    "question": "طلب السحرة من موسى عليه السلام الإلقاء، وتقديمه لهم واسترهابهم للناس بسحرهم ",
                    "ayat":[ "١١٦-١١٥"
                ]},
                {
                    "id": 30,
                    "question": "الوحي لموسى بإلقاء العصا، وإبطال سحرهم وخسارتهم وذلهم ",
                    "ayat":[ "١١٩-١١٧"
                ]},
                {
                    "id": 31,
                    "question": "سجود السحرة وإيمانهم واتهامات فرعون لهم وتوعدهم، وثبات السحرة وردهم ودعائهم ",
                    "ayat":[ "١٢٦-١٢٠"
                ]},
                {
                    "id": 32,
                    "question": "تحريض الملأ لفرعون على موسى عليه السلام وقومه ",
                    "ayat":[ "١٢٧"
                ]},
                {
                    "id": 33,
                    "question": "موعظة موسى عليه السلام وتصبيره لقومه وضجرهم، ووعدهم بهلاك عدوهم واستخلافهم ",
                    "ayat":[ "١٢٩-١٢٨"
                ]},
                {
                    "id": 34,
                    "question": "ابتلاء قوم فرعون وموقفهم من ذلك، ثم إرسال الآيات المفصلات وطلبهم من موسى الدعاء لهم مقابل الوعد بالإيمان وإرسال بني إسرائيل ثم نكثهم للعهد انتقام الله منهم وإغراقهم بسبب تكذيبهم وغفلتهم ",
                    "ayat":[ "١٣٦-١٣٠"
                ]},
                {
                    "id": 35,
                    "question": "وراثة بني إسرائيل الأرض بعد دمار مصنوعات فرعون وقومه",
                    "ayat":[ "١٣٧"
                ]},
                {
                    "id": 36,
                    "question": "مجاوزة بني إسرائيل البحر، وطلبهم إلها صنما ورد موسى عليه السلام عليهم بثالث ردود ",
                    "ayat":[ "١٤١-١٣٨"
                ]},
                {
                    "id": 37,
                    "question": "ميقات الأربعين ليلة واستخلاف موسى لهارون ووصيته ",
                    "ayat":[ "١٤٢"
                ]},
                {
                    "id": 38,
                    "question": "التكليم في الميقات وطلب الرؤية والصعق والتوبة ",
                    "ayat":[ "١٤٣"
                ]},
                {
                    "id": 39,
                    "question": "خطاب الاصطفاء لموسى وجملة من الأوامر له ولقومه وتوعد للمخالفين ",
                    "ayat":[ "١٤٧-١٤٤"
                ]},
                {
                    "id": 40,
                    "question": "اتخاذ بني إسرائيل للعجل وندامتهم واستغفارهم ",
                    "ayat":[ "١٤٩-١٤٨"
                ]},
                {
                    "id": 41,
                    "question": "رجوع موسى وغضبه وتوبيخه لقومه وأخذه برأس هارون، وتبرير هارون لموقفه",
                    "ayat":[ "١٥٠"
                ]},
                {
                    "id": 42,
                    "question": "طلب موسى المغفرة من الله له ولأخيه وبيان غضب الله على عباد العجل وجزاؤهم، ومغفرته للتائبين منهم، وسكون الغضب وتناول الألواح ",
                    "ayat":[ "١٥٤-١٥١"
                ]},
                {
                    "id": 43,
                    "question": "ميقات السبعين رجل للتوبة والاستغفار، وعقابهم بالرجفة وتضرع موسى لربه ورد الله عليه ببيان أوصاف المستحقين للرحمة، وأوصاف النبي الأمي الذي أمروا باتباعه ",
                    "ayat":[ "١٥٧-١٥٥"
                ]},
                {
                    "id": 44,
                    "question": "أمر النبي ﷺ بإعلان رسالته للجميع ودعوتهم للإيمان والاتباع طلبا للهداية والثناء على أمة من قوم موسى مهتدون ",
                    "ayat":[ "١٥٩-١٥٨"
                ]},
                {
                    "id": 45,
                    "question": "تقطيعهم أسباطا، وبعض نعم الله عليهم في التيه \"الاستسقاء وتظليل الغمام وإنزال المن والسلوى\" ",
                    "ayat":[ "١٦٠"
                ]},
                {
                    "id": 46,
                    "question": "أولا: موقف الظالمين من الأمر بسكنى القرية، والأكل منها ودخولها ساجدين مستغفرين، وجزاؤهم ",
                    "ayat":[ "١٦٢-١٦١"
                ]},
                {
                    "id": 47,
                    "question": "ثانيا: تذكيرهم بالقرية التي اعتدت في السبت، وابتلاؤهم بفسقهم، وانقسامهم إلى فرقة عاصية وأخرى ناهية وثالثة ساكتة، وعذاب الله للعاصية ونجاة الناهية، ثم مسخ العاتين قردة خاسئين ",
                    "ayat":[ "١٦٦-١٦٣"
                ]},
                {
                    "id": 48,
                    "question": "ثالثا: إعلام الله لبني إسرائيل بتسليط الناس عليهم بالعذاب إلى يوم القيامة، وتحقق وعده بتقطيعهم في الأرض صالحهم وطالحهم، وابتلاؤهم بالنعم والنقم ",
                    "ayat":[ "١٦٨-١٦٧"
                ]},
                {
                    "id": 49,
                    "question": "رابعا: أوصاف الجيل الوارث للتوراة وانقسامهم إلى فريق حريص على متاع الدنيا متكل على المغفرة وتوبيخهم على ذلك وعلى مخالفتهم للميثاق، وفريق ممسك بالكتاب مأجور على الإصلاح ",
                    "ayat":[ "١٧٠-١٦٩"
                ]},
                {
                    "id": 50,
                    "question": "خامسا: نتق الجبل فوقهم لكي يأخذوا بأحكام التوراة ",
                    "ayat":[ "١٧١"
                ]},
                {
                    "id": 51,
                    "question": "التذكير بميثاق بني آدم وشهادتهم بربوبية الله، وبيان أسباب هذا الميثاق، وتفصيل الآيات حثا على الرجوع إلى الفطرة ",
                    "ayat":[ "١٧٤-١٧٢"
                ]},
                {
                    "id": 52,
                    "question": "نبأ رجل انسلخ من آيات الله واتبع الشيطان وأخلد إلى الأرض واتبع هواه وضرب مثل له بالكلب اللاهث، وتقبيح مثل الذين كذبوا وظلموا أنفسهم ",
                    "ayat":[ "١٧٧-١٧٥"
                ]},
                {
                    "id": 53,
                    "question": "التعقيب بأن المهتدي من هداه الله والضالون خاسرون وصفات من خلقهم الله لجهنم والحكم بضلالهم وغفلتهم ",
                    "ayat":[ "١٧٩-١٧٨"
                ]},
                {
                    "id": 54,
                    "question": "إثبات الأسماء الحسنى لله ودعاؤه بها والإعراض عن الملحدين فيها، والثناء على أمة الهداية والعدل، ووعيد المكذبين والإملاء لهم كيدا بهم ",
                    "ayat":[ "١٨٢-١٨٠"
                ]},
                {
                    "id": 55,
                    "question": "التعجب من ترك التفكر في حقيقة الرسول ﷺ، وترك النظر في ملك الله وخلقه، واقتراب آجالهم، وعدم إيمانهم بالقرآن وبيان سببه وهو أن الضالون لا هادي لهم بل لا يزالون حيارى ",
                    "ayat":[ "١٨٦-١٨٣"
                ]},
                {
                    "id": 56,
                    "question": "سؤالهم عن الساعة، والرد ببيان أوصافها، واستنكار سؤالهم وبيان جهل أكثرهم، وتبرؤ النبي ﷺ من الملك والتصرف وإبطال التلازم بين الرسالة وعلم الغيب ",
                    "ayat":[ "١٨٨-١٨٧"
                ]},
                {
                    "id": 57,
                    "question": "بذكر الخلق والتزويج والتناسل والتجاء العباد إلى ربهم في مصالحهم ثم إشراكهم بعد ذلك ",
                    "ayat":[ "١٩٠-١٨٩"
                ]},
                {
                    "id": 58,
                    "question": "ابطال الشرك عقلا؛ بيان عجز الشركاء عن الخلق، والنصر، واتباع الهدى، وبيان عبوديتهم وتحدي قدرتهم على الاستجابة، وبيان فقدانهم لآلاتها، وتحدي كيدها بالرسول ﷺ وإعلانه ولاية الله للصالحين، وعجز المعبودات عن النصر ونفي سمعهم وأبصارهم ",
                    "ayat":[ "١٩٨-١٩١"
                ]},
                {
                    "id": 59,
                    "question": "الخاتمة: توجيهات للنبي ﷺ إلى مكارم الأخلاق، واتباع الوحي وبيان وصفه والأدب عند قراءته، والحث على ذكر الله والحذر من الغفلة تأسيا بالملائكة المسبحين الساجدين ",
                    "ayat":[ "٢٠٦-١٩٩"
                    ]
                }
            ]
        },
        {
            "sura":"الأنفال",
            "questions":[
                {
                    "id": 1,
                    "question": "المقدمة:  جواب السائلين عن الأنفال، وثلاث توجيهات لهم، وبيان أوصاف المؤمنين حقَا وجزاؤهم ",
                    "ayat":[ "يَسْأَلُونَكَ عَنِ الأَنفَالِ قُلِ الأَنفَالُ لِلَّهِ وَالرَّسُولِ فَاتَّقُواْ اللَّهَ وَأَصْلِحُواْ ذَاتَ بَيْنِكُمْ وَأَطِيعُواْ اللَّهَ وَرَسُولَهُ إِن كُنتُم مُّؤْمِنِينَ ١ إِنَّمَا الْمُؤْمِنُونَ الَّذِينَ إِذَا ذُكِرَ اللَّهُ وَجِلَتْ قُلُوبُهُمْ وَإِذَا تُلِيَتْ عَلَيْهِمْ آيَاتُهُ زَادَتْهُمْ إِيمَانًا وَعَلَى رَبِّهِمْ يَتَوَكَّلُونَ ٢ الَّذِينَ يُقِيمُونَ الصَّلاةَ وَمِمَّا رَزَقْنَاهُمْ يُنفِقُونَ ٣ أُوْلَئِكَ هُمُ الْمُؤْمِنُونَ حَقًّا لَّهُمْ دَرَجَاتٌ عِندَ رَبِّهِمْ وَمَغْفِرَةٌ وَرِزْقٌ كَرِيمٌ ٤"
                ]},
                {
                    "id": 2,
                    "question": "الإخراج لغزوة بدر مع كراهة بعض المؤمنين ومجادلتهم وخوفهم،  ووعدهم بالنصر، ورغبتهم في العير، والحكمة فيما أراده الله ",
                    "ayat":[ "كَمَا أَخْرَجَكَ رَبُّكَ مِن بَيْتِكَ بِالْحَقِّ وَإِنَّ فَرِيقًا مِّنَ الْمُؤْمِنِينَ لَكَارِهُونَ ٥ يُجَادِلُونَكَ فِي الْحَقِّ بَعْدَمَا تَبَيَّنَ كَأَنَّمَا يُسَاقُونَ إِلَى الْمَوْتِ وَهُمْ يَنظُرُونَ ٦ وَإِذْ يَعِدُكُمُ اللَّهُ إِحْدَى الطَّائِفَتَيْنِ أَنَّهَا لَكُمْ وَتَوَدُّونَ أَنَّ غَيْرَ ذَاتِ الشَّوْكَةِ تَكُونُ لَكُمْ وَيُرِيدُ اللَّهُ أَن يُحِقَّ الْحَقَّ بِكَلِمَاتِهِ وَيَقْطَعَ دَابِرَ الْكَافِرِينَ ٧ لِيُحِقَّ الْحَقَّ وَيُبْطِلَ الْبَاطِلَ وَلَوْ كَرِهَ الْمُجْرِمُونَ ٨"
                ]},
                {
                    "id": 3,
                    "question": "الاستغاثة، الاستجابة بالإمداد بالملائكة، والحكمة منه",
                    "ayat":[ "إِذْ تَسْتَغِيثُونَ رَبَّكُمْ فَاسْتَجَابَ لَكُمْ أَنِّي مُمِدُّكُم بِأَلْفٍ مِّنَ الْمَلائِكَةِ مُرْدِفِينَ ٩ وَمَا جَعَلَهُ اللَّهُ إِلاَّ بُشْرَى وَلِتَطْمَئِنَّ بِهِ قُلُوبُكُمْ وَمَا النَّصْرُ إِلاَّ مِنْ عِندِ اللَّهِ إِنَّ اللَّهَ عَزِيزٌ حَكِيمٌ ١٠"
                ]},
                {
                    "id": 4,
                    "question": "غشيان النعاس ونزول المطر وبيان الحكمو منهما",
                    "ayat":[ "إِذْ يُغَشِّيكُمُ النُّعَاسَ أَمَنَةً مِّنْهُ وَيُنَزِّلُ عَلَيْكُم مِّن السَّمَاء مَاء لِّيُطَهِّرَكُم بِهِ وَيُذْهِبَ عَنكُمْ رِجْزَ الشَّيْطَانِ وَلِيَرْبِطَ عَلَى قُلُوبِكُمْ وَيُثَبِّتَ بِهِ الأَقْدَامَ ١١"
                ]},
                {
                    "id": 5,
                    "question": "تثبيت الملائكة للمؤمنين، وإلقاء الرعب في قلوب الكفار، وأمر المؤمنين بالإقدام في قتالهم وبيان سببه",
                    "ayat":[ "إِذْ يُوحِي رَبُّكَ إِلَى الْمَلائِكَةِ أَنِّي مَعَكُمْ فَثَبِّتُواْ الَّذِينَ آمَنُواْ سَأُلْقِي فِي قُلُوبِ الَّذِينَ كَفَرُواْ الرُّعْبَ فَاضْرِبُواْ فَوْقَ الأَعْنَاقِ وَاضْرِبُواْ مِنْهُمْ كُلَّ بَنَانٍ ١٢ ذَلِكَ بِأَنَّهُمْ شَاقُّواْ اللَّهَ وَرَسُولَهُ وَمَن يُشَاقِقِ اللَّهَ وَرَسُولَهُ فَإِنَّ اللَّهَ شَدِيدُ الْعِقَابِ ١٣ ذَلِكُمْ فَذُوقُوهُ وَأَنَّ لِلْكَافِرِينَ عَذَابَ النَّارِ ١٤"
                ]},
                {
                    "id": 6,
                    "question": "تحذيرٌ وتذكيرٌ ووعيدٌ، تحذير من التولي يوم الزحف، لغير المحترف أو المتحيز، وبيان جزاؤه، وتذكير بمعية الله تقويةً للحق وتوهينَا للباطل، ووعيد الكفار إن استفتحوا أو انتهوا عن الكفر أو عادوا للقتال ",
                    "ayat":[ "يَا أَيُّهَا الَّذِينَ آمَنُواْ إِذَا لَقِيتُمُ الَّذِينَ كَفَرُواْ زَحْفاً فَلاَ تُوَلُّوهُمُ الأَدْبَارَ ١٥ وَمَن يُوَلِّهِمْ يَوْمَئِذٍ دُبُرَهُ إِلاَّ مُتَحَرِّفاً لِّقِتَالٍ أَوْ مُتَحَيِّزاً إِلَى فِئَةٍ فَقَدْ بَاء بِغَضَبٍ مِّنَ اللَّهِ وَمَأْوَاهُ جَهَنَّمُ وَبِئْسَ الْمَصِيرُ ١٦ فَلَمْ تَقْتُلُوهُمْ وَلَكِنَّ اللَّهَ قَتَلَهُمْ وَمَا رَمَيْتَ إِذْ رَمَيْتَ وَلَكِنَّ اللَّهَ رَمَى وَلِيُبْلِيَ الْمُؤْمِنِينَ مِنْهُ بَلاء حَسَنًا إِنَّ اللَّهَ سَمِيعٌ عَلِيمٌ ١٧ ذَلِكُمْ وَأَنَّ اللَّهَ مُوهِنُ كَيْدِ الْكَافِرِينَ ١٨ إِن تَسْتَفْتِحُواْ فَقَدْ جَاءَكُمُ الْفَتْحُ وَإِن تَنتَهُواْ فَهُوَ خَيْرٌ لَّكُمْ وَإِن تَعُودُواْ نَعُدْ وَلَن تُغْنِيَ عَنكُمْ فِئَتُكُمْ شَيْئًا وَلَوْ كَثُرَتْ وَأَنَّ اللَّهَ مَعَ الْمُؤْمِنِينَ ١٩"
                ]},
                {
                    "id": 7,
                    "question": "أمر المؤمنين بطاعة الله ورسوله، والتحذير من التولي عنه ومشابهة المنافقين، وبيان شر الدواب عند الله، والحكمة من صممهم ",
                    "ayat":[ "يَا أَيُّهَا الَّذِينَ آمَنُواْ أَطِيعُواْ اللَّهَ وَرَسُولَهُ وَلاَ تَوَلَّوْا عَنْهُ وَأَنتُمْ تَسْمَعُونَ ٢٠ وَلاَ تَكُونُواْ كَالَّذِينَ قَالُوا سَمِعْنَا وَهُمْ لاَ يَسْمَعُونَ ٢١ إِنَّ شَرَّ الدَّوَابِّ عِندَ اللَّهِ الصُّمُّ الْبُكْمُ الَّذِينَ لاَ يَعْقِلُونَ ٢٢ وَلَوْ عَلِمَ اللَّهُ فِيهِمْ خَيْرًا لَّأَسْمَعَهُمْ وَلَوْ أَسْمَعَهُمْ لَتَوَلَّوْا وَّهُم مُّعْرِضُونَ ٢٣"
                ]},
                {
                    "id": 8,
                    "question": "أمرٌ وتهديدٌ وتذكيرٌ للمؤمنين، الأمر بالاستجابة لله والرسول، والتهديد بحول الله بين المرء وقلبه، وبفتنة الناس عامة، والتذكير بنعمة الإيواء والنصر والرزق ",
                    "ayat":[ "يَا أَيُّهَا الَّذِينَ آمَنُواْ اسْتَجِيبُواْ لِلَّهِ وَلِلرَّسُولِ إِذَا دَعَاكُم لِمَا يُحْيِيكُمْ وَاعْلَمُواْ أَنَّ اللَّهَ يَحُولُ بَيْنَ الْمَرْءِ وَقَلْبِهِ وَأَنَّهُ إِلَيْهِ تُحْشَرُونَ ٢٤ وَاتَّقُواْ فِتْنَةً لاَّ تُصِيبَنَّ الَّذِينَ ظَلَمُواْ مِنكُمْ خَاصَّةً وَاعْلَمُواْ أَنَّ اللَّهَ شَدِيدُ الْعِقَابِ ٢٥ وَاذْكُرُواْ إِذْ أَنتُمْ قَلِيلٌ مُّسْتَضْعَفُونَ فِي الأَرْضِ تَخَافُونَ أَن يَتَخَطَّفَكُمُ النَّاسُ فَآوَاكُمْ وَأَيَّدَكُم بِنَصْرِهِ وَرَزَقَكُم مِّنَ الطَّيِّبَاتِ لَعَلَّكُمْ تَشْكُرُونَ ٢٦"
                ]},
                {
                    "id": 9,
                    "question": "نهي المؤمنين عن خيانة الله ورسوله والأمانات، والتحذير من الافتتان بالأموال والأولاد ",
                    "ayat":[ "يَا أَيُّهَا الَّذِينَ آمَنُواْ لاَ تَخُونُواْ اللَّهَ وَالرَّسُولَ وَتَخُونُواْ أَمَانَاتِكُمْ وَأَنتُمْ تَعْلَمُونَ ٢٧ وَاعْلَمُواْ أَنَّمَا أَمْوَالُكُمْ وَأَوْلادُكُمْ فِتْنَةٌ وَأَنَّ اللَّهَ عِندَهُ أَجْرٌ عَظِيمٌ ٢٨"
                ]},
                {
                    "id": 10,
                    "question": "ترغيب المؤمنين بالتقوى ببيان ثممراتها",
                    "ayat":[ "٢٩ يَا أَيُّهَا الَّذِينَ آمَنُواْ إِن تَتَّقُواْ اللَّهَ يَجْعَل لَّكُمْ فُرْقَاناً وَيُكَفِّرْ عَنكُمْ سَيِّئَاتِكُمْ وَيَغْفِرْ لَكُمْ وَاللَّهُ ذُو الْفَضْلِ الْعَظِيم"
                ]},
                {
                    "id": 11,
                    "question": "مكر المشركين بالرسول ﷺ، ومكر الله بهم",
                    "ayat":[ "وَإِذْ يَمْكُرُ بِكَ الَّذِينَ كَفَرُواْ لِيُثْبِتُوكَ أَوْ يَقْتُلُوكَ أَوْ يُخْرِجُوكَ وَيَمْكُرُونَ وَيَمْكُرُ اللَّهُ وَاللَّهُ خَيْرُ الْمَاكِرِينَ ٣٠"
                ]},
                {
                    "id": 12,
                    "question": "موقفهم من سماع القرآن",
                    "ayat":[ "وَإِذَا تُتْلَى عَلَيْهِمْ آيَاتُنَا قَالُواْ قَدْ سَمِعْنَا لَوْ نَشَاء لَقُلْنَا مِثْلَ هَذَا إِنْ هَذَا إِلاَّ أَسَاطِيرُ الأَوَّلِينَ ٣١"
                ]},
                {
                    "id": 13,
                    "question": "استمطارهم السماء بالعذاب، وبيان سبب تأخيره عنهم، ولزومه لصدهم عن المسجد الحرام ",
                    "ayat":[ "وَإِذْ قَالُواْ اللَّهُمَّ إِن كَانَ هَذَا هُوَ الْحَقَّ مِنْ عِندِكَ فَأَمْطِرْ عَلَيْنَا حِجَارَةً مِّنَ السَّمَاء أَوِ ائْتِنَا بِعَذَابٍ أَلِيمٍ ٣٢ وَمَا كَانَ اللَّهُ لِيُعَذِّبَهُمْ وَأَنتَ فِيهِمْ وَمَا كَانَ اللَّهُ مُعَذِّبَهُمْ وَهُمْ يَسْتَغْفِرُونَ ٣٣ وَمَا لَهُمْ أَلاَّ يُعَذِّبَهُمُ اللَّهُ وَهُمْ يَصُدُّونَ عَنِ الْمَسْجِدِ الْحَرَامِ وَمَا كَانُواْ أَوْلِيَاءهُ إِنْ أَوْلِيَاؤُهُ إِلاَّ الْمُتَّقُونَ وَلَكِنَّ أَكْثَرَهُمْ لاَ يَعْلَمُونَ ٣٤"
                ]},
                {
                    "id": 14,
                    "question": "إبطال صلاة المكاء والتصدية منهم عند البيت ",
                    "ayat":[ "وَمَا كَانَ صَلاتُهُمْ عِندَ الْبَيْتِ إِلاَّ مُكَاءً وَتَصْدِيَةً فَذُوقُواْ الْعَذَابَ بِمَا كُنتُمْ تَكْفُرُونَ ٣٥"
                ]},
                {
                    "id": 15,
                    "question": "إنفاقهم الأموال للصد عن سبيل الله وبيان عاقبتهم، وجزاؤهم، والحكمة منه ",
                    "ayat":[ "إِنَّ الَّذِينَ كَفَرُواْ يُنفِقُونَ أَمْوَالَهُمْ لِيَصُدُّواْ عَن سَبِيلِ اللَّهِ فَسَيُنفِقُونَهَا ثُمَّ تَكُونُ عَلَيْهِمْ حَسْرَةً ثُمَّ يُغْلَبُونَ وَالَّذِينَ كَفَرُواْ إِلَى جَهَنَّمَ يُحْشَرُونَ ٣٦ لِيَمِيزَ اللَّهُ الْخَبِيثَ مِنَ الطَّيِّبِ وَيَجْعَلَ الْخَبِيثَ بَعْضَهُ عَلَىَ بَعْضٍ فَيَرْكُمَهُ جَمِيعًا فَيَجْعَلَهُ فِي جَهَنَّمَ أُوْلَئِكَ هُمُ الْخَاسِرُونَ ٣٧"
                ]},
                {
                    "id": 16,
                    "question": "ترغيب الكفار بمغفرة ما سلف بإسلامهم، وتوعد المصرين بسنة الله فيهم ",
                    "ayat":[ "قُل لِلَّذِينَ كَفَرُواْ إِن يَنتَهُواْ يُغْفَرْ لَهُم مَّا قَدْ سَلَفَ وَإِنْ يَعُودُواْ فَقَدْ مَضَتْ سُنَّةُ الأَوَّلِينَ ٣٨"
                ]},
                {
                    "id": 17,
                    "question": " الأمر بقتال الكفار والحكمة منه، وإعلام المؤمنين بولاية الله ونصرهم لهم",
                    "ayat":[ "وَقَاتِلُوهُمْ حَتَّى لاَ تَكُونَ فِتْنَةٌ وَيَكُونَ الدِّينُ كُلُّهُ لِلَّه فَإِنِ انتَهَوْا فَإِنَّ اللَّهَ بِمَا يَعْمَلُونَ بَصِيرٌ ٣٩ وَإِن تَوَلَّوْا فَاعْلَمُواْ أَنَّ اللَّهَ مَوْلاكُمْ نِعْمَ الْمَوْلَى وَنِعْمَ النَّصِيرُ ٤٠"
                ]},
                {
                    "id": 18,
                    "question": "إعلام المؤمنين بكيفية قسمة الغنائم، وأن انفاذها  برهان الإيمان بالله وآياته يوم بدر ",
                    "ayat":[ "وَاعْلَمُواْ أَنَّمَا غَنِمْتُم مِّن شَيْءٍ فَأَنَّ لِلَّهِ خُمُسَهُ وَلِلرَّسُولِ وَلِذِي الْقُرْبَى وَالْيَتَامَى وَالْمَسَاكِينِ وَابْنِ السَّبِيلِ إِن كُنتُمْ آمَنتُمْ بِاللَّهِ وَمَا أَنزَلْنَا عَلَى عَبْدِنَا يَوْمَ الْفُرْقَانِ يَوْمَ الْتَقَى الْجَمْعَانِ وَاللَّهُ عَلَى كُلِّ شَيْءٍ قَدِيرٌ ٤١"
                ]},
                {
                    "id": 19,
                    "question": "بيان أماكن الفريقين يوم بدر، وحكمة الله في التقائهم ",
                    "ayat":[ "إِذْ أَنتُم بِالْعُدْوَةِ الدُّنْيَا وَهُم بِالْعُدْوَةِ الْقُصْوَى وَالرَّكْبُ أَسْفَلَ مِنكُمْ وَلَوْ تَوَاعَدتُّمْ لاَخْتَلَفْتُمْ فِي الْمِيعَادِ وَلَكِن لِّيَقْضِيَ اللَّهُ أَمْرًا كَانَ مَفْعُولاً لِّيَهْلِكَ مَنْ هَلَكَ عَن بَيِّنَةٍ وَيَحْيَى مَنْ حَيَّ عَن بَيِّنَةٍ وَإِنَّ اللَّهَ لَسَمِيعٌ عَلِيمٌ ٤٢"
                ]},
                {
                    "id": 20,
                    "question": "تقليل المشركين في رؤيا المنام، دفعا للفشل والتنازع ",
                    "ayat":[ "إِذْ يُرِيكَهُمُ اللَّهُ فِي مَنَامِكَ قَلِيلاً وَلَوْ أَرَاكَهُمْ كَثِيرًا لَّفَشِلْتُمْ وَلَتَنَازَعْتُمْ فِي الأَمْرِ وَلَكِنَّ اللَّهَ سَلَّمَ إِنَّهُ عَلِيمٌ بِذَاتِ الصُّدُورِ ٤٣"
                ]},
                {
                    "id": 21,
                    "question": "تقليل كل فريق في عين الآخر في رؤيا اللقاء، والحكمة منه ",
                    "ayat":[ "وَإِذْ يُرِيكُمُوهُمْ إِذِ الْتَقَيْتُمْ فِي أَعْيُنِكُمْ قَلِيلاً وَيُقَلِّلُكُمْ فِي أَعْيُنِهِمْ لِيَقْضِيَ اللَّهُ أَمْرًا كَانَ مَفْعُولاً وَإِلَى اللَّهِ تُرْجَعُ الأُمُورُ ٤٤"
                ]},
                {
                    "id": 22,
                    "question": "الثبات وذكر الله كثيرا، وطاعة الله ورسوله، وترك التنازع والتزام الصبر ",
                    "ayat":[ "يَا أَيُّهَا الَّذِينَ آمَنُواْ إِذَا لَقِيتُمْ فِئَةً فَاثْبُتُواْ وَاذْكُرُواْ اللَّهَ كَثِيرًا لَّعَلَّكُمْ تُفْلِحُونَ ٤٥ وَأَطِيعُواْ اللَّهَ وَرَسُولَهُ وَلاَ تَنَازَعُواْ فَتَفْشَلُواْ وَتَذْهَبَ رِيحُكُمْ وَاصْبِرُواْ إِنَّ اللَّهَ مَعَ الصَّابِرِينَ ٤٦"
                ]},
                {
                    "id": 23,
                    "question": "التحذير من مشابهة الكفار في الخروج بطرا ورياء ",
                    "ayat":[ "وَلاَ تَكُونُواْ كَالَّذِينَ خَرَجُواْ مِن دِيَارِهِم بَطَرًا وَرِئَاء النَّاسِ وَيَصُدُّونَ عَن سَبِيلِ اللَّهِ وَاللَّهُ بِمَا يَعْمَلُونَ مُحِيطٌ ٤٧"
                ]},
                {
                    "id": 24,
                    "question": "تزين الشيطان للكفار قتال المؤمنين ووعدهم بالمناصرة، ثم نكوصه وبراءته خوفا من عقاب الله ",
                    "ayat":[ "وَإِذْ زَيَّنَ لَهُمُ الشَّيْطَانُ أَعْمَالَهُمْ وَقَالَ لاَ غَالِبَ لَكُمُ الْيَوْمَ مِنَ النَّاسِ وَإِنِّي جَارٌ لَّكُمْ فَلَمَّا تَرَاءَتِ الْفِئَتَانِ نَكَصَ عَلَى عَقِبَيْهِ وَقَالَ إِنِّي بَرِيءٌ مِّنكُمْ إِنِّي أَرَى مَا لاَ تَرَوْنَ إِنِّيَ أَخَافُ اللَّهَ وَاللَّهُ شَدِيدُ الْعِقَابِ ٤٨"
                ]},
                {
                    "id": 25,
                    "question": "استخفاف المنافقين بالمسلمين وجهلهم بعاقبة التوكل على الله ",
                    "ayat":[ "إِذْ يَقُولُ الْمُنَافِقُونَ وَالَّذِينَ فِي قُلُوبِهِم مَّرَضٌ غَرَّ هَؤُلاء دِينُهُمْ وَمَن يَتَوَكَّلْ عَلَى اللَّهِ فَإِنَّ اللَّهَ عَزِيزٌ حَكِيمٌ ٤٩"
                ]},
                {
                    "id": 26,
                    "question": "حال الكفار عند قبض أرواحهم وبيان سببه، وتشبيه فعالهم ومآلهم بآل فرعون ",
                    "ayat":[ "وَلَوْ تَرَى إِذْ يَتَوَفَّى الَّذِينَ كَفَرُواْ الْمَلائِكَةُ يَضْرِبُونَ وُجُوهَهُمْ وَأَدْبَارَهُمْ وَذُوقُواْ عَذَابَ الْحَرِيق ٥٠ذَلِكَ بِمَا قَدَّمَتْ أَيْدِيكُمْ وَأَنَّ اللَّهَ لَيْسَ بِظَلاَّمٍ لِّلْعَبِيدِ ٥١ كَدَأْبِ آلِ فِرْعَوْنَ وَالَّذِينَ مِن قَبْلِهِمْ كَفَرُواْ بِآيَاتِ اللَّهِ فَأَخَذَهُمُ اللَّهُ بِذُنُوبِهِمْ إِنَّ اللَّهَ قَوِيٌّ شَدِيدُ الْعِقَابِ ٥٢"
                ]},
                {
                    "id": 27,
                    "question": "تعليل عذاب الكفار، وسلب نعم الله عنهم وعن أشباههم من آل فرعون ",
                    "ayat":[ "ذَلِكَ بِأَنَّ اللَّهَ لَمْ يَكُ مُغَيِّرًا نِّعْمَةً أَنْعَمَهَا عَلَى قَوْمٍ حَتَّى يُغَيِّرُواْ مَا بِأَنفُسِهِمْ وَأَنَّ اللَّهَ سَمِيعٌ عَلِيم ٥٣ كَدَأْبِ آلِ فِرْعَوْنَ وَالَّذِينَ مِن قَبْلِهِمْ كَذَّبُواْ بِآيَاتِ رَبِّهِمْ فَأَهْلَكْنَاهُم بِذُنُوبِهِمْ وَأَغْرَقْنَا آلَ فِرْعَوْنَ وَكُلٌّ كَانُواْ ظَالِمِينَ ٥٤"
                ]},
                {
                    "id": 28,
                    "question": "ذم الكفار من اليهود الناقضين لعهودهم، والتحريض على قتالهم والتنكيل بهم، ونبذ عهدهم إن خشي خيانته ",
                    "ayat":[ "إِنَّ شَرَّ الدَّوَابِّ عِندَ اللَّهِ الَّذِينَ كَفَرُواْ فَهُمْ لاَ يُؤْمِنُونَ ٥٥ الَّذِينَ عَاهَدتَّ مِنْهُمْ ثُمَّ يَنقُضُونَ عَهْدَهُمْ فِي كُلِّ مَرَّةٍ وَهُمْ لاَ يَتَّقُونَ ٥٦ فَإِمَّا تَثْقَفَنَّهُمْ فِي الْحَرْبِ فَشَرِّدْ بِهِم مَّنْ خَلْفَهُمْ لَعَلَّهُمْ يَذَّكَّرُونَ ٥٧ وَإِمَّا تَخَافَنَّ مِن قَوْمٍ خِيَانَةً فَانبِذْ إِلَيْهِمْ عَلَى سَوَاء إِنَّ اللَّهَ لاَ يُحِبُّ الْخَائِنِينَ ٥٨"
                ]},
                {
                    "id": 29,
                    "question": "تهديد من حسب من الكفار أنه أفلت من عقاب الله ",
                    "ayat":[ "وَلاَ يَحْسَبَنَّ الَّذِينَ كَفَرُواْ سَبَقُواْ إِنَّهُمْ لاَ يُعْجِزُونَ ٥٩"
                ]},
                {
                    "id": 30,
                    "question": "الأمر بالاستعداد بوسائل القوة إرهابا للأعداء، وجزاء النفقة لذلك ",
                    "ayat":[ "وَأَعِدُّواْ لَهُم مَّا اسْتَطَعْتُم مِّن قُوَّةٍ وَمِن رِّبَاطِ الْخَيْلِ تُرْهِبُونَ بِهِ عَدُوَّ اللَّهِ وَعَدُوَّكُمْ وَآخَرِينَ مِن دُونِهِمْ لاَ تَعْلَمُونَهُمُ اللَّهُ يَعْلَمُهُمْ وَمَا تُنفِقُواْ مِن شَيْءٍ فِي سَبِيلِ اللَّهِ يُوَفَّ إِلَيْكُمْ وَأَنتُمْ لاَ تُظْلَمُونَ ٦٠"
                ]},
                {
                    "id": 31,
                    "question": "حكم الجنوح إلى السلم، وكفاية الله لنبيه ﷺ خداع المسالمين، وتأييده بالنصر وبالمؤمنين، وقدرته في تأليف قلوبهم ",
                    "ayat":[ "وَإِن جَنَحُواْ لِلسَّلْمِ فَاجْنَحْ لَهَا وَتَوَكَّلْ عَلَى اللَّهِ إِنَّهُ هُوَ السَّمِيعُ الْعَلِيمُ ٦١ وَإِن يُرِيدُواْ أَن يَخْدَعُوكَ فَإِنَّ حَسْبَكَ اللَّهُ هُوَ الَّذِيَ أَيَّدَكَ بِنَصْرِهِ وَبِالْمُؤْمِنِينَ ٦٢ وَأَلَّفَ بَيْنَ قُلُوبِهِمْ لَوْ أَنفَقْتَ مَا فِي الأَرْضِ جَمِيعًا مَّا أَلَّفْتْ بَيْنَ قُلُوبِهِمْ وَلَكِنَّ اللَّهَ أَلَّفَ بَيْنَهُمْ إِنَّهُ عَزِيزٌ حَكِيمٌ ٦٣"
                ]},
                {
                    "id": 32,
                    "question": "تثبيت قلب النبي ﷺ بكفاية الله له وللمؤمنين مطلقا ",
                    "ayat":[ "يَا أَيُّهَا النَّبِيُّ حَسْبُكَ اللَّهُ وَمَنِ اتَّبَعَكَ مِنَ الْمُؤْمِنِينَ ٦٤"
                ]},
                {
                    "id": 33,
                    "question": "أمر النبي ﷺ بتحريض المؤمنين على القتال، ومصابرة عشرين منهم لمئتين، ثم التخفيف عنهم وتصبيرهم ",
                    "ayat":[ "يَا أَيُّهَا النَّبِيُّ حَرِّضِ الْمُؤْمِنِينَ عَلَى الْقِتَالِ إِن يَكُن مِّنكُمْ عِشْرُونَ صَابِرُونَ يَغْلِبُواْ مِئَتَيْنِ وَإِن يَكُن مِّنكُم مِّائَةٌ يَغْلِبُواْ أَلْفًا مِّنَ الَّذِينَ كَفَرُواْ بِأَنَّهُمْ قَوْمٌ لاَّ يَفْقَهُونَ ٦٥ الآنَ خَفَّفَ اللَّهُ عَنكُمْ وَعَلِمَ أَنَّ فِيكُمْ ضَعْفًا فَإِن يَكُن مِّنكُم مِّائَةٌ صَابِرَةٌ يَغْلِبُواْ مِئَتَيْنِ وَإِن يَكُن مِّنكُمْ أَلْفٌ يَغْلِبُواْ أَلْفَيْنِ بِإِذْنِ اللَّهِ وَاللَّهُ مَعَ الصَّابِرِينَ ٦٦"
                ]},
                {
                    "id": 34,
                    "question": "عتاب النبي ﷺ في أسرى بدر، ثم بيان العفو والمغفرة ",
                    "ayat":[ "مَا كَانَ لِنَبِيٍّ أَن يَكُونَ لَهُ أَسْرَى حَتَّى يُثْخِنَ فِي الأَرْضِ تُرِيدُونَ عَرَضَ الدُّنْيَا وَاللَّهُ يُرِيدُ الآخِرَةَ وَاللَّهُ عَزِيزٌ حَكِيمٌ ٦٧ لَّوْلاَ كِتَابٌ مِّنَ اللَّهِ سَبَقَ لَمَسَّكُمْ فِيمَا أَخَذْتُمْ عَذَابٌ عَظِيمٌ ٦٨ فَكُلُواْ مِمَّا غَنِمْتُمْ حَلالاً طَيِّبًا وَاتَّقُواْ اللَّهَ إِنَّ اللَّهَ غَفُورٌ رَّحِيمٌ ٦٩"
                ]},
                {
                    "id": 35,
                    "question": "وعد الأسرى ، ووعيد للخائنين منهم ",
                    "ayat":[ "يَا أَيُّهَا النَّبِيُّ قُل لِّمَن فِي أَيْدِيكُم مِّنَ الأَسْرَى إِن يَعْلَمِ اللَّهُ فِي قُلُوبِكُمْ خَيْرًا يُؤْتِكُمْ خَيْرًا مِّمَّا أُخِذَ مِنكُمْ وَيَغْفِرْ لَكُمْ وَاللَّهُ غَفُورٌ رَّحِيمٌ ٧٠ وَإِن يُرِيدُواْ خِيَانَتَكَ فَقَدْ خَانُواْ اللَّهَ مِن قَبْلُ فَأَمْكَنَ مِنْهُمْ وَاللَّهُ عَلِيمٌ حَكِيمٌ ٧١"
                ]},
                {
                    "id": 36,
                    "question": "إثبات الولاية بين المؤمنين المهاجرين المجاهدين وبين الأنصار، ونفي الولاية بينهم وبين من آمن ولم يهاجر، وحكم استنصارهم ببعض، وولاية الكفار لبعضهم، ومغبة مخالفة هذه الأحكام",
                    "ayat":[ "إِنَّ الَّذِينَ آمَنُواْ وَهَاجَرُواْ وَجَاهَدُواْ بِأَمْوَالِهِمْ وَأَنفُسِهِمْ فِي سَبِيلِ اللَّهِ وَالَّذِينَ آوَواْ وَّنَصَرُواْ أُوْلَئِكَ بَعْضُهُمْ أَوْلِيَاء بَعْضٍ وَالَّذِينَ آمَنُواْ وَلَمْ يُهَاجِرُواْ مَا لَكُم مِّن وَلاَيَتِهِم مِّن شَيْءٍ حَتَّى يُهَاجِرُواْ وَإِنِ اسْتَنصَرُوكُمْ فِي الدِّينِ فَعَلَيْكُمُ النَّصْرُ إِلاَّ عَلَى قَوْمٍ بَيْنَكُمْ وَبَيْنَهُم مِّيثَاقٌ وَاللَّهُ بِمَا تَعْمَلُونَ بَصِيرٌ ٧٢ وَالَّذِينَ كَفَرُواْ بَعْضُهُمْ أَوْلِيَاء بَعْضٍ إِلاَّ تَفْعَلُوهُ تَكُن فِتْنَةٌ فِي الأَرْضِ وَفَسَادٌ كَبِيرٌ ٧٣"
                ]},
                {
                    "id": 37,
                    "question": "الخاتمة: الثناء على المؤمنين المهاجرين المجاهدين والأنصار وبيان جزائهم، وإلحاق المهاجرين المجاهدين بعد بهم، ورد المواريث إلى الأرحام ",
                    "ayat":[ "وَالَّذِينَ آمَنُواْ وَهَاجَرُواْ وَجَاهَدُواْ فِي سَبِيلِ اللَّهِ وَالَّذِينَ آوَواْ وَّنَصَرُواْ أُوْلَئِكَ هُمُ الْمُؤْمِنُونَ حَقًّا لَّهُم مَّغْفِرَةٌ وَرِزْقٌ كَرِيمٌ ٧٤ وَالَّذِينَ آمَنُواْ مِن بَعْدُ وَهَاجَرُواْ وَجَاهَدُواْ مَعَكُمْ فَأُولَئِكَ مِنكُمْ وَأُوْلُواْ الأَرْحَامِ بَعْضُهُمْ أَوْلَى بِبَعْضٍ فِي كِتَابِ اللَّهِ إِنَّ اللَّهَ بِكُلِّ شَيْءٍ عَلِيمٌ ٧٥"
                    ]
                }
            ]
        },
        {
            "sura":"التوبة",
            "questions": [
                {
                    "id": 1,
                    "question": "براءة الله ورسوله من عهود المشركين، وإمهالهم أربعة أشهر، وإعلامهم بذلك يوم النّحر ودعوتهم إلى التّوبة، وتهديد المتولّين، واستثناء من وفى بعهده من البراءة ",
                    "ayat":[ "بَرَاءَةٌ مِّنَ اللَّهِ وَرَسُولِهِ إِلَى الَّذِينَ عَاهَدتُّم مِّنَ الْمُشْرِكِينَ ١ فَسِيحُواْ فِي الأَرْضِ أَرْبَعَةَ أَشْهُرٍ وَاعْلَمُواْ أَنَّكُمْ غَيْرُ مُعْجِزِي اللَّهِ وَأَنَّ اللَّهَ مُخْزِي الْكَافِرِينَ ٢ وَأَذَانٌ مِّنَ اللَّهِ وَرَسُولِهِ إِلَى النَّاسِ يَوْمَ الْحَجِّ الأَكْبَرِ أَنَّ اللَّهَ بَرِيءٌ مِّنَ الْمُشْرِكِينَ وَرَسُولُهُ فَإِن تُبْتُمْ فَهُوَ خَيْرٌ لَّكُمْ وَإِن تَوَلَّيْتُمْ فَاعْلَمُواْ أَنَّكُمْ غَيْرُ مُعْجِزِي اللَّهِ وَبَشِّرِ الَّذِينَ كَفَرُواْ بِعَذَابٍ أَلِيمٍ ٣ إِلاَّ الَّذِينَ عَاهَدتُّم مِّنَ الْمُشْرِكِينَ ثُمَّ لَمْ يَنقُصُوكُمْ شَيْئًا وَلَمْ يُظَاهِرُواْ عَلَيْكُمْ أَحَدًا فَأَتِمُّواْ إِلَيْهِمْ عَهْدَهُمْ إِلَى مُدَّتِهِمْ إِنَّ اللَّهَ يُحِبُّ الْمُتَّقِينَ ٤"
                ]},
                {
                    "id": 2,
                    "question": "الأمر بقتال المشركين بعد انقضاء المدّة، وتخلية سبيل من تاب، وحكم إجارة ",
                    "ayat":[ "فَإِذَا انسَلَخَ الأَشْهُرُ الْحُرُمُ فَاقْتُلُواْ الْمُشْرِكِينَ حَيْثُ وَجَدتُّمُوهُمْ وَخُذُوهُمْ وَاحْصُرُوهُمْ وَاقْعُدُواْ لَهُمْ كُلَّ مَرْصَدٍ فَإِن تَابُواْ وَأَقَامُواْ الصَّلاةَ وَآتَوُاْ الزَّكَاةَ فَخَلُّواْ سَبِيلَهُمْ إِنَّ اللَّهَ غَفُورٌ رَّحِيمٌ ٥ وَإِنْ أَحَدٌ مِّنَ الْمُشْرِكِينَ اسْتَجَارَكَ فَأَجِرْهُ حَتَّى يَسْمَعَ كَلامَ اللَّهِ ثُمَّ أَبْلِغْهُ مَأْمَنَهُ ذَلِكَ بِأَنَّهُمْ قَوْمٌ لاَّ يَعْلَمُونَ ٦"
                ]},
                {
                    "id": 3,
                    "question": "استحالة المعاهدة مع المشركين، واستثناء عهد الحديبيّة، وبيان أسباب هذه الاستحالة، وحكم التّائبين منهم، والأمر بقتال الناكثين، وبيان أسبابه ",
                    "ayat":[ "كَيْفَ يَكُونُ لِلْمُشْرِكِينَ عَهْدٌ عِندَ اللَّهِ وَعِندَ رَسُولِهِ إِلاَّ الَّذِينَ عَاهَدتُّمْ عِندَ الْمَسْجِدِ الْحَرَامِ فَمَا اسْتَقَامُواْ لَكُمْ فَاسْتَقِيمُواْ لَهُمْ إِنَّ اللَّهَ يُحِبُّ الْمُتَّقِينَ ٧ كَيْفَ وَإِن يَظْهَرُوا عَلَيْكُمْ لاَ يَرْقُبُواْ فِيكُمْ إِلاًّ وَلاَ ذِمَّةً يُرْضُونَكُم بِأَفْوَاهِهِمْ وَتَأْبَى قُلُوبُهُمْ وَأَكْثَرُهُمْ فَاسِقُونَ  ٨ اشْتَرَوْا بِآيَاتِ اللَّهِ ثَمَنًا قَلِيلاً فَصَدُّواْ عَن سَبِيلِهِ إِنَّهُمْ سَاء مَا كَانُواْ يَعْمَلُونَ ٩ لاَ يَرْقُبُونَ فِي مُؤْمِنٍ إِلاًّ وَلاَ ذِمَّةً وَأُولَئِكَ هُمُ الْمُعْتَدُونَ ١٠ فَإِن تَابُواْ وَأَقَامُواْ الصَّلاةَ وَآتَوُاْ الزَّكَاةَ فَإِخْوَانُكُمْ فِي الدِّينِ وَنُفَصِّلُ الآيَاتِ لِقَوْمٍ يَعْلَمُونَ ١١ وَإِن نَّكَثُواْ أَيْمَانَهُم مِّن بَعْدِ عَهْدِهِمْ وَطَعَنُواْ فِي دِينِكُمْ فَقَاتِلُواْ أَئِمَّةَ الْكُفْرِ إِنَّهُمْ لاَ أَيْمَانَ لَهُمْ لَعَلَّهُمْ يَنتَهُونَ ١٢ أَلاَ تُقَاتِلُونَ قَوْمًا نَّكَثُواْ أَيْمَانَهُمْ وَهَمُّواْ بِإِخْرَاجِ الرَّسُولِ وَهُم بَدَؤُوكُمْ أَوَّلَ مَرَّةٍ أَتَخْشَوْنَهُمْ فَاللَّهُ أَحَقُّ أَن تَخْشَوْهُ إِن كُنتُم مُّؤْمِنِينَ ١٣"
                ]},
                {
                    "id": 4,
                    "question": "فوائد قتال الكفّار، وأنّ تحرير الولاية لله من حكم الجهاد ",
                    "ayat":[ "قَاتِلُوهُمْ يُعَذِّبْهُمُ اللَّهُ بِأَيْدِيكُمْ وَيُخْزِهِمْ وَيَنصُرْكُمْ عَلَيْهِمْ وَيَشْفِ صُدُورَ قَوْمٍ مُّؤْمِنِينَ ١٤ وَيُذْهِبْ غَيْظَ قُلُوبِهِمْ وَيَتُوبُ اللَّهُ عَلَى مَن يَشَاء وَاللَّهُ عَلِيمٌ حَكِيمٌ ١٥ أَمْ حَسِبْتُمْ أَن تُتْرَكُواْ وَلَمَّا يَعْلَمِ اللَّهُ الَّذِينَ جَاهَدُواْ مِنكُمْ وَلَمْ يَتَّخِذُواْ مِن دُونِ اللَّهِ وَلاَ رَسُولِهِ وَلاَ الْمُؤْمِنِينَ وَلِيجَةً وَاللَّهُ خَبِيرٌ بِمَا تَعْمَلُونَ ١٦"
                ]},
                {
                    "id": 5,
                    "question": "منع المشركين من عمارة مساجد الله، وحبوط أعمالهم، وحصر عمارتها بالمؤمنين المهتدين",
                    "ayat":[ "مَا كَانَ لِلْمُشْرِكِينَ أَن يَعْمُرُواْ مَسَاجِدَ اللَّه شَاهِدِينَ عَلَى أَنفُسِهِمْ بِالْكُفْرِ أُوْلَئِكَ حَبِطَتْ أَعْمَالُهُمْ وَفِي النَّارِ هُمْ خَالِدُونَ ١٧ إِنَّمَا يَعْمُرُ مَسَاجِدَ اللَّهِ مَنْ آمَنَ بِاللَّهِ وَالْيَوْمِ الآخِرِ وَأَقَامَ الصَّلاةَ وَآتَى الزَّكَاةَ وَلَمْ يَخْشَ إِلاَّ اللَّهَ فَعَسَى أُوْلَئِكَ أَن يَكُونُواْ مِنَ الْمُهْتَدِينَ ١٨"
                ]},
                {
                    "id": 6,
                    "question": "نفي المساواة بين السّقاية والعمارة وبين الإيمان والجهاد، وبيان جزاء المؤمنين المهاجرين المجاهدين ",
                    "ayat":[ "أَجَعَلْتُمْ سِقَايَةَ الْحَاجِّ وَعِمَارَةَ الْمَسْجِدِ الْحَرَامِ كَمَنْ آمَنَ بِاللَّهِ وَالْيَوْمِ الآخِرِ وَجَاهَدَ فِي سَبِيلِ اللَّهِ لاَ يَسْتَوُونَ عِندَ اللَّهِ وَاللَّهُ لاَ يَهْدِي الْقَوْمَ الظَّالِمِينَ ١٩ الَّذِينَ آمَنُواْ وَهَاجَرُواْ وَجَاهَدُواْ فِي سَبِيلِ اللَّهِ بِأَمْوَالِهِمْ وَأَنفُسِهِمْ أَعْظَمُ دَرَجَةً عِندَ اللَّهِ وَأُولَئِكَ هُمُ الْفَائِزُونَ ٢٠ يُبَشِّرُهُمْ رَبُّهُم بِرَحْمَةٍ مِّنْهُ وَرِضْوَانٍ وَجَنَّاتٍ لَّهُمْ فِيهَا نَعِيمٌ مُّقِيمٌ ٢١ خَالِدِينَ فِيهَا أَبَدًا إِنَّ اللَّهَ عِندَهُ أَجْرٌ عَظِيمٌ ٢٢"
                ]},
                {
                    "id": 7,
                    "question": "نهي المؤمنين عن موالاة آبائهم وإخوانهم من الكفّار، وتهديد من آثر حبّ الدنيا على الله ورسوله والجهاد في سبيله ",
                    "ayat":[ "يَا أَيُّهَا الَّذِينَ آمَنُواْ لاَ تَتَّخِذُواْ آبَاءَكُمْ وَإِخْوَانَكُمْ أَوْلِيَاء إِنِ اسْتَحَبُّواْ الْكُفْرَ عَلَى الإِيمَانِ وَمَن يَتَوَلَّهُم مِّنكُمْ فَأُولَئِكَ هُمُ الظَّالِمُونَ ٢٣ قُلْ إِن كَانَ آبَاؤُكُمْ وَأَبْنَاؤُكُمْ وَإِخْوَانُكُمْ وَأَزْوَاجُكُمْ وَعَشِيرَتُكُمْ وَأَمْوَالٌ اقْتَرَفْتُمُوهَا وَتِجَارَةٌ تَخْشَوْنَ كَسَادَهَا وَمَسَاكِنُ تَرْضَوْنَهَا أَحَبَّ إِلَيْكُم مِّنَ اللَّهِ وَرَسُولِهِ وَجِهَادٍ فِي سَبِيلِهِ فَتَرَبَّصُواْ حَتَّى يَأْتِيَ اللَّهُ بِأَمْرِهِ وَاللَّهُ لاَ يَهْدِي الْقَوْمَ الْفَاسِقِينَ ٢٤"
                ]},
                {
                    "id": 8,
                    "question": "تذكير المؤمنين بنصر الله لهم، وتصوير حالهم يوم حنين وما تمّ من نصر الله لهم، وتوبته على من يشاء ",
                    "ayat":[ "لَقَدْ نَصَرَكُمُ اللَّهُ فِي مَوَاطِنَ كَثِيرَةٍ وَيَوْمَ حُنَيْنٍ إِذْ أَعْجَبَتْكُمْ كَثْرَتُكُمْ فَلَمْ تُغْنِ عَنكُمْ شَيْئًا وَضَاقَتْ عَلَيْكُمُ الأَرْضُ بِمَا رَحُبَتْ ثُمَّ وَلَّيْتُم مُّدْبِرِينَ ٢٥ ثُمَّ أَنزَلَ اللَّهُ سَكِينَتَهُ عَلَى رَسُولِهِ وَعَلَى الْمُؤْمِنِينَ وَأَنزَلَ جُنُودًا لَّمْ تَرَوْهَا وَعَذَّبَ الَّذِينَ كَفَرُواْ وَذَلِكَ جَزَاء الْكَافِرِينَ ٢٦  ثُمَّ يَتُوبُ اللَّهُ مِن بَعْدِ ذَلِكَ عَلَى مَن يَشَاء وَاللَّهُ غَفُورٌ رَّحِيمٌ ٢٧"
                ]},
                {
                    "id": 9,
                    "question": "نجاسة المشركين، وتحريم دخولهم المسجد الحرام، ووعد المؤمنين بالغنى عنهم ",
                    "ayat":[ "يَا أَيُّهَا الَّذِينَ آمَنُواْ إِنَّمَا الْمُشْرِكُونَ نَجَسٌ فَلاَ يَقْرَبُواْ الْمَسْجِدَ الْحَرَامَ بَعْدَ عَامِهِمْ هَذَا وَإِنْ خِفْتُمْ عَيْلَةً فَسَوْفَ يُغْنِيكُمُ اللَّهُ مِن فَضْلِهِ إِن شَاء إِنَّ اللَّهَ عَلِيمٌ حَكِيمٌ ٢٨"
                ]},
                {
                    "id": 10,
                    "question": "التّحريض على قتال أهل الكتاب ببيان أسبابه، وضرب الجزية عليهم ",
                    "ayat":[ "قَاتِلُواْ الَّذِينَ لاَ يُؤْمِنُونَ بِاللَّهِ وَلاَ بِالْيَوْمِ الآخِرِ وَلاَ يُحَرِّمُونَ مَا حَرَّمَ اللَّهُ وَرَسُولُهُ وَلاَ يَدِينُونَ دِينَ الْحَقِّ مِنَ الَّذِينَ أُوتُواْ الْكِتَابَ حَتَّى يُعْطُواْ الْجِزْيَةَ عَن يَدٍ وَهُمْ صَاغِرُونَ ٢٩"
                ]},
                {
                    "id": 11,
                    "question": "أقوال اليهود والنّصارى الباطلة، وغلوّهم في أحبارهم ورهبانهم وتأليههم للمسيح، وسعيهم في إبطال دين الله، والبشارة بإتمامه وظهوره وأمارة ذلك ",
                    "ayat":[ "وَقَالَتِ الْيَهُودُ عُزَيْرٌ ابْنُ اللَّهِ وَقَالَتْ النَّصَارَى الْمَسِيحُ ابْنُ اللَّهِ ذَلِكَ قَوْلُهُم بِأَفْوَاهِهِمْ يُضَاهِؤُونَ قَوْلَ الَّذِينَ كَفَرُواْ مِن قَبْلُ قَاتَلَهُمُ اللَّهُ أَنَّى يُؤْفَكُونَ ٣٠ اتَّخَذُواْ أَحْبَارَهُمْ وَرُهْبَانَهُمْ أَرْبَابًا مِّن دُونِ اللَّهِ وَالْمَسِيحَ ابْنَ مَرْيَمَ وَمَا أُمِرُواْ إِلاَّ لِيَعْبُدُواْ إِلَهًا وَاحِدًا لاَّ إِلَهَ إِلاَّ هُوَ سُبْحَانَهُ عَمَّا يُشْرِكُونَ٣١  يُرِيدُونَ أَن يُطْفِؤُواْ نُورَ اللَّهِ بِأَفْوَاهِهِمْ وَيَأْبَى اللَّهُ إِلاَّ أَن يُتِمَّ نُورَهُ وَلَوْ كَرِهَ الْكَافِرُونَ٣٢  هُوَ الَّذِي أَرْسَلَ رَسُولَهُ بِالْهُدَى وَدِينِ الْحَقِّ لِيُظْهِرَهُ عَلَى الدِّينِ كُلِّهِ وَلَوْ كَرِهَ الْمُشْرِكُونَ ٣٣"
                ]},
                {
                    "id": 12,
                    "question": "تحذير المؤمنين من الأحبار والرّهبان بفضح طمعهم في أموال النّاس، وتوعد مانعي الزّكاة وتفصيل عذابهم ",
                    "ayat":[ "يَا أَيُّهَا الَّذِينَ آمَنُواْ إِنَّ كَثِيرًا مِّنَ الأَحْبَارِ وَالرُّهْبَانِ لَيَأْكُلُونَ أَمْوَالَ النَّاسِ بِالْبَاطِلِ وَيَصُدُّونَ عَن سَبِيلِ اللَّهِ وَالَّذِينَ يَكْنِزُونَ الذَّهَبَ وَالْفِضَّةَ وَلاَ يُنفِقُونَهَا فِي سَبِيلِ اللَّهِ فَبَشِّرْهُم بِعَذَابٍ أَلِيمٍ ٣٤ يَوْمَ يُحْمَى عَلَيْهَا فِي نَارِ جَهَنَّمَ فَتُكْوَى بِهَا جِبَاهُهُمْ وَجُنُوبُهُمْ وَظُهُورُهُمْ هَذَا مَا كَنَزْتُمْ لأَنفُسِكُمْ فَذُوقُواْ مَا كُنتُمْ تَكْنِزُونَ ٣٥"
                ]},
                {
                    "id": 13,
                    "question": "بيان السّنة الشّرعيّة، والأمر بقتال المشركين كافّة، وإبطال النّسيء وبيان حقيقته ",
                    "ayat":[ "إِنَّ عِدَّةَ الشُّهُورِ عِندَ اللَّهِ اثْنَا عَشَرَ شَهْرًا فِي كِتَابِ اللَّهِ يَوْمَ خَلَقَ السَّمَاوَات وَالأَرْضَ مِنْهَا أَرْبَعَةٌ حُرُمٌ ذَلِكَ الدِّينُ الْقَيِّمُ فَلاَ تَظْلِمُواْ فِيهِنَّ أَنفُسَكُمْ وَقَاتِلُواْ الْمُشْرِكِينَ كَافَّةً كَمَا يُقَاتِلُونَكُمْ كَافَّةً وَاعْلَمُواْ أَنَّ اللَّهَ مَعَ الْمُتَّقِينَ ٣٦ إِنَّمَا النَّسِيءُ زِيَادَةٌ فِي الْكُفْرِ يُضَلُّ بِهِ الَّذِينَ كَفَرُواْ يُحِلُّونَهُ عَامًا وَيُحَرِّمُونَهُ عَامًا لِّيُوَاطِؤُواْ عِدَّةَ مَا حَرَّمَ اللَّهُ فَيُحِلُّواْ مَا حَرَّمَ اللَّهُ زُيِّنَ لَهُمْ سُوءُ أَعْمَالِهِمْ وَاللَّهُ لاَ يَهْدِي الْقَوْمَ الْكَافِرِينَ ٣٧"
                ]},
                {
                    "id": 14,
                    "question": "عتاب المؤمنين على تباطوئهم في الجهاد ببيان حقيقة الدّنيا، وتهديدهم بالعذاب والاستبدال إن لم ينفروا، وتأكيد نصر الله لنبيه كما نصره وصاحبه في الغار ",
                    "ayat":[ "يَا أَيُّهَا الَّذِينَ آمَنُواْ مَا لَكُمْ إِذَا قِيلَ لَكُمُ انفِرُواْ فِي سَبِيلِ اللَّهِ اثَّاقَلْتُمْ إِلَى الأَرْضِ أَرَضِيتُم بِالْحَيَاةِ الدُّنْيَا مِنَ الآخِرَةِ فَمَا مَتَاعُ الْحَيَاةِ الدُّنْيَا فِي الآخِرَةِ إِلاَّ قَلِيلٌ ٣٨ إِلاَّ تَنفِرُواْ يُعَذِّبْكُمْ عَذَابًا أَلِيمًا وَيَسْتَبْدِلْ قَوْمًا غَيْرَكُمْ وَلاَ تَضُرُّوهُ شَيْئًا وَاللَّهُ عَلَى كُلِّ شَيْءٍ قَدِيرٌ ٣٩ إِلاَّ تَنصُرُوهُ فَقَدْ نَصَرَهُ اللَّهُ إِذْ أَخْرَجَهُ الَّذِينَ كَفَرُواْ ثَانِيَ اثْنَيْنِ إِذْ هُمَا فِي الْغَارِ إِذْ يَقُولُ لِصَاحِبِهِ لاَ تَحْزَنْ إِنَّ اللَّهَ مَعَنَا فَأَنزَلَ اللَّهُ سَكِينَتَهُ عَلَيْهِ وَأَيَّدَهُ بِجُنُودٍ لَّمْ تَرَوْهَا وَجَعَلَ كَلِمَةَ الَّذِينَ كَفَرُواْ السُّفْلَى وَكَلِمَةُ اللَّهِ هِيَ الْعُلْيَا وَاللَّهُ عَزِيزٌ حَكِيمٌ ٤٠"
                ]},
                {
                    "id": 15,
                    "question": "النّفير العام للجهاد بالأموال والأنفس ",
                    "ayat":[ "انفِرُواْ خِفَافًا وَثِقَالاً وَجَاهِدُواْ بِأَمْوَالِكُمْ وَأَنفُسِكُمْ فِي سَبِيلِ اللَّهِ ذَلِكُمْ خَيْرٌ لَّكُمْ إِن كُنتُمْ تَعْلَمُونَ ٤١"
                ]},
                {
                    "id": 16,
                    "question": "من أسباب امتناع المنافقين عن الخروج، والإخبار عن تعلّلهم بالحلف الكاذب على عدم الاستطاعة ",
                    "ayat":[ "لَوْ كَانَ عَرَضًا قَرِيبًا وَسَفَرًا قَاصِدًا لاَّتَّبَعُوكَ وَلَكِن بَعُدَتْ عَلَيْهِمُ الشُّقَّةُ وَسَيَحْلِفُونَ بِاللَّهِ لَوِ اسْتَطَعْنَا لَخَرَجْنَا مَعَكُمْ يُهْلِكُونَ أَنفُسَهُمْ وَاللَّهُ يَعْلَمُ إِنَّهُمْ لَكَاذِبُونَ ٤٢"
                ]},
                {
                    "id": 17,
                    "question": "عتاب النّبيّ ﷺ لإذنه للمنافقين في القعود عن الجهاد قبل تبيّن صدقهم، وأنّ الاستئذان لذلك ليس من سيما المؤمنين، وإنّما هو من فعال المنافقين ",
                    "ayat":[ "عَفَا اللَّهُ عَنكَ لِمَ أَذِنتَ لَهُمْ حَتَّى يَتَبَيَّنَ لَكَ الَّذِينَ صَدَقُواْ وَتَعْلَمَ الْكَاذِبِينَ ٤٣ لاَ يَسْتَأْذِنُكَ الَّذِينَ يُؤْمِنُونَ بِاللَّهِ وَالْيَوْمِ الآخِرِ أَن يُجَاهِدُواْ بِأَمْوَالِهِمْ وَأَنفُسِهِمْ وَاللَّهُ عَلِيمٌ بِالْمُتَّقِينَ ٤٤ إِنَّمَا يَسْتَأْذِنُكَ الَّذِينَ لاَ يُؤْمِنُونَ بِاللَّهِ وَالْيَوْمِ الآخِرِ وَارْتَابَتْ قُلُوبُهُمْ فَهُمْ فِي رَيْبِهِمْ يَتَرَدَّدُونَ ٤٥"
                ]},
                {
                    "id": 18,
                    "question": "من أدلّة عدم إرادتهم الخروج، وبيان كراهة الله لخروجهم وتثبيطه لهم، ومفاسد خروجهم مع المسلمين، والتّذكير بحرصهم على فتنتهم يوم أحد ",
                    "ayat":[ "وَلَوْ أَرَادُواْ الْخُرُوجَ لأَعَدُّواْ لَهُ عُدَّةً وَلَكِن كَرِهَ اللَّهُ انبِعَاثَهُمْ فَثَبَّطَهُمْ وَقِيلَ اقْعُدُواْ مَعَ الْقَاعِدِينَ٤٦ لَوْ خَرَجُواْ فِيكُم مَّا زَادُوكُمْ إِلاَّ خَبَالاً ولأَوْضَعُواْ خِلالَكُمْ يَبْغُونَكُمُ الْفِتْنَةَ وَفِيكُمْ سَمَّاعُونَ لَهُمْ وَاللَّهُ عَلِيمٌ بِالظَّالِمِينَ ٤٧ لَقَدِ ابْتَغَوُاْ الْفِتْنَةَ مِن قَبْلُ وَقَلَّبُواْ لَكَ الأُمُورَ حَتَّى جَاءَ الْحَقُّ وَظَهَرَ أَمْرُ اللَّهِ وَهُمْ كَارِهُونَ ٤٨"
                ]},
                {
                    "id": 19,
                    "question": "طلبهم الإذن خشية الفتنة، والردّ عليهم ",
                    "ayat":[ "وَمِنْهُم مَّن يَقُولُ ائْذَن لِّي وَلاَ تَفْتِنِّي أَلاَ فِي الْفِتْنَةِ سَقَطُواْ وَإِنَّ جَهَنَّمَ لَمُحِيطَةٌ بِالْكَافِرِينَ ٤٩"
                ]},
                {
                    "id": 20,
                    "question": "من قبائحهم: بيان مسائتهم بنصر المسلمين وفرحهم بمصائبهم، والردّ عليهم بتمام تسليم المؤمنين وتوكّلهم على ربّهم، وأنّ عاقبتهم إحدى الحسنيين، وأنّهم يتربّصون بالمنافقين العذاب ",
                    "ayat":[ "إِن تُصِبْكَ حَسَنَةٌ تَسُؤْهُمْ وَإِن تُصِبْكَ مُصِيبَةٌ يَقُولُواْ قَدْ أَخَذْنَا أَمْرَنَا مِن قَبْلُ وَيَتَوَلَّواْ وَّهُمْ فَرِحُونَ ٥٠ قُل لَّن يُصِيبَنَا إِلاَّ مَا كَتَبَ اللَّهُ لَنَا هُوَ مَوْلانَا وَعَلَى اللَّهِ فَلْيَتَوَكَّلِ الْمُؤْمِنُونَ ٥١ قُلْ هَلْ تَرَبَّصُونَ بِنَا إِلاَّ إِحْدَى الْحُسْنَيَيْنِ وَنَحْنُ نَتَرَبَّصُ بِكُمْ أَن يُصِيبَكُمُ اللَّهُ بِعَذَابٍ مِّنْ عِندِهِ أَوْ بِأَيْدِينَا فَتَرَبَّصُواْ إِنَّا مَعَكُم مُّتَرَبِّصُونَ ٥٢"
                ]},
                {
                    "id": 21,
                    "question": "من قبائحهم: قبائح توجب ردّ نفقاتهم، والتّحذير من الاعجاب بأموالهم وأولادهم لأنّها سبب عذابهم في الدّنيا ",
                    "ayat":[ "قُلْ أَنفِقُواْ طَوْعًا أَوْ كَرْهًا لَّن يُتَقَبَّلَ مِنكُمْ إِنَّكُمْ كُنتُمْ قَوْمًا فَاسِقِينَ ٥٣ وَمَا مَنَعَهُمْ أَن تُقْبَلَ مِنْهُمْ نَفَقَاتُهُمْ إِلاَّ أَنَّهُمْ كَفَرُواْ بِاللَّهِ وَبِرَسُولِهِ وَلاَ يَأْتُونَ الصَّلاةَ إِلاَّ وَهُمْ كُسَالَى وَلاَ يُنفِقُونَ إِلاَّ وَهُمْ كَارِهُونَ ٥٤ فَلاَ تُعْجِبْكَ أَمْوَالُهُمْ وَلاَ أَوْلادُهُمْ إِنَّمَا يُرِيدُ اللَّهُ لِيُعَذِّبَهُم بِهَا فِي الْحَيَاةِ الدُّنْيَا وَتَزْهَقَ أَنفُسُهُمْ وَهُمْ كَافِرُونَ ٥٥"
                ]},
                {
                    "id": 22,
                    "question": "من قبائحهم: حلفهم بالله أنّهم مسلمون، والردّ بنفي ذلك وبيان جبنهم، وحرصهم على ملاذ آمن ",
                    "ayat":[ "وَيَحْلِفُونَ بِاللَّهِ إِنَّهُمْ لَمِنكُمْ وَمَا هُم مِّنكُمْ وَلَكِنَّهُمْ قَوْمٌ يَفْرَقُونَ ٥٦ لَوْ يَجِدُونَ مَلْجَأً أَوْ مَغَارَاتٍ أَوْ مُدَّخَلاً لَّوَلَّوْا إِلَيْهِ وَهُمْ يَجْمَحُونَ ٥٧"
                ]},
                {
                    "id": 23,
                    "question": "من قبائحهم: لمزهم الرّسول ﷺ في الصّدقات، والردّ عليهم، بأنّ الأولى لهم الرّضا والرّغبة في فضل الله، وبيان مصارف الصّدقات ",
                    "ayat":[ "وَمِنْهُم مَّن يَلْمِزُكَ فِي الصَّدَقَاتِ فَإِنْ أُعْطُواْ مِنْهَا رَضُواْ وَإِن لَّمْ يُعْطَوْا مِنْهَا إِذَا هُمْ يَسْخَطُونَ ٥٨ وَلَوْ أَنَّهُمْ رَضُواْ مَا آتَاهُمُ اللَّهُ وَرَسُولُهُ وَقَالُواْ حَسْبُنَا اللَّهُ سَيُؤْتِينَا اللَّهُ مِن فَضْلِهِ وَرَسُولُهُ إِنَّا إِلَى اللَّهِ رَاغِبُونَ ٥٩ إِنَّمَا الصَّدَقَاتُ لِلْفُقَرَاء وَالْمَسَاكِينِ وَالْعَامِلِينَ عَلَيْهَا وَالْمُؤَلَّفَةِ قُلُوبُهُمْ وَفِي الرِّقَابِ وَالْغَارِمِينَ وَفِي سَبِيلِ اللَّهِ وَابْنِ السَّبِيلِ فَرِيضَةً مِّنَ اللَّهِ وَاللَّهُ عَلِيمٌ حَكِيمٌ ٦٠"
                ]},
                {
                    "id": 24,
                    "question": "من قبائحهم: إيذاء النّبيّ، وقولهم عنه \"أذن\"، والردّ عليهم بأنّه سمّاع خير، وهو رحمة للمؤمنين، وتوعّدهم بالعذاب الأليم ",
                    "ayat":[ "وَمِنْهُمُ الَّذِينَ يُؤْذُونَ النَّبِيَّ وَيَقُولُونَ هُوَ أُذُنٌ قُلْ أُذُنُ خَيْرٍ لَّكُمْ يُؤْمِنُ بِاللَّهِ وَيُؤْمِنُ لِلْمُؤْمِنِينَ وَرَحْمَةٌ لِّلَّذِينَ آمَنُواْ مِنكُمْ وَالَّذِينَ يُؤْذُونَ رَسُولَ اللَّهِ لَهُمْ عَذَابٌ أَلِيمٌ ٦١"
                ]},
                {
                    "id": 25,
                    "question": "من قبائحهم: حلفهم كذبا لإرضاء المسلمين، والرّدّ عليهم بأنّ الله ورسوله أحقّ بالإرضاء، وببيان عاقبة من يحاددهما ",
                    "ayat":[ "يَحْلِفُونَ بِاللَّهِ لَكُمْ لِيُرْضُوكُمْ وَاللَّهُ وَرَسُولُهُ أَحَقُّ أَن يُرْضُوهُ إِن كَانُواْ مُؤْمِنِينَ ٦٢ أَلَمْ يَعْلَمُواْ أَنَّهُ مَن يُحَادِدِ اللَّهَ وَرَسُولَهُ فَأَنَّ لَهُ نَارَ جَهَنَّمَ خَالِدًا فِيهَا ذَلِكَ الْخِزْيُ الْعَظِيمُ ٦٣"
                ]},
                {
                    "id": 26,
                    "question": "من قبائحهم: حذرهم من نزول سورة تخرج ما في قلوبهم، والرّدّ عليهم بإمهالهم، وتهديدهم ",
                    "ayat":[ "يَحْذَرُ الْمُنَافِقُونَ أَن تُنَزَّلَ عَلَيْهِمْ سُورَةٌ تُنَبِّئُهُمْ بِمَا فِي قُلُوبِهِم قُلِ اسْتَهْزِؤُواْ إِنَّ اللَّهَ مُخْرِجٌ مَّا تَحْذَرُونَ ٦٤"
                ]},
                {
                    "id": 27,
                    "question": "من قبائحهم: تعذرهم بالخوض واللّعب، والرّدّ عليهم، وبتوبيخهم على استهزائهم، ورفض معذرتهم، والحكم بكفرهم، والعفو عن التّائبين، والعذاب للمجرمين ",
                    "ayat":[ "وَلَئِن سَأَلْتَهُمْ لَيَقُولُنَّ إِنَّمَا كُنَّا نَخُوضُ وَنَلْعَبُ قُلْ أَبِاللَّهِ وَآيَاتِهِ وَرَسُولِهِ كُنتُمْ تَسْتَهْزِؤُونَ ٦٥ لاَ تَعْتَذِرُواْ قَدْ كَفَرْتُم بَعْدَ إِيمَانِكُمْ إِن نَّعْفُ عَن طَائِفَةٍ مِّنكُمْ نُعَذِّبْ طَائِفَةً بِأَنَّهُمْ كَانُواْ مُجْرِمِينَ ٦٦"
                ]},
                {
                    "id": 28,
                    "question": "من قبائحهم: توافقهم ذكورا وإناثا في أحوال النّفاق، وبيان أصول قبائحهم، وجزاؤهم الآخرويّ ",
                    "ayat":[ "الْمُنَافِقُونَ وَالْمُنَافِقَاتُ بَعْضُهُم مِّن بَعْضٍ يَأْمُرُونَ بِالْمُنكَرِ وَيَنْهَوْنَ عَنِ الْمَعْرُوفِ وَيَقْبِضُونَ أَيْدِيَهُمْ نَسُواْ اللَّهَ فَنَسِيَهُمْ إِنَّ الْمُنَافِقِينَ هُمُ الْفَاسِقُونَ ٦٧ وَعَدَ اللَّه الْمُنَافِقِينَ وَالْمُنَافِقَاتِ وَالْكُفَّارَ نَارَ جَهَنَّمَ خَالِدِينَ فِيهَا هِيَ حَسْبُهُمْ وَلَعَنَهُمُ اللَّهُ وَلَهُمْ عَذَابٌ مُّقِيمٌ ٦٨"
                ]},
                {
                    "id": 29,
                    "question": "من قبائحهم: مشابهتهم لمن قبلهم من الأمم في الاستمتاع والخوض، وتوبيخهم على عدم الاعتبار بأنبائهم ",
                    "ayat":[ "كَالَّذِينَ مِن قَبْلِكُمْ كَانُواْ أَشَدَّ مِنكُمْ قُوَّةً وَأَكْثَرَ أَمْوَالاً وَأَوْلادًا فَاسْتَمْتَعُواْ بِخَلاقِهِمْ فَاسْتَمْتَعْتُم بِخَلاقِكُمْ كَمَا اسْتَمْتَعَ الَّذِينَ مِن قَبْلِكُمْ بِخَلاقِهِمْ وَخُضْتُمْ كَالَّذِي خَاضُواْ أُوْلَئِكَ حَبِطَتْ أَعْمَالُهُمْ فِي الدُّنْيَا وَالآخِرَةِ وَأُولَئِكَ هُمُ الْخَاسِرُونَ ٦٩ أَلَمْ يَأْتِهِمْ نَبَأُ الَّذِينَ مِن قَبْلِهِمْ قَوْمِ نُوحٍ وَعَادٍ وَثَمُودَ وَقَوْمِ إِبْرَاهِيمَ وَأَصْحَابِ مَدْيَنَ وَالْمُؤْتَفِكَاتِ أَتَتْهُمْ رُسُلُهُم بِالْبَيِّنَاتِ فَمَا كَانَ اللَّهُ لِيَظْلِمَهُمْ وَلَكِن كَانُواْ أَنفُسَهُمْ يَظْلِمُونَ ٧٠"
                ]},
                {
                    "id": 30,
                    "question": "التّعقيب ببيان ولاية المؤمنين والمؤمنات لبعضهم، ووصفهم بنقيض صفات المنافقين، وجزاؤهم ",
                    "ayat":[ "وَالْمُؤْمِنُونَ وَالْمُؤْمِنَاتُ بَعْضُهُمْ أَوْلِيَاء بَعْضٍ يَأْمُرُونَ بِالْمَعْرُوفِ وَيَنْهَوْنَ عَنِ الْمُنكَرِ وَيُقِيمُونَ الصَّلاةَ وَيُؤْتُونَ الزَّكَاةَ وَيُطِيعُونَ اللَّهَ وَرَسُولَهُ أُوْلَئِكَ سَيَرْحَمُهُمُ اللَّهُ إِنَّ اللَّهَ عَزِيزٌ حَكِيمٌ ٧١ وَعَدَ اللَّهُ الْمُؤْمِنِينَ وَالْمُؤْمِنَاتِ جَنَّاتٍ تَجْرِي مِن تَحْتِهَا الأَنْهَارُ خَالِدِينَ فِيهَا وَمَسَاكِنَ طَيِّبَةً فِي جَنَّاتِ عَدْنٍ وَرِضْوَانٌ مِّنَ اللَّهِ أَكْبَرُ ذَلِكَ هُوَ الْفَوْزُ الْعَظِيمُ ٧٢"
                ]},
                {
                    "id": 31,
                    "question": "أمر النّبيّ ﷺ بجهاد الكفّار والمنافقين والغلظة عليهم ",
                    "ayat":[ "يَا أَيُّهَا النَّبِيُّ جَاهِدِ الْكُفَّارَ وَالْمُنَافِقِينَ وَاغْلُظْ عَلَيْهِمْ وَمَأْوَاهُمْ جَهَنَّمُ وَبِئْسَ الْمَصِيرُ ٧٣"
                ]},
                {
                    "id": 32,
                    "question": "من معاذيرهم: حلفهم لإنكار مقالات الكفر، والرّدّ عليهم بتأكيد مقالتهم، وكفرهم، وهمّهم بالسّوء، ونقمتهم على المسلمين ووعد التّائبين وتوعّد المتولّين منهم ",
                    "ayat":[ "يَحْلِفُونَ بِاللَّهِ مَا قَالُواْ وَلَقَدْ قَالُواْ كَلِمَةَ الْكُفْرِ وَكَفَرُواْ بَعْدَ إِسْلامِهِمْ وَهَمُّواْ بِمَا لَمْ يَنَالُواْ وَمَا نَقَمُواْ إِلاَّ أَنْ أَغْنَاهُمُ اللَّهُ وَرَسُولُهُ مِن فَضْلِهِ فَإِن يَتُوبُواْ يَكُ خَيْرًا لَّهُمْ وَإِن يَتَوَلَّوْا يُعَذِّبْهُمُ اللَّهُ عَذَابًا أَلِيمًا فِي الدُّنْيَا وَالآخِرَةِ وَمَا لَهُمْ فِي الأَرْضِ مِن وَلِيٍّ وَلاَ نَصِيرٍ ٧٤"
                ]},
                {
                    "id": 33,
                    "question": "من معاذيرهم: معاهدتهم الله على الصّدقة إن أغناهم، ثمّ بخلهم وتوليهم وإعراضهم، وعقوبة الله لهم، وتوبيخهم لجهلهم بعلم الله للغيوب، ولمزهم المؤمنين في صدقاتهم وسخريتهم منهم، وجزاؤهم، وحرمانهم من المغفرة باستغفار الرّسول ﷺ وسبب ذلك ",
                    "ayat":[ "وَمِنْهُم مَّنْ عَاهَدَ اللَّهَ لَئِنْ آتَانَا مِن فَضْلِهِ لَنَصَّدَّقَنَّ وَلَنَكُونَنَّ مِنَ الصَّالِحِينَ ٧٥ فَلَمَّا آتَاهُم مِّن فَضْلِهِ بَخِلُواْ بِهِ وَتَوَلَّوْا وَّهُم مُّعْرِضُونَ ٧٦ فَأَعْقَبَهُمْ نِفَاقًا فِي قُلُوبِهِمْ إِلَى يَوْمِ يَلْقَوْنَهُ بِمَا أَخْلَفُواْ اللَّهَ مَا وَعَدُوهُ وَبِمَا كَانُواْ يَكْذِبُونَ ٧٧ أَلَمْ يَعْلَمُواْ أَنَّ اللَّهَ يَعْلَمُ سِرَّهُمْ وَنَجْوَاهُمْ وَأَنَّ اللَّهَ عَلاَّمُ الْغُيُوبِ ٧٨ الَّذِينَ يَلْمِزُونَ الْمُطَّوِّعِينَ مِنَ الْمُؤْمِنِينَ فِي الصَّدَقَاتِ وَالَّذِينَ لاَ يَجِدُونَ إِلاَّ جُهْدَهُمْ فَيَسْخَرُونَ مِنْهُمْ سَخِرَ اللَّهُ مِنْهُمْ وَلَهُمْ عَذَابٌ أَلِيمٌ ٧٩ اسْتَغْفِرْ لَهُمْ أَوْ لاَ تَسْتَغْفِرْ لَهُمْ إِن تَسْتَغْفِرْ لَهُمْ سَبْعِينَ مَرَّةً فَلَن يَغْفِرَ اللَّهُ لَهُمْ ذَلِكَ بِأَنَّهُمْ كَفَرُواْ بِاللَّهِ وَرَسُولِهِ وَاللَّهُ لاَ يَهْدِي الْقَوْمَ الْفَاسِقِينَ ٨٠"
                ]},
                {
                    "id": 34,
                    "question": "من مواقف المنافقين: فرحهم بالقعود عن الجهاد وكرههم له وتثبيطهم لبعضهم بعلّة الحرّ، والرّد عليهم بتوعدهم بالجزاء، وجملة من التّوجيهات للنّبيّ ﷺ في تعامله معهم في حياتهم ومماتهم ومعاشهم ",
                    "ayat":[ "فَرِحَ الْمُخَلَّفُونَ بِمَقْعَدِهِمْ خِلافَ رَسُولِ اللَّهِ وَكَرِهُواْ أَن يُجَاهِدُواْ بِأَمْوَالِهِمْ وَأَنفُسِهِمْ فِي سَبِيلِ اللَّهِ وَقَالُواْ لاَ تَنفِرُواْ فِي الْحَرِّ قُلْ نَارُ جَهَنَّمَ أَشَدُّ حَرًّا لَّوْ كَانُوا يَفْقَهُونَ ٨١ فَلْيَضْحَكُواْ قَلِيلاً وَلْيَبْكُواْ كَثِيرًا جَزَاء بِمَا كَانُواْ يَكْسِبُونَ ٨٢ فَإِن رَّجَعَكَ اللَّهُ إِلَى طَائِفَةٍ مِّنْهُمْ فَاسْتَأْذَنُوكَ لِلْخُرُوجِ فَقُل لَّن تَخْرُجُواْ مَعِيَ أَبَدًا وَلَن تُقَاتِلُواْ مَعِيَ عَدُوًّا إِنَّكُمْ رَضِيتُم بِالْقُعُودِ أَوَّلَ مَرَّةٍ فَاقْعُدُواْ مَعَ الْخَالِفِينَ ٨٣ وَلاَ تُصَلِّ عَلَى أَحَدٍ مِّنْهُم مَّاتَ أَبَدًا وَلاَ تَقُمْ عَلَىَ قَبْرِهِ إِنَّهُمْ كَفَرُواْ بِاللَّهِ وَرَسُولِهِ وَمَاتُواْ وَهُمْ فَاسِقُونَ ٨٤ وَلاَ تُعْجِبْكَ أَمْوَالُهُمْ وَأَوْلادُهُمْ إِنَّمَا يُرِيدُ اللَّهُ أَن يُعَذِّبَهُم بِهَا فِي الدُّنْيَا وَتَزْهَقَ أَنفُسُهُمْ وَهُمْ كَافِرُونَ ٨٥"
                ]},
                {
                    "id": 35,
                    "question": "من مواقف المنافقين: عند نزول سورة تأمر بالإيمان والجهاد يستأذن القادرون منهم للقعود، ويرضون بالذّلّة على خلاف المؤمنين المجاهدين، والثّناء عليهم وبيان ما أعدّ لهم من جزاء",
                    "ayat":[ "وَإِذَا أُنزِلَتْ سُورَةٌ أَنْ آمِنُواْ بِاللَّهِ وَجَاهِدُواْ مَعَ رَسُولِهِ اسْتَأْذَنَكَ أُوْلُواْ الطَّوْلِ مِنْهُمْ وَقَالُواْ ذَرْنَا نَكُن مَّعَ الْقَاعِدِينَ ٨٦ رَضُواْ بِأَن يَكُونُواْ مَعَ الْخَوَالِفِ وَطُبِعَ عَلَى قُلُوبِهِمْ فَهُمْ لاَ يَفْقَهُونَ ٨٧ لَكِنِ الرَّسُولُ وَالَّذِينَ آمَنُواْ مَعَهُ جَاهَدُواْ بِأَمْوَالِهِمْ وَأَنفُسِهِمْ وَأُولَئِكَ لَهُمُ الْخَيْرَاتُ وَأُولَئِكَ هُمُ الْمُفْلِحُونَ ٨٨ أَعَدَّ اللَّهُ لَهُمْ جَنَّاتٍ تَجْرِي مِن تَحْتِهَا الأَنْهَارُ خَالِدِينَ فِيهَا ذَلِكَ الْفَوْزُ الْعَظِيمُ ٨٩"
                ]},
                {
                    "id": 36,
                    "question": "استئذان أصحاب الأعذار من الأعراب، وقعود المنافقين منهم، وتوعّدهم بالعذاب ",
                    "ayat":[ "وَجَاءَ الْمُعَذِّرُونَ مِنَ الأَعْرَابِ لِيُؤْذَنَ لَهُمْ وَقَعَدَ الَّذِينَ كَذَبُواْ اللَّهَ وَرَسُولَهُ سَيُصِيبُ الَّذِينَ كَفَرُواْ مِنْهُمْ عَذَابٌ أَلِيمٌ ٩٠"
                ]},
                {
                    "id": 37,
                    "question": "بيان أصناف المعذورين من الجهاد، واللّوم والعقاب لمن يستأذن مع القدرة ويرضى بالذّلّة ",
                    "ayat":[ "٩لَّيْسَ عَلَى الضُّعَفَاء وَلاَ عَلَى الْمَرْضَى وَلاَ عَلَى الَّذِينَ لاَ يَجِدُونَ مَا يُنفِقُونَ حَرَجٌ إِذَا نَصَحُواْ لِلَّهِ وَرَسُولِهِ مَا عَلَى الْمُحْسِنِينَ مِن سَبِيلٍ وَاللَّهُ غَفُورٌ رَّحِيمٌ ٩١ وَلاَ عَلَى الَّذِينَ إِذَا مَا أَتَوْكَ لِتَحْمِلَهُمْ قُلْتَ لاَ أَجِدُ مَا أَحْمِلُكُمْ عَلَيْهِ تَوَلَّوْا وَّأَعْيُنُهُمْ تَفِيضُ مِنَ الدَّمْعِ حَزَنًا أَلاَّ يَجِدُواْ مَا يُنفِقُونَ ٩٢ إِنَّمَا السَّبِيلُ عَلَى الَّذِينَ يَسْتَأْذِنُونَكَ وَهُمْ أَغْنِيَاء رَضُواْ بِأَن يَكُونُواْ مَعَ الْخَوَالِفِ وَطَبَعَ اللَّهُ عَلَى قُلُوبِهِمْ فَهُمْ لاَ يَعْلَمُونَ ٣"
                ]},
                {
                    "id": 38,
                    "question": "الإخبار بأنّ المنافقين سيعتذرون للمؤمنين بعد رجوعهم والرّدّ عليهم ",
                    "ayat":[ "يَعْتَذِرُونَ إِلَيْكُمْ إِذَا رَجَعْتُمْ إِلَيْهِمْ قُل لاَّ تَعْتَذِرُواْ لَن نُّؤْمِنَ لَكُمْ قَدْ نَبَّأَنَا اللَّهُ مِنْ أَخْبَارِكُمْ وَسَيَرَى اللَّهُ عَمَلَكُمْ وَرَسُولُهُ ثُمَّ تُرَدُّونَ إِلَى عَالِمِ الْغَيْبِ وَالشَّهَادَةِ فَيُنَبِّئُكُم بِمَا كُنتُمْ تَعْمَلُونَ ٩٤"
                ]},
                {
                    "id": 39,
                    "question": "الإخبار بأنّهم سيؤكّدون أعذارهم بالأيمان الفاجرة، وأمر المؤمنين بالإعراض عنهم، وبيان جزائهم ",
                    "ayat":[ "سَيَحْلِفُونَ بِاللَّهِ لَكُمْ إِذَا انقَلَبْتُمْ إِلَيْهِمْ لِتُعْرِضُواْ عَنْهُمْ فَأَعْرِضُواْ عَنْهُمْ إِنَّهُمْ رِجْسٌ وَمَأْوَاهُمْ جَهَنَّمُ جَزَاء بِمَا كَانُواْ يَكْسِبُونَ ٩٥"
                ]},
                {
                    "id": 40,
                    "question": "بيان سبب حلفهم، وتحذير المسلمين من الرضى عنهم ",
                    "ayat":[ "يَحْلِفُونَ لَكُمْ لِتَرْضَوْا عَنْهُمْ فَإِن تَرْضَوْا عَنْهُمْ فَإِنَّ اللَّهَ لاَ يَرْضَى عَنِ الْقَوْمِ الْفَاسِقِينَ ٩٦ الأَعْرَابُ أَشَدُّ كُفْرًا وَنِفَاقًا وَأَجْدَرُ أَلاَّ يَعْلَمُواْ حُدُودَ مَا أَنزَلَ اللَّهُ عَلَى رَسُولِهِ وَاللَّهُ عَلِيمٌ حَكِيمٌ ٩٧"
                ]},
                {
                    "id": 41,
                    "question": "كفّار الأعراب ومنافقيهم وبيان جهلهم، وحقيقة نفقاتهم وحسدهم للمسلمين ",
                    "ayat":[ "وَمِنَ الأَعْرَابِ مَن يَتَّخِذُ مَا يُنفِقُ مَغْرَمًا وَيَتَرَبَّصُ بِكُمُ الدَّوَائِرَ عَلَيْهِمْ دَائِرَةُ السَّوْءِ وَاللَّهُ سَمِيعٌ عَلِيمٌ ٩٨"
                ]},
                {
                    "id": 42,
                    "question": "مؤمنوا الأعراب، إيمانهم، ونفقاتهم، وجزاؤهم ",
                    "ayat":[ "وَمِنَ الأَعْرَابِ مَن يُؤْمِنُ بِاللَّهِ وَالْيَوْمِ الآخِرِ وَيَتَّخِذُ مَا يُنفِقُ قُرُبَاتٍ عِندَ اللَّهِ وَصَلَوَاتِ الرَّسُولِ أَلا إِنَّهَا قُرْبَةٌ لَّهُمْ سَيُدْخِلُهُمُ اللَّهُ فِي رَحْمَتِهِ إِنَّ اللَّهَ غَفُورٌ رَّحِيمٌ ٩٩"
                ]},
                {
                    "id": 43,
                    "question": "المهاجرون والأنصار ومن اتبعهم؛ رضا الله عنهم، ورضاهم عنه، وجزاؤهم ",
                    "ayat":[ "وَالسَّابِقُونَ الأَوَّلُونَ مِنَ الْمُهَاجِرِينَ وَالأَنصَارِ وَالَّذِينَ اتَّبَعُوهُم بِإِحْسَانٍ رَّضِيَ اللَّهُ عَنْهُمْ وَرَضُواْ عَنْهُ وَأَعَدَّ لَهُمْ جَنَّاتٍ تَجْرِي تَحْتَهَا الأَنْهَارُ خَالِدِينَ فِيهَا أَبَدًا ذَلِكَ الْفَوْزُ الْعَظِيمُ ١٠٠"
                ]},
                {
                    "id": 44,
                    "question": "منافقو الأعراب والمدينة المتمردون فيه، علم الله بهم، وتوعّدهم بعذاب الدّنيا والآخرة ",
                    "ayat":[ "وَمِمَّنْ حَوْلَكُم مِّنَ الأَعْرَابِ مُنَافِقُونَ وَمِنْ أَهْلِ الْمَدِينَةِ مَرَدُواْ عَلَى النِّفَاقِ لاَ تَعْلَمُهُمْ نَحْنُ نَعْلَمُهُمْ سَنُعَذِّبُهُم مَّرَّتَيْنِ ثُمَّ يُرَدُّونَ إِلَى عَذَابٍ عَظِيمٍ ١٠١"
                ]},
                {
                    "id": 45,
                    "question": "المعترفون بذنوبهم في تخلّفهم عن رسول الله ﷺ ، وحكم الله فيهم، وأمر النّبيّ ﷺ  بقبول صدقاتهم والاستغفار لهم والتّنبيه إلى أنّ قبول التّوبة والصّدقات لله وحده والأمر بإخلاص العمل لله تعالى ",
                    "ayat":[ "وَآخَرُونَ اعْتَرَفُواْ بِذُنُوبِهِمْ خَلَطُواْ عَمَلاً صَالِحًا وَآخَرَ سَيِّئًا عَسَى اللَّهُ أَن يَتُوبَ عَلَيْهِمْ إِنَّ اللَّهَ غَفُورٌ رَّحِيمٌ ١٠٢ خُذْ مِنْ أَمْوَالِهِمْ صَدَقَةً تُطَهِّرُهُمْ وَتُزَكِّيهِم بِهَا وَصَلِّ عَلَيْهِمْ إِنَّ صَلاتَكَ سَكَنٌ لَّهُمْ وَاللَّهُ سَمِيعٌ عَلِيمٌ ١٠٣ أَلَمْ يَعْلَمُواْ أَنَّ اللَّهَ هُوَ يَقْبَلُ التَّوْبَةَ عَنْ عِبَادِهِ وَيَأْخُذُ الصَّدَقَاتِ وَأَنَّ اللَّهَ هُوَ التَّوَّابُ الرَّحِيمُ ١٠٤ وَقُلِ اعْمَلُواْ فَسَيَرَى اللَّهُ عَمَلَكُمْ وَرَسُولُهُ وَالْمُؤْمِنُونَ وَسَتُرَدُّونَ إِلَى عَالِمِ الْغَيْبِ وَالشَّهَادَةِ فَيُنَبِّئُكُم بِمَا كُنتُمْ تَعْمَلُونَ ١٠٥"
                ]},
                {
                    "id": 46,
                    "question": "من لم يعتذر لله تعالى أمره مرجى لأمر الله الله تعالى ",
                    "ayat":[ "وَآخَرُونَ مُرْجَوْنَ لِأَمْرِ اللَّهِ إِمَّا يُعَذِّبُهُمْ وَإِمَّا يَتُوبُ عَلَيْهِمْ وَاللَّهُ عَلِيمٌ حَكِيمٌ ١٠٦"
                ]},
                {
                    "id": 47,
                    "question": "بناء المنافقين لمسجد الضّرار وأهدافه وشهادة الله بكذبهم ",
                    "ayat":[ "وَالَّذِينَ اتَّخَذُواْ مَسْجِدًا ضِرَارًا وَكُفْرًا وَتَفْرِيقًا بَيْنَ الْمُؤْمِنِينَ وَإِرْصَادًا لِّمَنْ حَارَبَ اللَّهَ وَرَسُولَهُ مِن قَبْلُ وَلَيَحْلِفُنَّ إِنْ أَرَدْنَا إِلاَّ الْحُسْنَى وَاللَّهُ يَشْهَدُ إِنَّهُمْ لَكَاذِبُونَ ١٠٧"
                ]},
                {
                    "id": 48,
                    "question": "نهي النّبيّ ﷺ عن الصّلاة فيه، وتكريم مسجد قباء ورواده ",
                    "ayat":[ "لاَ تَقُمْ فِيهِ أَبَدًا لَّمَسْجِدٌ أُسِّسَ عَلَى التَّقْوَى مِنْ أَوَّلِ يَوْمٍ أَحَقُّ أَن تَقُومَ فِيهِ فِيهِ رِجَالٌ يُحِبُّونَ أَن يَتَطَهَّرُواْ وَاللَّهُ يُحِبُّ الْمُطَّهِّرِينَ ١٠٨"
                ]},
                {
                    "id": 49,
                    "question": "المفارقة بين أساس التّقوى وأساس النّفاق، وبيان أثر بناء مسجد الضّرار على المنافقين في الدّنيا والآخرة",
                    "ayat":[ "أَفَمَنْ أَسَّسَ بُنْيَانَهُ عَلَى تَقْوَى مِنَ اللَّهِ وَرِضْوَانٍ خَيْرٌ أَم مَّنْ أَسَّسَ بُنْيَانَهُ عَلَىَ شَفَا جُرُفٍ هَارٍ فَانْهَارَ بِهِ فِي نَارِ جَهَنَّمَ وَاللَّهُ لاَ يَهْدِي الْقَوْمَ الظَّالِمِينَ ١٠٩ لاَ يَزَالُ بُنْيَانُهُمُ الَّذِي بَنَوْا رِيبَةً فِي قُلُوبِهِمْ إِلاَّ أَن تَقَطَّعَ قُلُوبُهُمْ وَاللَّهُ عَلِيمٌ حَكِيمٌ ١١٠"
                ]},
                {
                    "id": 50,
                    "question": "شراء وبيع بين الله والمجاهدين، ووعد وبشارة بالفوز العظيم والثّناء على المؤمنين بثمانية أوصاف ",
                    "ayat":[ "١إِنَّ اللَّهَ اشْتَرَى مِنَ الْمُؤْمِنِينَ أَنفُسَهُمْ وَأَمْوَالَهُم بِأَنَّ لَهُمُ الْجَنَّةَ يُقَاتِلُونَ فِي سَبِيلِ اللَّهِ فَيَقْتُلُونَ وَيُقْتَلُونَ وَعْدًا عَلَيْهِ حَقًّا فِي التَّوْرَاةِ وَالإِنجِيلِ وَالْقُرْآنِ وَمَنْ أَوْفَى بِعَهْدِهِ مِنَ اللَّهِ فَاسْتَبْشِرُواْ بِبَيْعِكُمُ الَّذِي بَايَعْتُم بِهِ وَذَلِكَ هُوَ الْفَوْزُ الْعَظِيمُ ١١١ التَّائِبُونَ الْعَابِدُونَ الْحَامِدُونَ السَّائِحُونَ الرَّاكِعُونَ السَّاجِدُونَ الآمِرُونَ بِالْمَعْرُوفِ وَالنَّاهُونَ عَنِ الْمُنكَرِ وَالْحَافِظُونَ لِحُدُودِ اللَّهِ وَبَشِّرِ الْمُؤْمِنِينَ ١٢"
                ]},
                {
                    "id": 51,
                    "question": "منع النّبيّ ﷺ والمؤمنين من الاستغفار للمشركين وبيان وجه استغفار إبراهيم والثّناء عليه",
                    "ayat":[ "مَا كَانَ لِلنَّبِيِّ وَالَّذِينَ آمَنُواْ أَن يَسْتَغْفِرُواْ لِلْمُشْرِكِينَ وَلَوْ كَانُواْ أُولِي قُرْبَى مِن بَعْدِ مَا تَبَيَّنَ لَهُمْ أَنَّهُمْ أَصْحَابُ الْجَحِيمِ ١١٣ وَمَا كَانَ اسْتِغْفَارُ إِبْرَاهِيمَ لِأَبِيهِ إِلاَّ عَن مَّوْعِدَةٍ وَعَدَهَا إِيَّاهُ فَلَمَّا تَبَيَّنَ لَهُ أَنَّهُ عَدُوٌّ لِلَّهِ تَبَرَّأَ مِنْهُ إِنَّ إِبْرَاهِيمَ لَأَوَّاهٌ حَلِيمٌ ١١٤"
                ]},
                {
                    "id": 52,
                    "question": "امتناع إضلال الله لقوم حتى يبين لهم، وبيان علم الله وملكه وقدرته ونصرته ",
                    "ayat":[ "وَمَا كَانَ اللَّهُ لِيُضِلَّ قَوْمًا بَعْدَ إِذْ هَدَاهُمْ حَتَّى يُبَيِّنَ لَهُم مَّا يَتَّقُونَ إِنَّ اللَّهَ بِكُلِّ شَيْءٍ عَلِيمٌ ١١٥ إِنَّ اللَّهَ لَهُ مُلْكُ السَّمَاوَاتِ وَالأَرْضِ يُحْيِي وَيُمِيتُ وَمَا لَكُم مِّن دُونِ اللَّهِ مِن وَلِيٍّ وَلاَ نَصِيرٍ ١١٦"
                ]},
                {
                    "id": 53,
                    "question": "توبة الله على النّبيّ ﷺ والمهاجرين والأنصار ممن اتبعه في غزوة تبوك، وعلى الثّلاثة الّذين خلفوا ، وتوجيه المؤمنين إلى التّقوى والصّدق ",
                    "ayat":[ "لَقَد تَّابَ اللَّه عَلَى النَّبِيِّ وَالْمُهَاجِرِينَ وَالأَنصَارِ الَّذِينَ اتَّبَعُوهُ فِي سَاعَةِ الْعُسْرَةِ مِن بَعْدِ مَا كَادَ يَزِيغُ قُلُوبُ فَرِيقٍ مِّنْهُمْ ثُمَّ تَابَ عَلَيْهِمْ إِنَّهُ بِهِمْ رَؤُوفٌ رَّحِيمٌ ١١٧ وَعَلَى الثَّلاثَةِ الَّذِينَ خُلِّفُواْ حَتَّى إِذَا ضَاقَتْ عَلَيْهِمُ الأَرْضُ بِمَا رَحُبَتْ وَضَاقَتْ عَلَيْهِمْ أَنفُسُهُمْ وَظَنُّواْ أَن لاَّ مَلْجَأَ مِنَ اللَّهِ إِلاَّ إِلَيْهِ ثُمَّ تَابَ عَلَيْهِمْ لِيَتُوبُواْ إِنَّ اللَّهَ هُوَ التَّوَّابُ الرَّحِيمُ ١١٨ يَا أَيُّهَا الَّذِينَ آمَنُواْ اتَّقُواْ اللَّهَ وَكُونُواْ مَعَ الصَّادِقِينَ ١١٩"
                ]},
                {
                    "id": 54,
                    "question": "منع التّخلّف عن رسول الله ﷺ، وأسباب ذلك ",
                    "ayat":[ "مَا كَانَ لِأَهْلِ الْمَدِينَةِ وَمَنْ حَوْلَهُم مِّنَ الأَعْرَابِ أَن يَتَخَلَّفُواْ عَن رَّسُولِ اللَّهِ وَلاَ يَرْغَبُواْ بِأَنفُسِهِمْ عَن نَّفْسِهِ ذَلِكَ بِأَنَّهُمْ لاَ يُصِيبُهُمْ ظَمَأٌ وَلاَ نَصَبٌ وَلاَ مَخْمَصَةٌ فِي سَبِيلِ اللَّهِ وَلاَ يَطَؤُونَ مَوْطِئًا يَغِيظُ الْكُفَّارَ وَلاَ يَنَالُونَ مِنْ عَدُوٍّ نَّيْلاً إِلاَّ كُتِبَ لَهُم بِهِ عَمَلٌ صَالِحٌ إِنَّ اللَّهَ لاَ يُضِيعُ أَجْرَ الْمُحْسِنِينَ ١٢٠ وَلاَ يُنفِقُونَ نَفَقَةً صَغِيرَةً وَلاَ كَبِيرَةً وَلاَ يَقْطَعُونَ وَادِيًا إِلاَّ كُتِبَ لَهُمْ لِيَجْزِيَهُمُ اللَّهُ أَحْسَنَ مَا كَانُواْ يَعْمَلُونَ ١٢١"
                ]},
                {
                    "id": 55,
                    "question": "منع نفير المؤمنين كافّة، والحثّ على نفور طوائف من المسلمين للتّفقّه والإنذار ",
                    "ayat":[ "وَمَا كَانَ الْمُؤْمِنُونَ لِيَنفِرُواْ كَافَّةً فَلَوْلاَ نَفَرَ مِن كُلِّ فِرْقَةٍ مِّنْهُمْ طَائِفَةٌ لِّيَتَفَقَّهُواْ فِي الدِّينِ وَلِيُنذِرُواْ قَوْمَهُمْ إِذَا رَجَعُواْ إِلَيْهِمْ لَعَلَّهُمْ يَحْذَرُونَ ١٢٢"
                ]},
                {
                    "id": 56,
                    "question": "أمر المؤمنين بقتال الكفّار الأقرب فالأقرب والغلظة عليهم ",
                    "ayat":[ "يَا أَيُّهَا الَّذِينَ آمَنُواْ قَاتِلُواْ الَّذِينَ يَلُونَكُم مِّنَ الْكُفَّارِ وَلْيَجِدُواْ فِيكُمْ غِلْظَةً وَاعْلَمُواْ أَنَّ اللَّهَ مَعَ الْمُتَّقِينَ ١٢٣"
                ]},
                {
                    "id": 57,
                    "question": "أقوال المنافقين عند نزول سور القرآن، وأثر نزولها على المؤمنين والمنافقين، وتربيخ المنافقين لعدم توبتهم واتّعاظهم بعد فتنتهم ",
                    "ayat":[ "وَإِذَا مَا أُنزِلَتْ سُورَةٌ فَمِنْهُم مَّن يَقُولُ أَيُّكُمْ زَادَتْهُ هَذِهِ إِيمَانًا فَأَمَّا الَّذِينَ آمَنُواْ فَزَادَتْهُمْ إِيمَانًا وَهُمْ يَسْتَبْشِرُونَ ١٢٤ وَأَمَّا الَّذِينَ فِي قُلُوبِهِم مَّرَضٌ فَزَادَتْهُمْ رِجْسًا إِلَى رِجْسِهِمْ وَمَاتُواْ وَهُمْ كَافِرُونَ ١٢٥ أَوَلاَ يَرَوْنَ أَنَّهُمْ يُفْتَنُونَ فِي كُلِّ عَامٍ مَّرَّةً أَوْ مَرَّتَيْنِ ثُمَّ لاَ يَتُوبُونَ وَلاَ هُمْ يَذَّكَّرُونَ ١٢٦"
                ]},
                {
                    "id": 58,
                    "question": "أفعال المنافقين عند نزول سور القرآن، والدّعاء عليهم لعدم فقههم ",
                    "ayat":[ "وَإِذَا مَا أُنزِلَتْ سُورَةٌ نَّظَرَ بَعْضُهُمْ إِلَى بَعْضٍ هَلْ يَرَاكُم مِّنْ أَحَدٍ ثُمَّ انصَرَفُواْ صَرَفَ اللَّهُ قُلُوبَهُم بِأَنَّهُمْ قَوْمٌ لاَّ يَفْقَهُون ١٢٧"
                ]},
                {
                    "id": 59,
                    "question": "الخاتمة: المنّة بإرسال الرّسول ﷺ ووصفه بخمس أوصاف، وتثبيته في وجه المتولّين",
                    "ayat":[ "لَقَدْ جَاءَكُمْ رَسُولٌ مِّنْ أَنفُسِكُمْ عَزِيزٌ عَلَيْهِ مَا عَنِتُّمْ حَرِيصٌ عَلَيْكُم بِالْمُؤْمِنِينَ رَؤُوفٌ رَّحِيمٌ ١٢٨ فَإِن تَوَلَّوْا فَقُلْ حَسْبِيَ اللَّهُ لا إِلَهَ إِلاَّ هُوَ عَلَيْهِ تَوَكَّلْتُ وَهُوَ رَبُّ الْعَرْشِ الْعَظِيم ١٢٩"
                    ]
                }
            ]            
        },
        {
            "sura":"يونس",
            "questions":[
                {
                    "id":1,
                    "question":"أربعة أوصاف تأوي بصاحبها إلى النار، وإيمان يهدي إلى الجنات، ودعاء المؤمنين وتحيتهم، وامتناع تعجيل الله الشر للناس ",
                    "ayat":["إِنَّ الَّذِينَ لاَ يَرْجُونَ لِقَاءَنَا وَرَضُواْ بِالْحَيَاةِ الدُّنْيَا وَاطْمَأَنُّواْ بِهَا وَالَّذِينَ هُمْ عَنْ آيَاتِنَا غَافِلُونَ ٧ أُوْلَئِكَ مَأْوَاهُمُ النَّارُ بِمَا كَانُواْ يَكْسِبُونَ ٨ إِنَّ الَّذِينَ آمَنُواْ وَعَمِلُواْ الصَّالِحَاتِ يَهْدِيهِمْ رَبُّهُمْ بِإِيمَانِهِمْ تَجْرِي مِن تَحْتِهِمُ الأَنْهَارُ فِي جَنَّاتِ النَّعِيمِ ٩ دَعْوَاهُمْ فِيهَا سُبْحَانَكَ اللَّهُمَّ وَتَحِيَّتُهُمْ فِيهَا سَلامٌ وَآخِرُ دَعْوَاهُمْ أَنِ الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ ١٠ وَلَوْ يُعَجِّلُ اللَّهُ لِلنَّاسِ الشَّرَّ اسْتِعْجَالَهُم بِالْخَيْرِ لَقُضِيَ إِلَيْهِمْ أَجَلُهُمْ فَنَذَرُ الَّذِينَ لاَ يَرْجُونَ لِقَاءَنَا فِي طُغْيَانِهِمْ يَعْمَهُونَ ١١"]
                },
                {
                    "id":2,
                    "question":"حال الناس عند مس الضر، وبعد كشفه، تهديد واستخلاف",
                    "ayat":["وَإِذَا مَسَّ الإِنسَانَ الضُّرُّ دَعَانَا لِجَنبِهِ أَوْ قَاعِدًا أَوْ قَائِمًا فَلَمَّا كَشَفْنَا عَنْهُ ضُرَّهُ مَرَّ كَأَن لَّمْ يَدْعُنَا إِلَى ضُرٍّ مَّسَّهُ كَذَلِكَ زُيِّنَ لِلْمُسْرِفِينَ مَا كَانُواْ يَعْمَلُونَ ١٢ وَلَقَدْ أَهْلَكْنَا الْقُرُونَ مِن قَبْلِكُمْ لَمَّا ظَلَمُواْ وَجَاءَتْهُمْ رُسُلُهُم بِالْبَيِّنَاتِ وَمَا كَانُواْ لِيُؤْمِنُواْ كَذَلِكَ نَجْزِي الْقَوْمَ الْمُجْرِمِينَ ١٣ ثُمَّ جَعَلْنَاكُمْ خَلائِفَ فِي الأَرْضِ مِن بَعْدِهِم لِنَنظُرَ كَيْفَ تَعْمَلُونَ ١٤"]
                },
                {
                    "id":3,
                    "question":"من أقوال الكفار حول القرآن ",
                    "ayat":["وَإِذَا تُتْلَى عَلَيْهِمْ آيَاتُنَا بَيِّنَاتٍ قَالَ الَّذِينَ لاَ يَرْجُونَ لِقَاءَنَا ائْتِ بِقُرْآنٍ غَيْرِ هَذَا أَوْ بَدِّلْهُ قُلْ مَا يَكُونُ لِي أَنْ أُبَدِّلَهُ مِن تِلْقَاء نَفْسِي إِنْ أَتَّبِعُ إِلاَّ مَا يُوحَى إِلَيَّ إِنِّي أَخَافُ إِنْ عَصَيْتُ رَبِّي عَذَابَ يَوْمٍ عَظِيمٍ ١٥ قُل لَّوْ شَاء اللَّهُ مَا تَلَوْتُهُ عَلَيْكُمْ وَلاَ أَدْرَاكُم بِهِ فَقَدْ لَبِثْتُ فِيكُمْ عُمُرًا مِّن قَبْلِهِ أَفَلاَ تَعْقِلُونَ ١٦ فَمَنْ أَظْلَمُ مِمَّنِ افْتَرَى عَلَى اللَّهِ كَذِبًا أَوْ كَذَّبَ بِآيَاتِهِ إِنَّهُ لاَ يُفْلِحُ الْمُجْرِمُونَ ١٧ وَيَعْبُدُونَ مِن دُونِ اللَّهِ مَا لاَ يَضُرُّهُمْ وَلاَ يَنفَعُهُمْ وَيَقُولُونَ هَؤُلاء شُفَعَاؤُنَا عِندَ اللَّهِ قُلْ أَتُنَبِّئُونَ اللَّهَ بِمَا لاَ يَعْلَمُ فِي السَّمَاوَاتِ وَلاَ فِي الأَرْضِ سُبْحَانَهُ وَتَعَالَى عَمَّا يُشْرِكُونَ ١٨ وَمَا كَانَ النَّاسُ إِلاَّ أُمَّةً وَاحِدَةً فَاخْتَلَفُواْ وَلَوْلاَ كَلِمَةٌ سَبَقَتْ مِن رَّبِّكَ لَقُضِيَ بَيْنَهُمْ فِيمَا فِيهِ يَخْتَلِفُونَ ١٩  وَيَقُولُونَ لَوْلاَ أُنزِلَ عَلَيْهِ آيَةٌ مِّن رَّبِّهِ فَقُلْ إِنَّمَا الْغَيْبُ لِلَّهِ فَانتَظِرُواْ إِنِّي مَعَكُم مِّنَ الْمُنتَظِرِينَ ٢٠"]
                },
                {
                    "id":4,
                    "question":"مقابلة الرحمة بعد الضراء بالمكر، ونموذج من مكرهم ",
                    "ayat":["وَإِذَا أَذَقْنَا النَّاسَ رَحْمَةً مِّن بَعْدِ ضَرَّاء مَسَّتْهُمْ إِذَا لَهُم مَّكْرٌ فِي آيَاتِنَا قُلِ اللَّهُ أَسْرَعُ مَكْرًا إِنَّ رُسُلَنَا يَكْتُبُونَ مَا تَمْكُرُونَ ٢١ هُوَ الَّذِي يُسَيِّرُكُمْ فِي الْبَرِّ وَالْبَحْرِ حَتَّى إِذَا كُنتُمْ فِي الْفُلْكِ وَجَرَيْنَ بِهِم بِرِيحٍ طَيِّبَةٍ وَفَرِحُواْ بِهَا جَاءَتْهَا رِيحٌ عَاصِفٌ وَجَاءَهُمُ الْمَوْجُ مِن كُلِّ مَكَانٍ وَظَنُّواْ أَنَّهُمْ أُحِيطَ بِهِمْ دَعَوُاْ اللَّهَ مُخْلِصِينَ لَهُ الدِّينَ لَئِنْ أَنجَيْتَنَا مِنْ هَذِهِ لَنَكُونَنِّ مِنَ الشَّاكِرِينَ ٢٢ فَلَمَّا أَنجَاهُمْ إِذَا هُمْ يَبْغُونَ فِي الأَرْضِ بِغَيْرِ الْحَقِّ يَا أَيُّهَا النَّاسُ إِنَّمَا بَغْيُكُمْ عَلَى أَنفُسِكُم مَّتَاعَ الْحَيَاةِ الدُّنْيَا ثُمَّ إِلَيْنَا مَرْجِعُكُمْ فَنُنَبِّئُكُم بِمَا كُنتُمْ تَعْمَلُونَ ٢٣"]
                },
                {
                    "id":5,
                    "question":"ضرب مثل للحياة الدنيا، ودعوة إلى دار السلام",
                    "ayat":["إِنَّمَا مَثَلُ الْحَيَاةِ الدُّنْيَا كَمَاء أَنزَلْنَاهُ مِنَ السَّمَاء فَاخْتَلَطَ بِهِ نَبَاتُ الأَرْضِ مِمَّا يَأْكُلُ النَّاسُ وَالأَنْعَامُ حَتَّىَ إِذَا أَخَذَتِ الأَرْضُ زُخْرُفَهَا وَازَّيَّنَتْ وَظَنَّ أَهْلُهَا أَنَّهُمْ قَادِرُونَ عَلَيْهَا أَتَاهَا أَمْرُنَا لَيْلاً أَوْ نَهَارًا فَجَعَلْنَاهَا حَصِيدًا كَأَن لَّمْ تَغْنَ بِالأَمْسِ كَذَلِكَ نُفَصِّلُ الآيَاتِ لِقَوْمٍ يَتَفَكَّرُونَ ٢٤ وَاللَّهُ يَدْعُو إِلَى دَارِ السَّلامِ وَيَهْدِي مَن يَشَاء إِلَى صِرَاطٍ مُّسْتَقِيمٍ ٢٥"]
                },
                {
                    "id":6,
                    "question":"الرد على استبطاء موعود الله ",
                    "ayat":["وَيَقُولُونَ مَتَى هَذَا الْوَعْدُ إِن كُنتُمْ صَادِقِينَ ٤٨ قُل لاَّ أَمْلِكُ لِنَفْسِي ضَرًّا وَلاَ نَفْعًا إِلاَّ مَا شَاء اللَّهُ لِكُلِّ أُمَّةٍ أَجَلٌ إِذَا جَاءَ أَجَلُهُمْ فَلاَ يَسْتَأْخِرُونَ سَاعَةً وَلاَ يَسْتَقْدِمُونَ ٤٩ قُلْ أَرَأَيْتُمْ إِنْ أَتَاكُمْ عَذَابُهُ بَيَاتًا أَوْ نَهَارًا مَّاذَا يَسْتَعْجِلُ مِنْهُ الْمُجْرِمُونَ ٥٠ أَثُمَّ إِذَا مَا وَقَعَ آمَنتُم بِهِ آلآنَ وَقَدْ كُنتُم بِهِ تَسْتَعْجِلُونَ ٥١ ثُمَّ قِيلَ لِلَّذِينَ ظَلَمُواْ ذُوقُواْ عَذَابَ الْخُلْدِ هَلْ تُجْزَوْنَ إِلاَّ بِمَا كُنتُمْ تَكْسِبُونَ ٥٢"]
                },
                {
                    "id":7,
                    "question":"استنباء الرسول عن ثبوت العذاب والرد بأربعة ردود ",
                    "ayat":["وَيَسْتَنبِئُونَكَ أَحَقٌّ هُوَ قُلْ إِي وَرَبِّي إِنَّهُ لَحَقٌّ وَمَا أَنتُمْ بِمُعْجِزِينَ ٥٣ وَلَوْ أَنَّ لِكُلِّ نَفْسٍ ظَلَمَتْ مَا فِي الأَرْضِ لافْتَدَتْ بِهِ وَأَسَرُّواْ النَّدَامَةَ لَمَّا رَأَوُاْ الْعَذَابَ وَقُضِيَ بَيْنَهُم بِالْقِسْطِ وَهُمْ لاَ يُظْلَمُونَ ٥٤ أَلا إِنَّ لِلَّهِ مَا فِي السَّمَاوَاتِ وَالأَرْضِ أَلاَ إِنَّ وَعْدَ اللَّهِ حَقٌّ وَلَكِنَّ أَكْثَرَهُمْ لاَ يَعْلَمُونَ ٥٥ هُوَ يُحْيِي وَيُمِيتُ وَإِلَيْهِ تُرْجَعُونَ ٥٦"]
                },
                {
                    "id":8,
                    "question":"نبأ نوح عليه السلام، وتعقيب ببعث الرسل من بعد نوح ",
                    "ayat":["وَاتْلُ عَلَيْهِمْ نَبَأَ نُوحٍ إِذْ قَالَ لِقَوْمِهِ يَا قَوْمِ إِن كَانَ كَبُرَ عَلَيْكُم مَّقَامِي وَتَذْكِيرِي بِآيَاتِ اللَّهِ فَعَلَى اللَّهِ تَوَكَّلْتُ فَأَجْمِعُواْ أَمْرَكُمْ وَشُرَكَاءَكُمْ ثُمَّ لاَ يَكُنْ أَمْرُكُمْ عَلَيْكُمْ غُمَّةً ثُمَّ اقْضُواْ إِلَيَّ وَلاَ تُنظِرُونِ ٧١ فَإِن تَوَلَّيْتُمْ فَمَا سَأَلْتُكُم مِّنْ أَجْرٍ إِنْ أَجْرِيَ إِلاَّ عَلَى اللَّهِ وَأُمِرْتُ أَنْ أَكُونَ مِنَ الْمُسْلِمِينَ ٧٢ فَكَذَّبُوهُ فَنَجَّيْنَاهُ وَمَن مَّعَهُ فِي الْفُلْكِ وَجَعَلْنَاهُمْ خَلائِفَ وَأَغْرَقْنَا الَّذِينَ كَذَّبُواْ بِآيَاتِنَا فَانظُرْ كَيْفَ كَانَ عَاقِبَةُ الْمُنذَرِينَ ٧٣ ثُمَّ بَعَثْنَا مِن بَعْدِهِ رُسُلاً إِلَى قَوْمِهِمْ فَجَاؤُوهُم بِالْبَيِّنَاتِ فَمَا كَانُواْ لِيُؤْمِنُواْ بِمَا كَذَّبُواْ بِهِ مِن قَبْلُ كَذَلِكَ نَطْبَعُ عَلَى قُلُوبِ الْمُعْتَدِينَ ٧٤"]
                },
                {
                    "id":9,
                    "question":"تعقيب بعد آيات بعثة موسى وهارون عليهما السلام، بتثبيت قلب النبي – صلى الله عليه وسلم –، وانتفاع قوم يونس بإيمانهم",
                    "ayat":["فَإِن كُنتَ فِي شَكٍّ مِّمَّا أَنزَلْنَا إِلَيْكَ فَاسْأَلِ الَّذِينَ يَقْرَؤُونَ الْكِتَابَ مِن قَبْلِكَ لَقَدْ جَاءَكَ الْحَقُّ مِن رَّبِّكَ فَلاَ تَكُونَنَّ مِنَ الْمُمْتَرِينَ ٩٤ وَلاَ تَكُونَنَّ مِنَ الَّذِينَ كَذَّبُواْ بِآيَاتِ اللَّهِ فَتَكُونَ مِنَ الْخَاسِرِينَ ٩٥ إِنَّ الَّذِينَ حَقَّتْ عَلَيْهِمْ كَلِمَتُ رَبِّكَ لاَ يُؤْمِنُونَ ٩٦ وَلَوْ جَاءَتْهُمْ كُلُّ آيَةٍ حَتَّى يَرَوُاْ الْعَذَابَ الأَلِيمَ ٩٧ فَلَوْلاَ كَانَتْ قَرْيَةٌ آمَنَتْ فَنَفَعَهَا إِيمَانُهَا إِلاَّ قَوْمَ يُونُسَ لَمَّا آمَنُواْ كَشَفْنَا عَنْهُمْ عَذَابَ الْخِزْيِ فِي الْحَيَاةَ الدُّنْيَا وَمَتَّعْنَاهُمْ إِلَى حِينٍ ٩٨"]
                },
                {
                    "id":10,
                    "question":"اعلانان للرسول – صلى الله عليه وسلم – للناس، والخاتمة توجيهات له صلى الله عليه وسلم",
                    "ayat":["قُلْ يَا أَيُّهَا النَّاسُ إِن كُنتُمْ فِي شَكٍّ مِّن دِينِي فَلاَ أَعْبُدُ الَّذِينَ تَعْبُدُونَ مِن دُونِ اللَّهِ وَلَكِنْ أَعْبُدُ اللَّهَ الَّذِي يَتَوَفَّاكُمْ وَأُمِرْتُ أَنْ أَكُونَ مِنَ الْمُؤْمِنِينَ ١٠٤ وَأَنْ أَقِمْ وَجْهَكَ لِلدِّينِ حَنِيفًا وَلاَ تَكُونَنَّ مِنَ الْمُشْرِكِينَ ١٠٥ وَلاَ تَدْعُ مِن دُونِ اللَّهِ مَا لاَ يَنفَعُكَ وَلاَ يَضُرُّكَ فَإِن فَعَلْتَ فَإِنَّكَ إِذًا مِّنَ الظَّالِمِينَ ١٠٦ وَإِن يَمْسَسْكَ اللَّهُ بِضُرٍّ فَلاَ كَاشِفَ لَهُ إِلاَّ هُوَ وَإِن يُرِدْكَ بِخَيْرٍ فَلاَ رَادَّ لِفَضْلِهِ يُصِيبُ بِهِ مَن يَشَاء مِنْ عِبَادِهِ وَهُوَ الْغَفُورُ الرَّحِيمُ ١٠٧ قُلْ يَا أَيُّهَا النَّاسُ قَدْ جَاءَكُمُ الْحَقُّ مِن رَّبِّكُمْ فَمَنِ اهْتَدَى فَإِنَّمَا يَهْتَدِي لِنَفْسِهِ وَمَن ضَلَّ فَإِنَّمَا يَضِلُّ عَلَيْهَا وَمَا أَنَاْ عَلَيْكُم بِوَكِيلٍ ١٠٨ وَاتَّبِعْ مَا يُوحَى إِلَيْكَ وَاصْبِرْ حَتَّىَ يَحْكُمَ اللَّهُ وَهُوَ خَيْرُ الْحَاكِمِينَ ١٠٩"]
                }
            ]
        },
        {
            "sura":"هود",
            "questions":[
                {
                    "id":1,
                    "question":"المقدمة: إحكام الكتاب ثم تفصيله، وبيان مهمة النبي – صىلى الله عليه وسلم",
                    "ayat":["الر كِتَابٌ أُحْكِمَتْ آيَاتُهُ ثُمَّ فُصِّلَتْ مِن لَّدُنْ حَكِيمٍ خَبِيرٍ ١ أَلاَّ تَعْبُدُواْ إِلاَّ اللَّهَ إِنَّنِي لَكُم مِّنْهُ نَذِيرٌ وَبَشِيرٌ ٢ وَأَنِ اسْتَغْفِرُواْ رَبَّكُمْ ثُمَّ تُوبُواْ إِلَيْهِ يُمَتِّعْكُم مَّتَاعًا حَسَنًا إِلَى أَجَلٍ مُّسَمًّى وَيُؤْتِ كُلَّ ذِي فَضْلٍ فَضْلَهُ وَإِن تَوَلَّوْا فَإِنِّيَ أَخَافُ عَلَيْكُمْ عَذَابَ يَوْمٍ كَبِيرٍ ٣ إِلَى اللَّهِ مَرْجِعُكُمْ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ ٤"]
                },
		        {
                    "id":2,
                    "question":"موقف الإنسان عند نزع الرحمة وعند ذوق النعمة واستثناء، ومن ثم حث النبي وتحذيره من التواني عن أمر الله والتأكيد على مهمته",
                    "ayat":["وَلَئِنْ أَذَقْنَا الإِنسَانَ مِنَّا رَحْمَةً ثُمَّ نَزَعْنَاهَا مِنْهُ إِنَّهُ لَيَئُوسٌ كَفُورٌ ٩ وَلَئِنْ أَذَقْنَاهُ نَعْمَاء بَعْدَ ضَرَّاء مَسَّتْهُ لَيَقُولَنَّ ذَهَبَ السَّيِّئَاتُ عَنِّي إِنَّهُ لَفَرِحٌ فَخُورٌ ١٠ إِلاَّ الَّذِينَ صَبَرُواْ وَعَمِلُواْ الصَّالِحَاتِ أُوْلَئِكَ لَهُم مَّغْفِرَةٌ وَأَجْرٌ كَبِيرٌ ١١ فَلَعَلَّكَ تَارِكٌ بَعْضَ مَا يُوحَى إِلَيْكَ وَضَائِقٌ بِهِ صَدْرُكَ أَن يَقُولُواْ لَوْلاَ أُنزِلَ عَلَيْهِ كَنزٌ أَوْ جَاءَ مَعَهُ مَلَكٌ إِنَّمَا أَنتَ نَذِيرٌ وَاللَّهُ عَلَى كُلِّ شَيْءٍ وَكِيلٌ ١٢"]
                },
		        {
                    "id":3,
                    "question":"جزاء طالبي الحياة الدنيا في الدارين وعدم تساويهم مع من يعلم صدق القرآن ب٣ دلائل، وتثبيت النبي على الحق",
                    "ayat":["مَن كَانَ يُرِيدُ الْحَيَاةَ الدُّنْيَا وَزِينَتَهَا نُوَفِّ إِلَيْهِمْ أَعْمَالَهُمْ فِيهَا وَهُمْ فِيهَا لاَ يُبْخَسُونَ ١٥ أُوْلَئِكَ الَّذِينَ لَيْسَ لَهُمْ فِي الآخِرَةِ إِلاَّ النَّارُ وَحَبِطَ مَا صَنَعُواْ فِيهَا وَبَاطِلٌ مَّا كَانُواْ يَعْمَلُونَ ١٦ أَفَمَن كَانَ عَلَى بَيِّنَةٍ مِّن رَّبِّهِ وَيَتْلُوهُ شَاهِدٌ مِّنْهُ وَمِن قَبْلِهِ كِتَابُ مُوسَى إِمَامًا وَرَحْمَةً أُوْلَئِكَ يُؤْمِنُونَ بِهِ وَمَن يَكْفُرْ بِهِ مِنَ الأَحْزَابِ فَالنَّارُ مَوْعِدُهُ فَلاَ تَكُ فِي مِرْيَةٍ مِّنْهُ إِنَّهُ الْحَقُّ مِن رَّبِّكَ وَلَكِنَّ أَكْثَرَ النَّاسِ لاَ يُؤْمِنُونَ ١٧"]
                },
		        {
                    "id":4,
                    "question":"ظلم مفتري الكذب وتعريفهم وجزاؤهم",
                    "ayat":["وَمَنْ أَظْلَمُ مِمَّنِ افْتَرَى عَلَى اللَّهِ كَذِبًا أُوْلَئِكَ يُعْرَضُونَ عَلَى رَبِّهِمْ وَيَقُولُ الأَشْهَادُ هَؤُلاء الَّذِينَ كَذَبُواْ عَلَى رَبِّهِمْ أَلاَ لَعْنَةُ اللَّهِ عَلَى الظَّالِمِينَ ١٨ الَّذِينَ يَصُدُّونَ عَن سَبِيلِ اللَّهِ وَيَبْغُونَهَا عِوَجًا وَهُم بِالآخِرَةِ هُمْ كَافِرُونَ ١٩ أُوْلَئِكَ لَمْ يَكُونُواْ مُعْجِزِينَ فِي الأَرْضِ وَمَا كَانَ لَهُم مِّن دُونِ اللَّهِ مِنْ أَوْلِيَاء يُضَاعَفُ لَهُمُ الْعَذَابُ مَا كَانُواْ يَسْتَطِيعُونَ السَّمْعَ وَمَا كَانُواْ يُبْصِرُونَ  ٢٠ أُوْلَئِكَ الَّذِينَ خَسِرُواْ أَنفُسَهُمْ وَضَلَّ عَنْهُم مَّا كَانُواْ يَفْتَرُونَ ٢١ لاَ جَرَمَ أَنَّهُمْ فِي الآخِرَةِ هُمُ الأَخْسَرُونَ ٢٢"]
                },
		        {
                    "id":5,
                    "question":"رد نوح على شبهات قومه الثلاث",
                    "ayat":["قَالَ يَا قَوْمِ أَرَأَيْتُمْ إِن كُنتُ عَلَى بَيِّنَةٍ مِّن رَّبِّيَ وَآتَانِي رَحْمَةً مِّنْ عِندِهِ فَعُمِّيَتْ عَلَيْكُمْ أَنُلْزِمُكُمُوهَا وَأَنتُمْ لَهَا كَارِهُونَ ٢٨ وَيَا قَوْمِ لا أَسْأَلُكُمْ عَلَيْهِ مَالاً إِنْ أَجْرِيَ إِلاَّ عَلَى اللَّهِ وَمَا أَنَاْ بِطَارِدِ الَّذِينَ آمَنُواْ إِنَّهُم مُّلاقُوا رَبِّهِمْ وَلَكِنِّيَ أَرَاكُمْ قَوْمًا تَجْهَلُونَ ٢٩ وَيَا قَوْمِ مَن يَنصُرُنِي مِنَ اللَّهِ إِن طَرَدتُّهُمْ أَفَلاَ تَذَكَّرُونَ ٣٠ وَلاَ أَقُولُ لَكُمْ عِندِي خَزَائِنُ اللَّهِ وَلاَ أَعْلَمُ الْغَيْبَ وَلاَ أَقُولُ إِنِّي مَلَكٌ وَلاَ أَقُولُ لِلَّذِينَ تَزْدَرِي أَعْيُنُكُمْ لَن يُؤْتِيَهُمُ اللَّهُ خَيْرًا اللَّهُ أَعْلَمُ بِمَا فِي أَنفُسِهِمْ إِنِّي إِذًا لَّمِنَ الظَّالِمِينَ ٣١"]
                },
		        {
                    "id":6,
                    "question":"صناعة الفلك، وسخرية القوم، وتحميل السفينة، ونداء نوح لابنه، ورده وغرقه",
                    "ayat":["وَيَصْنَعُ الْفُلْكَ وَكُلَّمَا مَرَّ عَلَيْهِ مَلأٌ مِّن قَوْمِهِ سَخِرُواْ مِنْهُ قَالَ إِن تَسْخَرُواْ مِنَّا فَإِنَّا نَسْخَرُ مِنكُمْ كَمَا تَسْخَرُونَ ٣٨ فَسَوْفَ تَعْلَمُونَ مَن يَأْتِيهِ عَذَابٌ يُخْزِيهِ وَيَحِلُّ عَلَيْهِ عَذَابٌ مُّقِيمٌ ٣٩ حَتَّى إِذَا جَاءَ أَمْرُنَا وَفَارَ التَّنُّورُ قُلْنَا احْمِلْ فِيهَا مِن كُلٍّ زَوْجَيْنِ اثْنَيْنِ وَأَهْلَكَ إِلاَّ مَن سَبَقَ عَلَيْهِ الْقَوْلُ وَمَنْ آمَنَ وَمَا آمَنَ مَعَهُ إِلاَّ قَلِيلٌ ٤٠ وَقَالَ ارْكَبُواْ فِيهَا بِسْمِ اللَّهِ مَجْرَاهَا وَمُرْسَاهَا إِنَّ رَبِّي لَغَفُورٌ رَّحِيمٌ ٤١ وَهِيَ تَجْرِي بِهِمْ فِي مَوْجٍ كَالْجِبَالِ وَنَادَى نُوحٌ ابْنَهُ وَكَانَ فِي مَعْزِلٍ يَا بُنَيَّ ارْكَب مَّعَنَا وَلاَ تَكُن مَّعَ الْكَافِرِينَ ٤٢ قَالَ سَآوِي إِلَى جَبَلٍ يَعْصِمُنِي مِنَ الْمَاء قَالَ لاَ عَاصِمَ الْيَوْمَ مِنْ أَمْرِ اللَّهِ إِلاَّ مَن رَّحِمَ وَحَالَ بَيْنَهُمَا الْمَوْجُ فَكَانَ مِنَ الْمُغْرَقِينَ ٤٣"]
                },
		        {
                    "id":7,
                    "question":"إرسال هود إلى عاد ودعوته لهم بثلاث آيات مع وضوح ولوم في نهاية الآيات",
                    "ayat":["وَإِلَى عَادٍ أَخَاهُمْ هُودًا قَالَ يَا قَوْمِ اعْبُدُواْ اللَّهَ مَا لَكُم مِّنْ إِلَهٍ غَيْرُهُ إِنْ أَنتُمْ إِلاَّ مُفْتَرُونَ ٥٠ يَا قَوْمِ لا أَسْأَلُكُمْ عَلَيْهِ أَجْرًا إِنْ أَجْرِيَ إِلاَّ عَلَى الَّذِي فَطَرَنِي أَفَلاَ تَعْقِلُونَ ٥١ وَيَا قَوْمِ اسْتَغْفِرُواْ رَبَّكُمْ ثُمَّ تُوبُواْ إِلَيْهِ يُرْسِلِ السَّمَاء عَلَيْكُم مِّدْرَارًا وَيَزِدْكُمْ قُوَّةً إِلَى قُوَّتِكُمْ وَلاَ تَتَوَلَّوْا مُجْرِمِينَ ٥٢"]
                },
		        {
                    "id":8,
                    "question":"مجئ أمر الله، ونجاة المؤمنين وعذاب عاد وأسبابه",
                    "ayat":["وَلَمَّا جَاءَ أَمْرُنَا نَجَّيْنَا هُودًا وَالَّذِينَ آمَنُواْ مَعَهُ بِرَحْمَةٍ مِّنَّا وَنَجَّيْنَاهُم مِّنْ عَذَابٍ غَلِيظٍ ٥٨ وَتِلْكَ عَادٌ جَحَدُواْ بِآيَاتِ رَبِّهِمْ وَعَصَوْا رُسُلَهُ وَاتَّبَعُواْ أَمْرَ كُلِّ جَبَّارٍ عَنِيدٍ ٥٩ وَأُتْبِعُواْ فِي هَذِهِ الدُّنْيَا لَعْنَةً وَيَوْمَ الْقِيَامَةِ أَلا إِنَّ عَادًا كَفَرُواْ رَبَّهُمْ أَلاَ بُعْدًا لِّعَادٍ قَوْمِ هُودٍ ٦٠"]
                },
		        {
                    "id":9,
                    "question":"الملائكة في ضيافة إبراهيم عليه السلام، يحملون البشرى وينبؤون بعذاب قوم لوط، وثناء الله على إبراهيم ونهيه عن الجدال في عذابهم",
                    "ayat":["وَلَقَدْ جَاءَتْ رُسُلُنَا إِبْرَاهِيمَ بِالْبُشْرَى قَالُواْ سَلامًا قَالَ سَلامٌ فَمَا لَبِثَ أَن جَاءَ بِعِجْلٍ حَنِيذٍ ٦٩ فَلَمَّا رَأَى أَيْدِيَهُمْ لاَ تَصِلُ إِلَيْهِ نَكِرَهُمْ وَأَوْجَسَ مِنْهُمْ خِيفَةً قَالُواْ لاَ تَخَفْ إِنَّا أُرْسِلْنَا إِلَى قَوْمِ لُوطٍ ٧٠ وَامْرَأَتُهُ قَائِمَةٌ فَضَحِكَتْ فَبَشَّرْنَاهَا بِإِسْحَاقَ وَمِن وَرَاء إِسْحَاقَ يَعْقُوبَ ٧١ قَالَتْ يَا وَيْلَتَى أَأَلِدُ وَأَنَاْ عَجُوزٌ وَهَذَا بَعْلِي شَيْخًا إِنَّ هَذَا لَشَيْءٌ عَجِيبٌ ٧٢ قَالُواْ أَتَعْجَبِينَ مِنْ أَمْرِ اللَّهِ رَحْمَتُ اللَّهِ وَبَرَكَاتُهُ عَلَيْكُمْ أَهْلَ الْبَيْتِ إِنَّهُ حَمِيدٌ مَّجِيدٌ ٧٣ فَلَمَّا ذَهَبَ عَنْ إِبْرَاهِيمَ الرَّوْعُ وَجَاءَتْهُ الْبُشْرَى يُجَادِلُنَا فِي قَوْمِ لُوطٍ ٧٤ إِنَّ إِبْرَاهِيمَ لَحَلِيمٌ أَوَّاهٌ مُّنِيبٌ ٧٥ يَا إِبْرَاهِيمُ أَعْرِضْ عَنْ هَذَا إِنَّهُ قَدْ جَاءَ أَمْرُ رَبِّكَ وَإِنَّهُمْ آتِيهِمْ عَذَابٌ غَيْرُ مَرْدُودٍ ٧٦"]
                },  
		        {
                    "id":10,
                    "question":"خمس توجيهات للني – صىل هللا عليه وسلم - والتنبيه لأمرين",
                    "ayat":["فَاسْتَقِمْ كَمَا أُمِرْتَ وَمَن تَابَ مَعَكَ وَلاَ تَطْغَوْا إِنَّهُ بِمَا تَعْمَلُونَ بَصِيرٌ ١١٢ وَلاَ تَرْكَنُواْ إِلَى الَّذِينَ ظَلَمُواْ فَتَمَسَّكُمُ النَّارُ وَمَا لَكُم مِّن دُونِ اللَّهِ مِنْ أَوْلِيَاء ثُمَّ لاَ تُنصَرُونَ ١١٣ وَأَقِمِ الصَّلاةَ طَرَفَيِ النَّهَارِ وَزُلَفًا مِّنَ اللَّيْلِ إِنَّ الْحَسَنَاتِ يُذْهِبْنَ السَّيِّئَاتِ ذَلِكَ ذِكْرَى لِلذَّاكِرِينَ ١١٤ وَاصْبِرْ فَإِنَّ اللَّهَ لاَ يُضِيعُ أَجْرَ الْمُحْسِنِينَ ١١٥ فَلَوْلاَ كَانَ مِنَ الْقُرُونِ مِن قَبْلِكُمْ أُوْلُواْ بَقِيَّةٍ يَنْهَوْنَ عَنِ الْفَسَادِ فِي الأَرْضِ إِلاَّ قَلِيلاً مِّمَّنْ أَنجَيْنَا مِنْهُمْ وَاتَّبَعَ الَّذِينَ ظَلَمُواْ مَا أُتْرِفُواْ فِيهِ وَكَانُواْ مُجْرِمِينَ ١١٦ وَمَا كَانَ رَبُّكَ لِيُهْلِكَ الْقُرَى بِظُلْمٍ وَأَهْلُهَا مُصْلِحُونَ ١١٧"]
                },
	    	    {
                    "id":11,
                    "question":"مشيئة الله في الاختلاف وبيان الحكمة من قص أنباء الرسل والخاتمة",
                    "ayat":["وَلَوْ شَاء رَبُّكَ لَجَعَلَ النَّاسَ أُمَّةً وَاحِدَةً وَلاَ يَزَالُونَ مُخْتَلِفِينَ ١١٨ إِلاَّ مَن رَّحِمَ رَبُّكَ وَلِذَلِكَ خَلَقَهُمْ وَتَمَّتْ كَلِمَةُ رَبِّكَ لَأَمْلَأَنَّ جَهَنَّمَ مِنَ الْجِنَّةِ وَالنَّاسِ أَجْمَعِينَ ١١٩ وَكُلاًّ نَّقُصُّ عَلَيْكَ مِنْ أَنبَاء الرُّسُلِ مَا نُثَبِّتُ بِهِ فُؤَادَكَ وَجَاءَكَ فِي هَذِهِ الْحَقُّ وَمَوْعِظَةٌ وَذِكْرَى لِلْمُؤْمِنِينَ ١٢٠ وَقُل لِّلَّذِينَ لاَ يُؤْمِنُونَ اعْمَلُواْ عَلَى مَكَانَتِكُمْ إِنَّا عَامِلُونَ ١٢١ وَانتَظِرُوا إِنَّا مُنتَظِرُونَ ١٢٢ وَلِلَّهِ غَيْبُ السَّمَاوَاتِ وَالأَرْضِ وَإِلَيْهِ يُرْجَعُ الأَمْرُ كُلُّهُ فَاعْبُدْهُ وَتَوَكَّلْ عَلَيْهِ وَمَا رَبُّكَ بِغَافِلٍ عَمَّا تَعْمَلُونَ ١٢٣"]
                }

            ]
        },
        {
            "sura":"يوسف",
            "questions":[
                {
                    "id":1,
                    "question":"المقدّمة: الإشارة إلى وجوه الإعجاز في القرآن الكريم ",
                    "ayat":["الر تِلْكَ آيَاتُ الْكِتَابِ الْمُبِينِ ١ إِنَّا أَنزَلْنَاهُ قُرْآنًا عَرَبِيًّا لَّعَلَّكُمْ تَعْقِلُونَ ٢ نَحْنُ نَقُصُّ عَلَيْكَ أَحْسَنَ الْقَصَصِ بِمَا أَوْحَيْنَا إِلَيْكَ هَذَا الْقُرْآنَ وَإِن كُنتَ مِن قَبْلِهِ لَمِنَ الْغَافِلِينَ ٣"]
                },
                {
                    "id":2,
                    "question":"رؤيا يوسف وتحذير يعقوب له من حسد إخوته، ثمّ بشارته بتأويل الرّؤيا ",
                    "ayat":["إِذْ قَالَ يُوسُفُ لِأَبِيهِ يَا أَبَتِ إِنِّي رَأَيْتُ أَحَدَ عَشَرَ كَوْكَبًا وَالشَّمْسَ وَالْقَمَرَ رَأَيْتُهُمْ لِي سَاجِدِينَ ٤ قَالَ يَا بُنَيَّ لاَ تَقْصُصْ رُؤْيَاكَ عَلَى إِخْوَتِكَ فَيَكِيدُواْ لَكَ كَيْدًا إِنَّ الشَّيْطَانَ لِلإِنسَانِ عَدُوٌّ مُّبِينٌ ٥ وَكَذَلِكَ يَجْتَبِيكَ رَبُّكَ وَيُعَلِّمُكَ مِن تَأْوِيلِ الأَحَادِيثِ وَيُتِمُّ نِعْمَتَهُ عَلَيْكَ وَعَلَى آلِ يَعْقُوبَ كَمَا أَتَمَّهَا عَلَى أَبَوَيْكَ مِن قَبْلُ إِبْرَاهِيمَ وَإِسْحَاقَ إِنَّ رَبَّكَ عَلِيمٌ حَكِيمٌ ٦"]
                },
                {
                    "id":3,
                    "question":"غيرة إخوة يوسف وتآمرهم للتّخلّص منه ",
                    "ayat":["لَّقَدْ كَانَ فِي يُوسُفَ وَإِخْوَتِهِ آيَاتٌ لِّلسَّائِلِينَ ٧ إِذْ قَالُواْ لَيُوسُفُ وَأَخُوهُ أَحَبُّ إِلَى أَبِينَا مِنَّا وَنَحْنُ عُصْبَةٌ إِنَّ أَبَانَا لَفِي ضَلالٍ مُّبِينٍ ٨ اقْتُلُواْ يُوسُفَ أَوِ اطْرَحُوهُ أَرْضًا يَخْلُ لَكُمْ وَجْهُ أَبِيكُمْ وَتَكُونُواْ مِن بَعْدِهِ قَوْمًا صَالِحِينَ ٩ قَالَ قَائِلٌ مِّنْهُمْ لاَ تَقْتُلُواْ يُوسُفَ وَأَلْقُوهُ فِي غَيَابَةِ الْجُبِّ يَلْتَقِطْهُ بَعْضُ السَّيَّارَةِ إِن كُنتُمْ فَاعِلِينَ ١٠"]
                },
                {
                    "id":4,
                    "question":"استئذان الإخوة أبيهم في اصطحاب يوسف معهم، وإفصاح الأبّ عن مخاوفه لهم، وطمئنتهم له ",
                    "ayat":["قَالُواْ يَا أَبَانَا مَا لَكَ لاَ تَأْمَنَّا عَلَى يُوسُفَ وَإِنَّا لَهُ لَنَاصِحُونَ ١١ أَرْسِلْهُ مَعَنَا غَدًا يَرْتَعْ وَيَلْعَبْ وَإِنَّا لَهُ لَحَافِظُونَ ١٢ قَالَ إِنِّي لَيَحْزُنُنِي أَن تَذْهَبُواْ بِهِ وَأَخَافُ أَن يَأْكُلَهُ الذِّئْبُ وَأَنتُمْ عَنْهُ غَافِلُونَ ١٣ قَالُواْ لَئِنْ أَكَلَهُ الذِّئْبُ وَنَحْنُ عُصْبَةٌ إِنَّا إِذًا لَّخَاسِرُونَ ١٤"]
                },
                {
                    "id":5,
                    "question":"ذهابهم بيوسف وإلقاؤه في البئر، ووحي الله له بما يطيب قلبه ",
                    "ayat":["فَلَمَّا ذَهَبُواْ بِهِ وَأَجْمَعُواْ أَن يَجْعَلُوهُ فِي غَيَابَةِ الْجُبِّ وَأَوْحَيْنَا إِلَيْهِ لَتُنَبِّئَنَّهُم بِأَمْرِهِمْ هَذَا وَهُمْ لاَ يَشْعُرُونَ ١٥"]
                },
                {
                    "id":6,
                    "question":"الاعتذار للابّ ببكاءٍ وقميصٍ كذبٍ، وإنكار الأبّ وصبره ",
                    "ayat":["وَجَاؤُواْ أَبَاهُمْ عِشَاء يَبْكُونَ ١٦ قَالُواْ يَا أَبَانَا إِنَّا ذَهَبْنَا نَسْتَبِقُ وَتَرَكْنَا يُوسُفَ عِندَ مَتَاعِنَا فَأَكَلَهُ الذِّئْبُ وَمَا أَنتَ بِمُؤْمِنٍ لَّنَا وَلَوْ كُنَّا صَادِقِينَ ١٧ وَجَاؤُوا عَلَى قَمِيصِهِ بِدَمٍ كَذِبٍ قَالَ بَلْ سَوَّلَتْ لَكُمْ أَنفُسُكُمْ أَمْرًا فَصَبْرٌ جَمِيلٌ وَاللَّهُ الْمُسْتَعَانُ عَلَى مَا تَصِفُونَ ١٨"]
                },
                {
                    "id":7,
                    "question":"نجاة يوسف من الهلاك في البئر ",
                    "ayat":["وَجَاءَتْ سَيَّارَةٌ فَأَرْسَلُواْ وَارِدَهُمْ فَأَدْلَى دَلْوَهُ قَالَ يَا بُشْرَى هَذَا غُلامٌ وَأَسَرُّوهُ بِضَاعَةً وَاللَّهُ عَلِيمٌ بِمَا يَعْمَلُونَ ١٩ وَشَرَوْهُ بِثَمَنٍ بَخْسٍ دَرَاهِمَ مَعْدُودَةٍ وَكَانُواْ فِيهِ مِنَ الزَّاهِدِينَ ٢٠"]
                },
                {
                    "id":8,
                    "question":"تمهيد لتمكين يوسف في أرض مصر: شراء عزيز مصر له وإكرامه، وإنعام الله عليه بالعلم عند بلوغه الأشدّ ",
                    "ayat":["وَقَالَ الَّذِي اشْتَرَاهُ مِن مِّصْرَ لاِمْرَأَتِهِ أَكْرِمِي مَثْوَاهُ عَسَى أَن يَنفَعَنَا أَوْ نَتَّخِذَهُ وَلَدًا وَكَذَلِكَ مَكَّنَّا لِيُوسُفَ فِي الأَرْضِ وَلِنُعَلِّمَهُ مِن تَأْوِيلِ الأَحَادِيثِ وَاللَّهُ غَالِبٌ عَلَى أَمْرِهِ وَلَكِنَّ أَكْثَرَ النَّاسِ لاَ يَعْلَمُونَ ٢١ وَلَمَّا بَلَغَ أَشُدَّهُ آتَيْنَاهُ حُكْمًا وَعِلْمًا وَكَذَلِكَ نَجْزِي الْمُحْسِنِينَ ٢٢"]
                },
                {
                    "id":9,
                    "question":"محنة يوسف مع امرأة العزيز مراودة وهمّ، واستباق إلى الباب، واتّهام يوسف، والفصل بموضع قدّ القميص، وظهور براءة يوسف وأمره بالإعراض، وامرأة العزيز بالاستغفار ",
                    "ayat":["وَرَاوَدَتْهُ الَّتِي هُوَ فِي بَيْتِهَا عَن نَّفْسِهِ وَغَلَّقَتِ الأَبْوَابَ وَقَالَتْ هَيْتَ لَكَ قَالَ مَعَاذَ اللَّهِ إِنَّهُ رَبِّي أَحْسَنَ مَثْوَايَ إِنَّهُ لاَ يُفْلِحُ الظَّالِمُونَ ٢٣ وَلَقَدْ هَمَّتْ بِهِ وَهَمَّ بِهَا لَوْلا أَن رَّأَى بُرْهَانَ رَبِّهِ كَذَلِكَ لِنَصْرِفَ عَنْهُ السُّوءَ وَالْفَحْشَاء إِنَّهُ مِنْ عِبَادِنَا الْمُخْلَصِينَ ٢٤ وَاسْتَبَقَا الْبَابَ وَقَدَّتْ قَمِيصَهُ مِن دُبُرٍ وَأَلْفَيَا سَيِّدَهَا لَدَى الْبَابِ قَالَتْ مَا جَزَاء مَنْ أَرَادَ بِأَهْلِكَ سُوءًا إِلاَّ أَن يُسْجَنَ أَوْ عَذَابٌ أَلِيمٌ ٢٥ قَالَ هِيَ رَاوَدَتْنِي عَن نَّفْسِي وَشَهِدَ شَاهِدٌ مِّنْ أَهْلِهَا إِن كَانَ قَمِيصُهُ قُدَّ مِن قُبُلٍ فَصَدَقَتْ وَهُوَ مِنَ الْكَاذِبِينَ ٢٦ وَإِنْ كَانَ قَمِيصُهُ قُدَّ مِن دُبُرٍ فَكَذَبَتْ وَهُوَ مِن الصَّادِقِينَ ٢٧ فَلَمَّا رَأَى قَمِيصَهُ قُدَّ مِن دُبُرٍ قَالَ إِنَّهُ مِن كَيْدِكُنَّ إِنَّ كَيْدَكُنَّ عَظِيمٌ ٢٨ يُوسُفُ أَعْرِضْ عَنْ هَذَا وَاسْتَغْفِرِي لِذَنبِكِ إِنَّكِ كُنتِ مِنَ الْخَاطِئِينَ ٢٩"]
                },
                {
                    "id":10,
                    "question":"حديث النّسوة عن امرأة العزيز، ومكيدتها لهنّ، وتهديدها ليوسف بالسّجن والصغار ",
                    "ayat":["وَقَالَ نِسْوَةٌ فِي الْمَدِينَةِ امْرَأَةُ الْعَزِيزِ تُرَاوِدُ فَتَاهَا عَن نَّفْسِهِ قَدْ شَغَفَهَا حُبًّا إِنَّا لَنَرَاهَا فِي ضَلالٍ مُّبِينٍ ٣٠ فَلَمَّا سَمِعَتْ بِمَكْرِهِنَّ أَرْسَلَتْ إِلَيْهِنَّ وَأَعْتَدَتْ لَهُنَّ مُتَّكَأً وَآتَتْ كُلَّ وَاحِدَةٍ مِّنْهُنَّ سِكِّينًا وَقَالَتِ اخْرُجْ عَلَيْهِنَّ فَلَمَّا رَأَيْنَهُ أَكْبَرْنَهُ وَقَطَّعْنَ أَيْدِيَهُنَّ وَقُلْنَ حَاشَ لِلَّهِ مَا هَذَا بَشَرًا إِنْ هَذَا إِلاَّ مَلَكٌ كَرِيمٌ ٣١ قَالَتْ فَذَلِكُنَّ الَّذِي لُمْتُنَّنِي فِيهِ وَلَقَدْ رَاوَدتُّهُ عَن نَّفْسِهِ فَاسْتَعْصَمَ وَلَئِن لَّمْ يَفْعَلْ مَا آمُرُهُ لَيُسْجَنَنَّ وَلَيَكُونًا مِّنَ الصَّاغِرِينَ ٣٢"]
                },
                {
                    "id":11,
                    "question":"التجاء يوسف لربّه، وإيثاره السّجن على الوقوع في الفاحشة وإجابة السّميع العليم لدعائه ",
                    "ayat":["قَالَ رَبِّ السِّجْنُ أَحَبُّ إِلَيَّ مِمَّا يَدْعُونَنِي إِلَيْهِ وَإِلاَّ تَصْرِفْ عَنِّي كَيْدَهُنَّ أَصْبُ إِلَيْهِنَّ وَأَكُن مِّنَ الْجَاهِلِينَ ٣٣ فَاسْتَجَابَ لَهُ رَبُّهُ فَصَرَفَ عَنْهُ كَيْدَهُنَّ إِنَّهُ هُوَ السَّمِيعُ الْعَلِيمُ ٣٤"]
                },
                {
                    "id":12,
                    "question":"الحكم على يوسف بالسّجن ",
                    "ayat":["ثُمَّ بَدَا لَهُم مِّن بَعْدِ مَا رَأَوُاْ الآيَاتِ لَيَسْجُنُنَّهُ حَتَّى حِينٍ ٣٥"]
                },
                {
                    "id":13,
                    "question":"رؤيا صاحبيّ السّجن وطلبهم التّأويل ",
                    "ayat":["وَدَخَلَ مَعَهُ السِّجْنَ فَتَيَانَ قَالَ أَحَدُهُمَا إِنِّي أَرَانِي أَعْصِرُ خَمْرًا وَقَالَ الآخَرُ إِنِّي أَرَانِي أَحْمِلُ فَوْقَ رَأْسِي خُبْزًا تَأْكُلُ الطَّيْرُ مِنْهُ نَبِّئْنَا بِتَأْوِيلِهِ إِنَّا نَرَاكَ مِنَ الْمُحْسِنِينَ ٣٦"]
                },
                {
                    "id":14,
                    "question":"وعد يوسف لهما بالتّاويل، وإخبارهما بنعمة الله عليه وبتأويل الرؤى وإعلانه لهويّته الإسلامية ",
                    "ayat":["قَالَ لاَ يَأْتِيكُمَا طَعَامٌ تُرْزَقَانِهِ إِلاَّ نَبَّأْتُكُمَا بِتَأْوِيلِهِ قَبْلَ أَن يَأْتِيَكُمَا ذَلِكُمَا مِمَّا عَلَّمَنِي رَبِّي إِنِّي تَرَكْتُ مِلَّةَ قَوْمٍ لاَّ يُؤْمِنُونَ بِاللَّهِ وَهُم بِالآخِرَةِ هُمْ كَافِرُونَ ٣٧ وَاتَّبَعْتُ مِلَّةَ آبَائِي إِبْرَاهِيمَ وَإِسْحَاقَ وَيَعْقُوبَ مَا كَانَ لَنَا أَن نُّشْرِكَ بِاللَّهِ مِن شَيْءٍ ذَلِكَ مِن فَضْلِ اللَّهِ عَلَيْنَا وَعَلَى النَّاسِ وَلَكِنَّ أَكْثَرَ النَّاسِ لاَ يَشْكُرُونَ ٣٨"]
                },
                {
                    "id":15,
                    "question":"مناقشة يوسف لصاحبيّ السّجن في عقيدة الشّرك ",
                    "ayat":["يَا صَاحِبَيِ السِّجْنِ أَأَرْبَابٌ مُّتَفَرِّقُونَ خَيْرٌ أَمِ اللَّهُ الْوَاحِدُ الْقَهَّارُ ٣٩ مَا تَعْبُدُونَ مِن دُونِهِ إِلاَّ أَسْمَاء سَمَّيْتُمُوهَا أَنتُمْ وَآبَاؤُكُم مَّا أَنزَلَ اللَّهُ بِهَا مِن سُلْطَانٍ إِنِ الْحُكْمُ إِلاَّ لِلَّهِ أَمَرَ أَلاَّ تَعْبُدُواْ إِلاَّ إِيَّاهُ ذَلِكَ الدِّينُ الْقَيِّمُ وَلَكِنَّ أَكْثَرَ النَّاسِ لاَ يَعْلَمُونَ ٤٠"]
                },
                {
                    "id":16,
                    "question":"تأويل رؤى صاحبيّ السّجن، ووصيّته للنّاجي منهما، ونسيانه، ولبث يوسف في السّجن ",
                    "ayat":["يَا صَاحِبَيِ السِّجْنِ أَمَّا أَحَدُكُمَا فَيَسْقِي رَبَّهُ خَمْرًا وَأَمَّا الآخَرُ فَيُصْلَبُ فَتَأْكُلُ الطَّيْرُ مِن رَّأْسِهِ قُضِيَ الأَمْرُ الَّذِي فِيهِ تَسْتَفْتِيَانِ ٤١ وَقَالَ لِلَّذِي ظَنَّ أَنَّهُ نَاجٍ مِّنْهُمَا اذْكُرْنِي عِندَ رَبِّكَ فَأَنسَاهُ الشَّيْطَانُ ذِكْرَ رَبِّهِ فَلَبِثَ فِي السِّجْنِ بِضْعَ سِنِينَ ٤٢"]
                },
                {
                    "id":17,
                    "question":"رؤيا الملك، وطلبه التّأويل من الملأ وردّهم، وتذكّر النّاجي ليوسف ",
                    "ayat":["وَقَالَ الْمَلِكُ إِنِّي أَرَى سَبْعَ بَقَرَاتٍ سِمَانٍ يَأْكُلُهُنَّ سَبْعٌ عِجَافٌ وَسَبْعَ سُنبُلاتٍ خُضْرٍ وَأُخَرَ يَابِسَاتٍ يَا أَيُّهَا الْمَلأُ أَفْتُونِي فِي رُؤْيَايَ إِن كُنتُمْ لِلرُّؤْيَا تَعْبُرُونَ ٤٣ قَالُواْ أَضْغَاثُ أَحْلامٍ وَمَا نَحْنُ بِتَأْوِيلِ الأَحْلامِ بِعَالِمِينَ ٤٤ وَقَالَ الَّذِي نَجَا مِنْهُمَا وَادَّكَرَ بَعْدَ أُمَّةٍ أَنَاْ أُنَبِّئُكُم بِتَأْوِيلِهِ فَأَرْسِلُونِ ٤٥"]
                },
                {
                    "id":18,
                    "question":"طلب الفتيا من يوسف في رؤيا الملك، وتأويله لها ",
                    "ayat":["يُوسُفُ أَيُّهَا الصِّدِّيقُ أَفْتِنَا فِي سَبْعِ بَقَرَاتٍ سِمَانٍ يَأْكُلُهُنَّ سَبْعٌ عِجَافٌ وَسَبْعِ سُنبُلاتٍ خُضْرٍ وَأُخَرَ يَابِسَاتٍ لَّعَلِّي أَرْجِعُ إِلَى النَّاسِ لَعَلَّهُمْ يَعْلَمُونَ ٤٦ قَالَ تَزْرَعُونَ سَبْعَ سِنِينَ دَأَبًا فَمَا حَصَدتُّمْ فَذَرُوهُ فِي سُنبُلِهِ إِلاَّ قَلِيلاً مِّمَّا تَأْكُلُونَ ٤٧ ثُمَّ يَأْتِي مِن بَعْدِ ذَلِكَ سَبْعٌ شِدَادٌ يَأْكُلْنَ مَا قَدَّمْتُمْ لَهُنَّ إِلاَّ قَلِيلاً مِّمَّا تُحْصِنُونَ ٤٨ ثُمَّ يَأْتِي مِن بَعْدِ ذَلِكَ عَامٌ فِيهِ يُغَاثُ النَّاسُ وَفِيهِ يَعْصِرُونَ ٤٩"]
                },
                {
                    "id":19,
                    "question":"أمر الملك بإخراج يوسف وامتناعه الخروج حتى تثبت براءته للجميع ",
                    "ayat":["وَقَالَ الْمَلِكُ ائْتُونِي بِهِ فَلَمَّا جَاءَهُ الرَّسُولُ قَالَ ارْجِعْ إِلَى رَبِّكَ فَاسْأَلْهُ مَا بَالُ النِّسْوَةِ الَّلاتِي قَطَّعْنَ أَيْدِيَهُنَّ إِنَّ رَبِّي بِكَيْدِهِنَّ عَلِيمٌ ٥٠"]
                },
                {
                    "id":20,
                    "question":"التّحقيق في القضيّة، واعتراف امرأة العزيز، وسبب فعل ذلك ",
                    "ayat":["قَالَ مَا خَطْبُكُنَّ إِذْ رَاوَدتُّنَّ يُوسُفَ عَن نَّفْسِهِ قُلْنَ حَاشَ لِلَّهِ مَا عَلِمْنَا عَلَيْهِ مِن سُوءٍ قَالَتِ امْرَأَةُ الْعَزِيزِ الآنَ حَصْحَصَ الْحَقُّ أَنَاْ رَاوَدتُّهُ عَن نَّفْسِهِ وَإِنَّهُ لَمِنَ الصَّادِقِينَ ٥١ ذَلِكَ لِيَعْلَمَ أَنِّي لَمْ أَخُنْهُ بِالْغَيْبِ وَأَنَّ اللَّهَ لاَ يَهْدِي كَيْدَ الْخَائِنِينَ ٥٢ وَمَا أُبَرِّئُ نَفْسِي إِنَّ النَّفْسَ لأَمَّارَةٌ بِالسُّوءِ إِلاَّ مَا رَحِمَ رَبِّيَ إِنَّ رَبِّي غَفُورٌ رَّحِيمٌ ٥٣"]
                },
                {
                    "id":21,
                    "question":"الملك يقرّب يوسف، ويوسف يطلب الإمارة على خزائن الأرض، وتمكين الله له ورحمته به لإحسانه، والإشارة لأجر ",
                    "ayat":["وَقَالَ الْمَلِكُ ائْتُونِي بِهِ أَسْتَخْلِصْهُ لِنَفْسِي فَلَمَّا كَلَّمَهُ قَالَ إِنَّكَ الْيَوْمَ لَدَيْنَا مَكِينٌ أَمِينٌ ٥٤ قَالَ اجْعَلْنِي عَلَى خَزَائِنِ الأَرْضِ إِنِّي حَفِيظٌ عَلِيمٌ ٥٥ وَكَذَلِكَ مَكَّنَّا لِيُوسُفَ فِي الأَرْضِ يَتَبَوَّأُ مِنْهَا حَيْثُ يَشَاء نُصِيبُ بِرَحْمَتِنَا مَن نَّشَاء وَلاَ نُضِيعُ أَجْرَ الْمُحْسِنِينَ ٥٦ وَلَأَجْرُ الآخِرَةِ خَيْرٌ لِّلَّذِينَ آمَنُواْ وَكَانُواْ يَتَّقُونَ ٥٧"]
                },
                {
                    "id":22,
                    "question":"قدوم إخوة يوسف إلى مصر، ومعرفته لهم دون معرفتهم له، وتجهيزهم، وطلب إحضار بنيامين في الكيل القادم، والتّوعّد بمنع الكيل إن لم يفعلوا، ووعدهم بالمحاولة، وردّ البضاعة في الرحال ",
                    "ayat":["وَجَاءَ إِخْوَةُ يُوسُفَ فَدَخَلُواْ عَلَيْهِ فَعَرَفَهُمْ وَهُمْ لَهُ مُنكِرُونَ ٥٨ وَلَمَّا جَهَّزَهُم بِجَهَازِهِمْ قَالَ ائْتُونِي بِأَخٍ لَّكُم مِّنْ أَبِيكُمْ أَلاَ تَرَوْنَ أَنِّي أُوفِي الْكَيْلَ وَأَنَاْ خَيْرُ الْمُنزِلِينَ ٥٩ فَإِن لَّمْ تَأْتُونِي بِهِ فَلاَ كَيْلَ لَكُمْ عِندِي وَلاَ تَقْرَبُونِ ٦٠ قَالُواْ سَنُرَاوِدُ عَنْهُ أَبَاهُ وَإِنَّا لَفَاعِلُونَ ٦١ وَقَالَ لِفِتْيَانِهِ اجْعَلُواْ بِضَاعَتَهُمْ فِي رِحَالِهِمْ لَعَلَّهُمْ يَعْرِفُونَهَا إِذَا انقَلَبُواْ إِلَى أَهْلِهِمْ لَعَلَّهُمْ يَرْجِعُونَ ٦٢"]
                },
                {
                    "id":23,
                    "question":"محاولات إخوة يوسف مع أبيهم لإرسال بنيامين معهم ",
                    "ayat":["فَلَمَّا رَجَعُوا إِلَى أَبِيهِمْ قَالُواْ يَا أَبَانَا مُنِعَ مِنَّا الْكَيْلُ فَأَرْسِلْ مَعَنَا أَخَانَا نَكْتَلْ وَإِنَّا لَهُ لَحَافِظُونَ ٦٣ قَالَ هَلْ آمَنُكُمْ عَلَيْهِ إِلاَّ كَمَا أَمِنتُكُمْ عَلَى أَخِيهِ مِن قَبْلُ فَاللَّهُ خَيْرٌ حَافِظًا وَهُوَ أَرْحَمُ الرَّاحِمِينَ ٦٤ وَلَمَّا فَتَحُواْ مَتَاعَهُمْ وَجَدُواْ بِضَاعَتَهُمْ رُدَّتْ إِلَيْهِمْ قَالُواْ يَا أَبَانَا مَا نَبْغِي هَذِهِ بِضَاعَتُنَا رُدَّتْ إِلَيْنَا وَنَمِيرُ أَهْلَنَا وَنَحْفَظُ أَخَانَا وَنَزْدَادُ كَيْلَ بَعِيرٍ ذَلِكَ كَيْلٌ يَسِيرٌ ٦٥"]
                },
                {
                    "id":24,
                    "question":"موافقة يعقوب على إرسال بنيامين معهم بعد أخذ الميثاق على حفظه، ووصيته لهم، وإنفاذهم الوصية ",
                    "ayat":["قَالَ لَنْ أُرْسِلَهُ مَعَكُمْ حَتَّى تُؤْتُونِ مَوْثِقًا مِّنَ اللَّهِ لَتَأْتُنَّنِي بِهِ إِلاَّ أَن يُحَاطَ بِكُمْ فَلَمَّا آتَوْهُ مَوْثِقَهُمْ قَالَ اللَّهُ عَلَى مَا نَقُولُ وَكِيلٌ ٦٦ وَقَالَ يَا بَنِيَّ لاَ تَدْخُلُواْ مِن بَابٍ وَاحِدٍ وَادْخُلُواْ مِنْ أَبْوَابٍ مُّتَفَرِّقَةٍ وَمَا أُغْنِي عَنكُم مِّنَ اللَّهِ مِن شَيْءٍ إِنِ الْحُكْمُ إِلاَّ لِلَّهِ عَلَيْهِ تَوَكَّلْتُ وَعَلَيْهِ فَلْيَتَوَكَّلِ الْمُتَوَكِّلُونَ ٦٧ وَلَمَّا دَخَلُواْ مِنْ حَيْثُ أَمَرَهُمْ أَبُوهُم مَّا كَانَ يُغْنِي عَنْهُم مِّنَ اللَّهِ مِن شَيْءٍ إِلاَّ حَاجَةً فِي نَفْسِ يَعْقُوبَ قَضَاهَا وَإِنَّهُ لَذُو عِلْمٍ لِّمَا عَلَّمْنَاهُ وَلَكِنَّ أَكْثَرَ النَّاسِ لاَ يَعْلَمُونَ ٦٨"]
                },
                {
                    "id":25,
                    "question":"لقاء يوسف بأخيه بنيامين ",
                    "ayat":["وَلَمَّا دَخَلُواْ عَلَى يُوسُفَ آوَى إِلَيْهِ أَخَاهُ قَالَ إِنِّي أَنَاْ أَخُوكَ فَلاَ تَبْتَئِسْ بِمَا كَانُواْ يَعْمَلُونَ ٦٩"]
                },
                {
                    "id":26,
                    "question":"الكيد لاستبقاء بنيامين بتهمة سرقة صواع الملك ",
                    "ayat":["فَلَمَّا جَهَّزَهُم بِجَهَازِهِمْ جَعَلَ السِّقَايَةَ فِي رَحْلِ أَخِيهِ ثُمَّ أَذَّنَ مُؤَذِّنٌ أَيَّتُهَا الْعِيرُ إِنَّكُمْ لَسَارِقُونَ ٧٠ قَالُواْ وَأَقْبَلُواْ عَلَيْهِم مَّاذَا تَفْقِدُونَ ٧١ قَالُواْ نَفْقِدُ صُوَاعَ الْمَلِكِ وَلِمَن جَاءَ بِهِ حِمْلُ بَعِيرٍ وَأَنَاْ بِهِ زَعِيمٌ ٧٢ قَالُواْ تَاللَّهِ لَقَدْ عَلِمْتُم مَّا جِئْنَا لِنُفْسِدَ فِي الأَرْضِ وَمَا كُنَّا سَارِقِينَ ٧٣ قَالُواْ فَمَا جَزَاؤُهُ إِن كُنتُمْ كَاذِبِينَ ٧٤ قَالُواْ جَزَاؤُهُ مَن وُجِدَ فِي رَحْلِهِ فَهُوَ جَزَاؤُهُ كَذَلِكَ نَجْزِي الظَّالِمِينَ ٧٥ فَبَدَأَ بِأَوْعِيَتِهِمْ قَبْلَ وِعَاء أَخِيهِ ثُمَّ اسْتَخْرَجَهَا مِن وِعَاء أَخِيهِ كَذَلِكَ كِدْنَا لِيُوسُفَ مَا كَانَ لِيَأْخُذَ أَخَاهُ فِي دِينِ الْمَلِكِ إِلاَّ أَن يَشَاء اللَّهُ نَرْفَعُ دَرَجَاتٍ مِّن نَّشَاء وَفَوْقَ كُلِّ ذِي عِلْمٍ عَلِيمٌ ٧٦"]
                },
                {
                    "id":27,
                    "question":"ردّ الإخوة على تهمة السّرقة بذكر سرقة يوسف، ومحاولاتهم لفكاك أخيهم وفاءً للميثاق",
                    "ayat":["قَالُواْ إِن يَسْرِقْ فَقَدْ سَرَقَ أَخٌ لَّهُ مِن قَبْلُ فَأَسَرَّهَا يُوسُفُ فِي نَفْسِهِ وَلَمْ يُبْدِهَا لَهُمْ قَالَ أَنتُمْ شَرٌّ مَّكَانًا وَاللَّهُ أَعْلَمْ بِمَا تَصِفُونَ ٧٧ قَالُواْ يَا أَيُّهَا الْعَزِيزُ إِنَّ لَهُ أَبًا شَيْخًا كَبِيرًا فَخُذْ أَحَدَنَا مَكَانَهُ إِنَّا نَرَاكَ مِنَ الْمُحْسِنِينَ ٧٨ قَالَ مَعَاذَ اللَّهِ أَن نَّأْخُذَ إِلاَّ مَن وَجَدْنَا مَتَاعَنَا عِندَهُ إِنَّا إِذًا لَّظَالِمُونَ ٧٩"]
                },
                {
                    "id":28,
                    "question":"تشاور الإخوة في الأمر، والقرار ببقاء كبيرهم في مصر وفاء بالميثاق وإرسال البقيّة بالخبر ",
                    "ayat":["فَلَمَّا اسْتَيْأَسُواْ مِنْهُ خَلَصُواْ نَجِيًّا قَالَ كَبِيرُهُمْ أَلَمْ تَعْلَمُواْ أَنَّ أَبَاكُمْ قَدْ أَخَذَ عَلَيْكُم مَّوْثِقًا مِّنَ اللَّهِ وَمِن قَبْلُ مَا فَرَّطتُمْ فِي يُوسُفَ فَلَنْ أَبْرَحَ الأَرْضَ حَتَّىَ يَأْذَنَ لِي أَبِي أَوْ يَحْكُمَ اللَّهُ لِي وَهُوَ خَيْرُ الْحَاكِمِينَ ٨٠ ارْجِعُواْ إِلَى أَبِيكُمْ فَقُولُواْ يَا أَبَانَا إِنَّ ابْنَكَ سَرَقَ وَمَا شَهِدْنَا إِلاَّ بِمَا عَلِمْنَا وَمَا كُنَّا لِلْغَيْبِ حَافِظِينَ ٨١ وَاسْأَلِ الْقَرْيَةَ الَّتِي كُنَّا فِيهَا وَالْعِيرَ الَّتِي أَقْبَلْنَا فِيهَا وَإِنَّا لَصَادِقُونَ ٨٢"]
                },
                {
                    "id":29,
                    "question":"ردّ يعقوب على الخبر، والتجاؤه إلى الله، وحزنه، ثمّ طلبه من أبنائه البحث عن يوسف وبنيامين ",
                    "ayat":["قَالَ بَلْ سَوَّلَتْ لَكُمْ أَنفُسُكُمْ أَمْرًا فَصَبْرٌ جَمِيلٌ عَسَى اللَّهُ أَن يَأْتِيَنِي بِهِمْ جَمِيعًا إِنَّهُ هُوَ الْعَلِيمُ الْحَكِيمُ ٨٣ وَتَوَلَّى عَنْهُمْ وَقَالَ يَا أَسَفَى عَلَى يُوسُفَ وَابْيَضَّتْ عَيْنَاهُ مِنَ الْحُزْنِ فَهُوَ كَظِيمٌ ٨٤ قَالُواْ تَاللَّه تَفْتَأُ تَذْكُرُ يُوسُفَ حَتَّى تَكُونَ حَرَضًا أَوْ تَكُونَ مِنَ الْهَالِكِينَ ٨٥ قَالَ إِنَّمَا أَشْكُو بَثِّي وَحُزْنِي إِلَى اللَّهِ وَأَعْلَمُ مِنَ اللَّهِ مَا لاَ تَعْلَمُونَ ٨٦ يَا بَنِيَّ اذْهَبُواْ فَتَحَسَّسُواْ مِن يُوسُفَ وَأَخِيهِ وَلاَ تَيْأَسُواْ مِن رَّوْحِ اللَّهِ إِنَّهُ لاَ يَيْأَسُ مِن رَّوْحِ اللَّهِ إِلاَّ الْقَوْمُ الْكَافِرُونَ ٨٧"]
                },
                {
                    "id":30,
                    "question":"عودة إخوة يوسف إلى مصر لمحاولة فكاك أخيهم ",
                    "ayat":["فَلَمَّا دَخَلُواْ عَلَيْهِ قَالُواْ يَا أَيُّهَا الْعَزِيزُ مَسَّنَا وَأَهْلَنَا الضُّرُّ وَجِئْنَا بِبِضَاعَةٍ مُّزْجَاةٍ فَأَوْفِ لَنَا الْكَيْلَ وَتَصَدَّقْ عَلَيْنَا إِنَّ اللَّهَ يَجْزِي الْمُتَصَدِّقِينَ ٨٨"]
                },
                {
                    "id":31,
                    "question":"مواجهة يوسف لإخوته بحقيقة ما فعلوه به، وإقرارهم بذلك، واعترافهم بفضله وخطئهم ",
                    "ayat":["قَالَ هَلْ عَلِمْتُم مَّا فَعَلْتُم بِيُوسُفَ وَأَخِيهِ إِذْ أَنتُمْ جَاهِلُونَ ٨٩ قَالُواْ أَإِنَّكَ لَأَنتَ يُوسُفُ قَالَ أَنَاْ يُوسُفُ وَهَذَا أَخِي قَدْ مَنَّ اللَّهُ عَلَيْنَا إِنَّهُ مَنَّ يَتَّقِ وَيَصْبِرْ فَإِنَّ اللَّهَ لاَ يُضِيعُ أَجْرَ الْمُحْسِنِينَ ٩٠ قَالُواْ تَاللَّهِ لَقَدْ آثَرَكَ اللَّهُ عَلَيْنَا وَإِن كُنَّا لَخَاطِئِينَ ٩١"]
                },
                {
                    "id":32,
                    "question":"عفو يوسف عن إخوته، وإرساله بقميصه لأبيه ليأتيه مبصرا مع جميع أهله ",
                    "ayat":["قَالَ لاَ تَثْرِيبَ عَلَيْكُمُ الْيَوْمَ يَغْفِرُ اللَّهُ لَكُمْ وَهُوَ أَرْحَمُ الرَّاحِمِينَ ٩٢ اذْهَبُواْ بِقَمِيصِي هَذَا فَأَلْقُوهُ عَلَى وَجْهِ أَبِي يَأْتِ بَصِيرًا وَأْتُونِي بِأَهْلِكُمْ أَجْمَعِينَ ٩٣"]
                },
                {
                    "id":33,
                    "question":"إخبار يعقوب بريح يوسف، وتفنيد ذلك من أبنائه ",
                    "ayat":["وَلَمَّا فَصَلَتِ الْعِيرُ قَالَ أَبُوهُمْ إِنِّي لَأَجِدُ رِيحَ يُوسُفَ لَوْلاَ أَن تُفَنِّدُونِ ٩٤ قَالُواْ تَاللَّهِ إِنَّكَ لَفِي ضَلالِكَ الْقَدِيمِ ٩٥"]
                },
                {
                    "id":34,
                    "question":"البشارة وعودة بصر يعقوب، وندم الإخوة على فعلتهم واستغفار أبيهم لهم ",
                    "ayat":["فَلَمَّا أَن جَاءَ الْبَشِيرُ أَلْقَاهُ عَلَى وَجْهِهِ فَارْتَدَّ بَصِيرًا قَالَ أَلَمْ أَقُل لَّكُمْ إِنِّي أَعْلَمُ مِنَ اللَّهِ مَا لاَ تَعْلَمُونَ ٩٦ قَالُواْ يَا أَبَانَا اسْتَغْفِرْ لَنَا ذُنُوبَنَا إِنَّا كُنَّا خَاطِئِينَ ٩٧ قَالَ سَوْفَ أَسْتَغْفِرُ لَكُمْ رَبِّيَ إِنَّهُ هُوَ الْغَفُورُ الرَّحِيمُ ٩٨"]
                },
                {
                    "id":35,
                    "question":"لقاء أسرة يعقوب بيوسف في مصر وتحقّق الرّؤيا ",
                    "ayat":["فَلَمَّا دَخَلُواْ عَلَى يُوسُفَ آوَى إِلَيْهِ أَبَوَيْهِ وَقَالَ ادْخُلُواْ مِصْرَ إِن شَاء اللَّهُ آمِنِينَ ٩٩ وَرَفَعَ أَبَوَيْهِ عَلَى الْعَرْشِ وَخَرُّواْ لَهُ سُجَّدًا وَقَالَ يَا أَبَتِ هَذَا تَأْوِيلُ رُؤْيَايَ مِن قَبْلُ قَدْ جَعَلَهَا رَبِّي حَقًّا وَقَدْ أَحْسَنَ بِي إِذْ أَخْرَجَنِي مِنَ السِّجْنِ وَجَاءَ بِكُم مِّنَ الْبَدْوِ مِن بَعْدِ أَن نَّزَغَ الشَّيْطَانُ بَيْنِي وَبَيْنَ إِخْوَتِي إِنَّ رَبِّي لَطِيفٌ لِّمَا يَشَاء إِنَّهُ هُوَ الْعَلِيمُ الْحَكِيمُ ١٠٠"]
                },
                {
                    "id":36,
                    "question":"توجيه يوسف بالدعاء لربّه ",
                    "ayat":["رَبِّ قَدْ آتَيْتَنِي مِنَ الْمُلْكِ وَعَلَّمْتَنِي مِن تَأْوِيلِ الأَحَادِيثِ فَاطِرَ السَّمَاوَاتِ وَالأَرْضِ أَنتَ وَلِيِّي فِي الدُّنْيَا وَالآخِرَةِ تَوَفَّنِي مُسْلِمًا وَأَلْحِقْنِي بِالصَّالِحِينَ ١٠١"]
                },
                {
                    "id":37,
                    "question":"الوحي بنبأ يوسف مع إخوته دليل على صدقه ﷺ ",
                    "ayat":["ذَلِكَ مِنْ أَنبَاء الْغَيْبِ نُوحِيهِ إِلَيْكَ وَمَا كُنتَ لَدَيْهِمْ إِذْ أَجْمَعُواْ أَمْرَهُمْ وَهُمْ يَمْكُرُونَ ١٠٢"]
                },
                {
                    "id":38,
                    "question":"قلّة المؤمنين سنّة كونيّة، مهما بلغ حرص الرّسول ﷺ، وإن كان لا يطلب أجرا على دعوته ولكن شأن الكفّار الإعراض والشّرك والأمن من العذاب والسّاعة ",
                    "ayat":["وَمَا أَكْثَرُ النَّاسِ وَلَوْ حَرَصْتَ بِمُؤْمِنِينَ ١٠٣ وَمَا تَسْأَلُهُمْ عَلَيْهِ مِنْ أَجْرٍ إِنْ هُوَ إِلاَّ ذِكْرٌ لِّلْعَالَمِينَ ١٠٤ وَكَأَيِّن مِّن آيَةٍ فِي السَّمَاوَاتِ وَالأَرْضِ يَمُرُّونَ عَلَيْهَا وَهُمْ عَنْهَا مُعْرِضُونَ ١٠٥ وَمَا يُؤْمِنُ أَكْثَرُهُمْ بِاللَّهِ إِلاَّ وَهُم مُّشْرِكُونَ ١٠٦ أَفَأَمِنُواْ أَن تَأْتِيَهُمْ غَاشِيَةٌ مِّنْ عَذَابِ اللَّهِ أَوْ تَأْتِيَهُمُ السَّاعَةُ بَغْتَةً وَهُمْ لاَ يَشْعُرُونَ ١٠٧"]
                },
                {
                    "id":39,
                    "question":"إعلان الرّسول ﷺ أسس دعوته ",
                    "ayat":["قُلْ هَذِهِ سَبِيلِي أَدْعُو إِلَى اللَّهِ عَلَى بَصِيرَةٍ أَنَاْ وَمَنِ اتَّبَعَنِي وَسُبْحَانَ اللَّهِ وَمَا أَنَاْ مِنَ الْمُشْرِكِينَ ١٠٨"]
                },
                {
                    "id":40,
                    "question":"إرسال الرّجال بالوحي سنّة ماضية، والعجب من عدم اعتبار الكفّار بعاقبة من قبلهم، وبيان حسن عاقبة المتّقين في الآخرة ",
                    "ayat":["وَمَا أَرْسَلْنَا مِن قَبْلِكَ إِلاَّ رِجَالاً نُّوحِي إِلَيْهِم مِّنْ أَهْلِ الْقُرَى أَفَلَمْ يَسِيرُواْ فِي الأَرْضِ فَيَنظُرُواْ كَيْفَ كَانَ عَاقِبَةُ الَّذِينَ مِن قَبْلِهِمْ وَلَدَارُ الآخِرَةِ خَيْرٌ لِّلَّذِينَ اتَّقَواْ أَفَلاَ تَعْقِلُونَ ١٠٩"]
                },
                {
                    "id":41,
                    "question":"سنّة الله في ابتلاء الأنبياء ثمّ نصرهم، ونزول البأس بالمجرمين ",
                    "ayat":["حَتَّى إِذَا اسْتَيْأَسَ الرُّسُلُ وَظَنُّواْ أَنَّهُمْ قَدْ كُذِبُواْ جَاءَهُمْ نَصْرُنَا فَنُجِّيَ مَن نَّشَاء وَلاَ يُرَدُّ بَأْسُنَا عَنِ الْقَوْمِ الْمُجْرِمِينَ ١١٠"]
                },
                {
                    "id":42,
                    "question":"أولو الألباب يعتبرون بقصص القرآن ويعلمون أنّه هدى ورحمة ",
                    "ayat":["لَقَدْ كَانَ فِي قَصَصِهِمْ عِبْرَةٌ لِّأُولِي الأَلْبَابِ مَا كَانَ حَدِيثًا يُفْتَرَى وَلَكِن تَصْدِيقَ الَّذِي بَيْنَ يَدَيْهِ وَتَفْصِيلَ كُلَّ شَيْءٍ وَهُدًى وَرَحْمَةً لِّقَوْمٍ يُؤْمِنُونَ ١١١"]
                }
            ]
        },
        {            
            "sura":"الرعد",
            "questions":  [
                {
                    "id": 1,
                    "question": "المقدمة: الإشارة إلى آيات الكتاب، وأنها منزلة من عند الله بالحق، وإن كان أكثر الناس لا يؤمنون ",
                    "ayat":[ "١"
                ]},
                {
                    "id": 2,
                    "question": "تفصيل آيات القدرة ودلائل اليقين بالبعث في الكون لقوم يتفكرون ويعقلون ",
                    "ayat":[ " ٤-٢"
                ]},
                {
                    "id": 3,
                    "question": "ثلاث من مواقف جهل الكفار والرد عليها: إنكارهم البعث؛ التعجيب منه والحكم بكفرهم، وبيان جزائهم الآخروي، استعجالهم للعذاب والرد عليهم، طلبهم آية حسية والرد عليهم ",
                    "ayat":[ " ٧-٥"
                ]},
                {
                    "id": 4,
                    "question": "من دلائل علم الله: علم الله لما في الأرحام، واستواء علم الغيب والشهادة عنده، وما أُسر وأُخفي من الأقوال والأعمال، وأن له معقبات يحفظون العباد وأعمالهم، وأنه لا ناصر لهم إن قضى الله بتغير حالهم أو إنزال السوء بهم ",
                    "ayat":[ " ١١-٨"
                ]},
                {
                    "id": 5,
                    "question": "تخويف المجادلين في الله بذكر تصرف الله بالبرق انتقاما وانعاما، وإنشاء السحاب وتسبيح الرعد وإرسال الصواقع ",
                    "ayat":[ "١٣-١٢"
                ]},
                {
                    "id": 6,
                    "question": "اختصاص الله بدعوة الحق، وضرب مثل لقصور المعبودات من دونه عن الاستجابة لعابديها وضياع دعاؤهم، وبيان خضوع الكون لله طوعا وكرها ",
                    "ayat":[ "١٥-١٤"
                ]},
                {
                    "id": 7,
                    "question": "الاحتجاج بربوبية الكون لله تعالى، وانتفاء المساواة بين الأعمى والظلمات وضديهما، وعجز أوليائهم عن الخلق، واختصاص الله بالخلق والوحدانية والقهر، وضرب مثلين للحق والباطل، وجزاء المستجيبين لربهم وندامة غير المستجيبين ",
                    "ayat":[ "١٨-١٦"
                ]},
                {
                    "id": 8,
                    "question": "نفي استواء العالم المؤمن والأعمى الكافر، وبيان تسع أوصاف لأولي الألباب، وجزاؤهم وتحية الملائكة لهم ",
                    "ayat":[ "٢٤-١٩"
                ]},
                {
                    "id": 9,
                    "question": "ثلاث خصال توجب اللعنة وسوء الدار، وتقرير بسط الله وتقديره لمن شاء، وجهل الكفار بفرحهم بالدنيا ",
                    "ayat":[ "٢٦-٢٥"
                ]},
                {
                    "id": 10,
                    "question": "طلب الكفار آية حسية، والرد عليهم ببيان اختصاص الله بالإضلال والهداية، وصفات المنيبين وجزاؤهم ",
                    "ayat":[ "٢٩-٢٧"
                ]},
                {
                    "id": 11,
                    "question": "أن إرساله ﷺ كالرسل من قبله، وأمره بتلاوة القرآن على الكفار وإعلان توحيده وتوكله ومرجعه لله تعالى ",
                    "ayat":[ "٣٠"
                ]},
                {
                    "id": 12,
                    "question": "بيان عظمة القرآن، وتذكير المؤمنين بأن الهداية بمشيئة الله، ووعد الكفار بالقوارع، وأن سنة الله الاملاء للمستهزئين بالرسل ثم أخذهم بالعقاب ",
                    "ayat":[ "٣٢-٣١"
                ]},
                {
                    "id": 13,
                    "question": "استحالة تسوية الله القيوم بغيره، وتوبيخ المشركين لتسمية معبوداتهم شركاء، وإخبارهم عنهم بما لا وجود له في الأرض ولا حقيقة له، وبيان أسباب ضلالهم، وما أعد لهم في الدنيا والآخرة ",
                    "ayat":[ "٣٤-٣٣"
                ]},
                {
                    "id": 14,
                    "question": "صفة جنة المتقين وعقباهم، وبيان عقبى الكفار ",
                    "ayat":[ "٣٥"
                ]},
                {
                    "id": 15,
                    "question": "الموقف من الوحي: فرحٌ بالكتاب أو إنكارٌ له، وأمر النبي ﷺ بإعلان عبوديته لله ودعوته ومآبه إليه، وتقرير نزول القرآن حكما عربيا وتحذير النبي ﷺ من اتباع أهواء المشركين ",
                    "ayat":[ "٣٧-٣٦"
                ]},
                {
                    "id": 16,
                    "question": "لكل الرسل أزواج ودرية، وليس لأحدهم أن يأتي بآية إلا بإذن الله، ولكل شيء نهاية مكتوبة، يمحو الله ما يشاء منها ويثبت، وليس على الرسول إلا البالغ ",
                    "ayat":[ "٤٠-٣٨"
                ]},
                {
                    "id": 17,
                    "question": "حكم الله بانتشار الإسلام ونقص الكفر، وتوعد الماكرين بمكر الله وعلمه، والتعريض بخسارتهم للدار الآخرة ",
                    "ayat":[ "٤٢-٤١"
                ]},
                {
                    "id": 18,
                    "question": "الخاتمة: الرد على منكري الرسالة بشهادة الله تعالى، وبشهادة علماء أهل الكتاب ",
                    "ayat":[ "٤٣"
                    ]
                }
            ]
        },
        {
            "sura":"إبراهيم",
            "questions": [
                {
                    "id": 1,
                    "question": "المقدمة: إنزال الكتاب على النبي ﷺ وبيان الغاية منه، وتوعد الكافرين وبعض أسباب ضلالهم ",
                    "ayat":[ " ٣-١"
                ]},
                {
                    "id": 2,
                    "question": "إرسال الرسل بلسان أقوامهم، ومشيئة الله في إضلال قوم أو هدايتهم ",
                    "ayat":[ "٤"
                ]},
                {
                    "id": 3,
                    "question": "إرسال موسى عليه السلام بالآيات للهداية والتذكير، وتذكيره لقومه نعم الله، وحثهم على الشكر وتحذيرهم من الكفر، وبيان غنى الله ",
                    "ayat":[ " ٨-٥"
                ]},
                {
                    "id": 4,
                    "question": "التذكير بنبأ الأقوام السابقة مع رسلهم وبيان ردهم الفعلي، وردهم القولي بإعلانهم الكفر والشك في الدعوة والرد عليهم، وباعتراضهم على بشرية الرسل والتمسك بعبادة آبائهم والرد عليهم ",
                    "ayat":[ " ١٢-٩"
                ]},
                {
                    "id": 5,
                    "question": "تهديد الكفار لرسلهم بالإخراج أو العودة إلى ملتهم، والوحي بهلاك الظالمين وإسكانهم الأرض بعدهم ",
                    "ayat":[ "١٤-١٣"
                ]},
                {
                    "id": 6,
                    "question": "استفتاحٌ، وخيبةٌ، وصديدٌ لا يستساغ، وموتٌ من كل مكان، وعذاب غليظ ",
                    "ayat":[ "١٧-١٥"
                ]},
                {
                    "id": 7,
                    "question": "ضرب مثل لحبوط أعمال الكفار ",
                    "ayat":[ "١٨"
                ]},
                {
                    "id": 8,
                    "question": "التنبيه على قدرة الخالق على الإهلاك والإيجاد، وأنه عليه غير غزيز ",
                    "ayat":[ "٢٠-١٩"
                ]},
                {
                    "id": 9,
                    "question": "بروز الضعفاء والمستكبرين يوم القيامة، والحوار فيما بينهم ",
                    "ayat":[ "٢١"
                ]},
                {
                    "id": 10,
                    "question": "خطبة الشيطان في أهل النار وإدخال المؤمنين الجنات وتحيتهم فيها ",
                    "ayat":[ "٢٣-٢٢"
                ]},
                {
                    "id": 11,
                    "question": "ضرب مثل للكلمة الطيبة والكلمة الخبيثة، والتعقيب بتثبيت الله للمؤمنين وإضلاله للظالمين ",
                    "ayat":[ "٢٧-٢٤"
                ]},
                {
                    "id": 12,
                    "question": "التنبيه إلى مآل من كفر بنعم الله، وبيان دارهم وقرارهم ",
                    "ayat":[ "٢٩-٢٨"
                ]},
                {
                    "id": 13,
                    "question": "تهديد متخذي الأنداد المضلين، ودعوة للمؤمنين للتزود من الطاعة قبل الساعة ",
                    "ayat":[ "٣١-٣٠"
                ]},
                {
                    "id": 14,
                    "question": "خلق ورزق وتسخير وإجابة سؤل، نعمٌ لا تحصى لإنسان ظلوم كفار ",
                    "ayat":[ "٣٤-٣٢"
                ]},
                {
                    "id": 15,
                    "question": "دعوات إبراهيم عليه السلام ",
                    "ayat":[ "٤١-٣٥"
                ]},
                {
                    "id": 16,
                    "question": "علم الله بأعمال الظالمين وتأخيرهم إلى يوم القيامة وبيان أحوالهم فيه ",
                    "ayat":[ "٤٣-٤٢"
                ]},
                {
                    "id": 17,
                    "question": "الأمر بإنذار الناس، وتوعدهم بالعذاب وبيان ندامتهم في يوم العذاب والرد عليهم ",
                    "ayat":[ "٤٥-٤٤"
                ]},
                {
                    "id": 18,
                    "question": "مكر الكفار في الدنيا، وتمام وعد الله وانتقامه لرسله يوم التبديل والبروز وجزاء المجرمين فيه ",
                    "ayat":[ "٥١-٤٦"
                ]},
                {
                    "id": 19,
                    "question": "الخاتمة: بلاغٌ وإنذارٌ وإعلامٌ وتذكير ",
                    "ayat":[ "٥٢"
                    ]
                }
            ]
        },
        {
            "sura":"الحجر",
            "questions": [
                {
                    "id": 1,
                    "question": "المقدمة: التنويه بشرف الكتاب وبيان القرآن ",
                    "ayat":[ "١"
                ]},
                {
                    "id": 2,
                    "question": "ندامة الكفار على تركهم الإسلام، وإمهالهم وتهديدهم بهلاك كغيرهم لا يتقدم ولا يتأخر ",
                    "ayat":[ " ٥-٢"
                ]},
                {
                    "id": 3,
                    "question": "اتهام الكفار للنبي ﷺ بالجنون وطلبهم نزول الملائكة، والرد عليهم ",
                    "ayat":[ " ٨-٦"
                ]},
                {
                    "id": 4,
                    "question": "تسلية النبي ﷺ ببيان حقظ الله للوحي، وإرسال الرسل قبله، وعادة المجرمين في الاستهزاء بهم، وأن الله يسلك ذلك في قلوبهم فيمتنعوا من الإيمان كالأولين من قبلهم ",
                    "ayat":[ "١٣-٩"
                ]},
                {
                    "id": 5,
                    "question": "الاستدلال على عناد الكفار وتعنتهم بالفرض والتقدير ",
                    "ayat":[ "١٦-١٤"
                ]},
                {
                    "id": 6,
                    "question": "حجج كونية تدل على الوحدانية (تزين السماء وحفظها – مد الأرض وتقدير المعايش والأرزاق – وإرسال الرياح بالماء",
                    "ayat":[ "٢٢-١٧"
                ]},
                {
                    "id": 7,
                    "question": "حجج شرعية تبين قدرة الله على الإحياء والإماتة، وإحاطة علمه بالجميع، وقدرته على الحشر ",
                    "ayat":[ "٢٥-٢٣"
                ]},
                {
                    "id": 8,
                    "question": "أصل خلق الإنسان والجان ",
                    "ayat":[ "٢٧-٢٦"
                ]},
                {
                    "id": 9,
                    "question": "خلق آدم وأمر الملائكة بالسجود له، وإباء إبليس احتقارا للبشر، والحكم عليه بالإخراج واللعنة ",
                    "ayat":[ "٣٥-٢٨"
                ]},
                {
                    "id": 10,
                    "question": "طلب إبليس الانظار وإجابته لذلك، وتوعده بإغواء الإنس واستثناء المخلصين ",
                    "ayat":[ "٤٠-٣٦"
                ]},
                {
                    "id": 11,
                    "question": "قضاء الله تعالى بأن لا يكون له سلطان إلا على الغاووين، وتوعدهم بجهنم وأبوابها السبعة، ووعد المتقين بالجنات وما فيها من نعيم ",
                    "ayat":[ "٤٨-٤١"
                ]},
                {
                    "id": 12,
                    "question": "الإعلام بأن الله غفور رحيم وذو عذاب أليم ",
                    "ayat":[ "٥٠-٤٩"
                ]},
                {
                    "id": 13,
                    "question": "بشارة أضياف إبراهيم بغلام عليم، والاخبار بإرسالهم بالهلاك إلى قوم لوط المجرمين، واستثناء آل لوط منهم، واستثناء امرأته منهم ",
                    "ayat":[ "٦٠-٥١"
                ]},
                {
                    "id": 14,
                    "question": "قدوم الملائكة على قوم لوط، وانكاره لهم، وإخباره بهلاك قومه الذي استعجلوه صباحا ",
                    "ayat":[ "٦٦-٦١"
                ]},
                {
                    "id": 15,
                    "question": "قدوم قوم لوط طلبا لأضيافه، والحوار بينه وبينهم ",
                    "ayat":[ "٧١-٦٧"
                ]},
                {
                    "id": 16,
                    "question": "القسم على عمهم، والخبر بهلاكهم وقلب ديارهم آيات للمتوسمين وعبرة للمارين من المؤمنين ",
                    "ayat":[ "٧٧-٧٢"
                ]},
                {
                    "id": 17,
                    "question": "ظلم أصحاب الأيكة، والانتقام منهم ",
                    "ayat":[ "٧٩-٧٨"
                ]},
                {
                    "id": 18,
                    "question": "تكذيب أصحاب الحجر وإعراضهم وقوتهم وأمنهم ثم أخذهم بالصيحة دون أن ينفعهم ما كسبوه ",
                    "ayat":[ "٨٤-٨٠"
                ]},
                {
                    "id": 19,
                    "question": "الخاتمة: تسلية: خلق السموات والأرض بالحق وتأكيد الساعة وجملة من التوجيهات، وبيان كفاية الله له وتثبيته على الطاعة ",
                    "ayat":[ "٩٩-٨٥"
                    ]
                }
            ]
        },
        {
            "sura":"الإسراء",
            "questions": [
                {
                    "id": 1,
                    "question": " إعالم بني إسرائيل بإثنين من أحوال إفسادهم وعاقبة ذلك، ترغيب وترهيب ",
                    "ayat":[ "وَقَضَيْنَا إِلَى بَنِي إِسْرَائِيلَ فِي الْكِتَابِ لَتُفْسِدُنَّ فِي الأَرْضِ مَرَّتَيْنِ وَلَتَعْلُنَّ عُلُوًّا كَبِيرًا ٤ فَإِذَا جَاءَ وَعْدُ أُولاهُمَا بَعَثْنَا عَلَيْكُمْ عِبَادًا لَّنَا أُولِي بَأْسٍ شَدِيدٍ فَجَاسُواْ خِلالَ الدِّيَارِ وَكَانَ وَعْدًا مَّفْعُولاً ٥ ثُمَّ رَدَدْنَا لَكُمُ الْكَرَّةَ عَلَيْهِمْ وَأَمْدَدْنَاكُم بِأَمْوَالٍ وَبَنِينَ وَجَعَلْنَاكُمْ أَكْثَرَ نَفِيرًا ٦ إِنْ أَحْسَنتُمْ أَحْسَنتُمْ لأَنفُسِكُمْ وَإِنْ أَسَأْتُمْ فَلَهَا فَإِذَا جَاءَ وَعْدُ الآخِرَةِ لِيَسُوؤُواْ وُجُوهَكُمْ وَلِيَدْخُلُواْ الْمَسْجِدَ كَمَا دَخَلُوهُ أَوَّلَ مَرَّةٍ وَلِيُتَبِّرُواْ مَا عَلَوْا تَتْبِيرًا ٧ عَسَى رَبُّكُمْ أَن يَرْحَمَكُمْ وَإِنْ عُدتُّمْ عُدْنَا وَجَعَلْنَا جَهَنَّمَ لِلْكَافِرِينَ حَصِيرًا ٨ "]
                },
                {
                    "id": 2,
                    "question": "المقابلة بين جزاء من أراد العاجلة، ومن أراد الآخرة، والنظر في تفاضل الخلق في الدنيا وفي درجات الآخرة ",
                    "ayat":[ "مَّن كَانَ يُرِيدُ الْعَاجِلَةَ عَجَّلْنَا لَهُ فِيهَا مَا نَشَاء لِمَن نُّرِيدُ ثُمَّ جَعَلْنَا لَهُ جَهَنَّمَ يَصْلاهَا مَذْمُومًا مَّدْحُورًا ١٨ وَمَنْ أَرَادَ الآخِرَةَ وَسَعَى لَهَا سَعْيَهَا وَهُوَ مُؤْمِنٌ فَأُولَئِكَ كَانَ سَعْيُهُم مَّشْكُورًا ١٩ كُلاًّ نُّمِدُّ هَؤُلاء وَهَؤُلاء مِنْ عَطَاء رَبِّكَ وَمَا كَانَ عَطَاء رَبِّكَ مَحْظُورًا ٢٠ انظُرْ كَيْفَ فَضَّلْنَا بَعْضَهُمْ عَلَى بَعْضٍ وَلَلآخِرَةُ أَكْبَرُ دَرَجَاتٍ وَأَكْبَرُ تَفْضِيلاً ٢١ "]
                },
                {
                    "id": 3,
                    "question": " آيات الحكمة ",
                    "ayat":[ "وَقَضَى رَبُّكَ أَلاَّ تَعْبُدُواْ إِلاَّ إِيَّاهُ وَبِالْوَالِدَيْنِ إِحْسَانًا إِمَّا يَبْلُغَنَّ عِندَكَ الْكِبَرَ أَحَدُهُمَا أَوْ كِلاهُمَا فَلاَ تَقُل لَّهُمَا أُفٍّ وَلاَ تَنْهَرْهُمَا وَقُل لَّهُمَا قَوْلاً كَرِيمًا ٢٣ وَاخْفِضْ لَهُمَا جَنَاحَ الذُّلِّ مِنَ الرَّحْمَةِ وَقُل رَّبِّ ارْحَمْهُمَا كَمَا رَبَّيَانِي صَغِيرًا ٢٤ رَّبُّكُمْ أَعْلَمُ بِمَا فِي نُفُوسِكُمْ إِن تَكُونُواْ صَالِحِينَ فَإِنَّهُ كَانَ لِلأَوَّابِينَ غَفُورًا ٢٥ وَآتِ ذَا الْقُرْبَى حَقَّهُ وَالْمِسْكِينَ وَابْنَ السَّبِيلِ وَلاَ تُبَذِّرْ تَبْذِيرًا ٢٦ إِنَّ الْمُبَذِّرِينَ كَانُواْ إِخْوَانَ الشَّيَاطِينِ وَكَانَ الشَّيْطَانُ لِرَبِّهِ كَفُورًا ٢٧ وَإِمَّا تُعْرِضَنَّ عَنْهُمُ ابْتِغَاء رَحْمَةٍ مِّن رَّبِّكَ تَرْجُوهَا فَقُل لَّهُمْ قَوْلاً مَّيْسُورًا ٢٨ وَلاَ تَجْعَلْ يَدَكَ مَغْلُولَةً إِلَى عُنُقِكَ وَلاَ تَبْسُطْهَا كُلَّ الْبَسْطِ فَتَقْعُدَ مَلُومًا مَّحْسُورًا ٢٩ إِنَّ رَبَّكَ يَبْسُطُ الرِّزْقَ لِمَن يَشَاء وَيَقْدِرُ إِنَّهُ كَانَ بِعِبَادِهِ خَبِيرًا بَصِيرًا ٣٠ وَلاَ تَقْتُلُواْ أَوْلادَكُمْ خَشْيَةَ إِمْلاقٍ نَّحْنُ نَرْزُقُهُمْ وَإِيَّاكُم إِنَّ قَتْلَهُمْ كَانَ خِطْءًا كَبِيرًا ٣١ وَلاَ تَقْرَبُواْ الزِّنَى إِنَّهُ كَانَ فَاحِشَةً وَسَاء سَبِيلاً ٣٢ وَلاَ تَقْتُلُواْ النَّفْسَ الَّتِي حَرَّمَ اللَّهُ إِلاَّ بِالْحَقِّ وَمَن قُتِلَ مَظْلُومًا فَقَدْ جَعَلْنَا لِوَلِيِّهِ سُلْطَانًا فَلاَ يُسْرِف فِّي الْقَتْلِ إِنَّهُ كَانَ مَنْصُورًا ٣٣ وَلاَ تَقْرَبُواْ مَالَ الْيَتِيمِ إِلاَّ بِالَّتِي هِيَ أَحْسَنُ حَتَّى يَبْلُغَ أَشُدَّهُ وَأَوْفُواْ بِالْعَهْدِ إِنَّ الْعَهْدَ كَانَ مَسْؤُولاً ٣٤ وَأَوْفُوا الْكَيْلَ إِذَا كِلْتُمْ وَزِنُواْ بِالْقِسْطَاسِ الْمُسْتَقِيمِ ذَلِكَ خَيْرٌ وَأَحْسَنُ تَأْوِيلاً ٣٥ وَلاَ تَقْفُ مَا لَيْسَ لَكَ بِهِ عِلْمٌ إِنَّ السَّمْعَ وَالْبَصَرَ وَالْفُؤَادَ كُلُّ أُوْلَئِكَ كَانَ عَنْهُ مَسْؤُولاً ٣٦ وَلاَ تَمْشِ فِي الأَرْضِ مَرَحًا إِنَّكَ لَن تَخْرِقَ الأَرْضَ وَلَن تَبْلُغَ الْجِبَالَ طُولاً ٣٧ كُلُّ ذَلِكَ كَانَ سَيِّئُهُ عِندَ رَبِّكَ مَكْرُوهًا ٣٨ ذَلِكَ مِمَّا أَوْحَى إِلَيْكَ رَبُّكَ مِنَ الْحِكْمَةِ وَلاَ تَجْعَلْ مَعَ اللَّهِ إِلَهًا آخَرَ فَتُلْقَى فِي جَهَنَّمَ مَلُومًا مَّدْحُورًا ٣٩ "]
                },
                {
                    "id": 4,
                    "question": "  حال المكذبين بالآخرة عند قراءة النبي ﷺ القرآن، وأقوالهم  ",
                    "ayat":[ "وَإِذَا قَرَأْتَ الْقُرْآنَ جَعَلْنَا بَيْنَكَ وَبَيْنَ الَّذِينَ لاَ يُؤْمِنُونَ بِالآخِرَةِ حِجَابًا مَّسْتُورًا ٤٥ وَجَعَلْنَا عَلَى قُلُوبِهِمْ أَكِنَّةً أَن يَفْقَهُوهُ وَفِي آذَانِهِمْ وَقْرًا وَإِذَا ذَكَرْتَ رَبَّكَ فِي الْقُرْآنِ وَحْدَهُ وَلَّوْا عَلَى أَدْبَارِهِمْ نُفُورًا ٤٦ نَّحْنُ أَعْلَمُ بِمَا يَسْتَمِعُونَ بِهِ إِذْ يَسْتَمِعُونَ إِلَيْكَ وَإِذْ هُمْ نَجْوَى إِذْ يَقُولُ الظَّالِمُونَ إِن تَتَّبِعُونَ إِلاَّ رَجُلاً مَّسْحُورًا ٤٧ انظُرْ كَيْفَ ضَرَبُواْ لَكَ الأَمْثَالَ فَضَلُّواْ فَلاَ يَسْتَطِيعُونَ سَبِيلاً ٤٨ "]
                },
                {
                    "id": 5,
                    "question": "من أقوال المكذبين للبعث، وتلقين النبي ﷺ الرد عليهم  ",
                    "ayat":[ "وَقَالُواْ أَئِذَا كُنَّا عِظَامًا وَرُفَاتًا أَإِنَّا لَمَبْعُوثُونَ خَلْقًا جَدِيدًا ٤٩ قُل كُونُواْ حِجَارَةً أَوْ حَدِيدًا ٥٠ أَوْ خَلْقًا مِّمَّا يَكْبُرُ فِي صُدُورِكُمْ فَسَيَقُولُونَ مَن يُعِيدُنَا قُلِ الَّذِي فَطَرَكُمْ أَوَّلَ مَرَّةٍ فَسَيُنْغِضُونَ إِلَيْكَ رُؤُوسَهُمْ وَيَقُولُونَ مَتَى هُوَ قُلْ عَسَى أَن يَكُونَ قَرِيبًا ٥١ يَوْمَ يَدْعُوكُمْ فَتَسْتَجِيبُونَ بِحَمْدِهِ وَتَظُنُّونَ إِن لَّبِثْتُمْ إِلاَّ قَلِيلاً ٥٢ "]
                },
                {
                    "id": 6,
                    "question": "أمر الملائكة بالسجود لآدم، واعتراض ابليس، وتهديده، ونفي الوسوسة عن عباد الله وحفظهم ",
                    "ayat":[ "وَإِذْ قُلْنَا لِلْمَلائِكَةِ اسْجُدُواْ لآدَمَ فَسَجَدُواْ إِلاَّ إِبْلِيسَ قَالَ أَأَسْجُدُ لِمَنْ خَلَقْتَ طِينًا ٦١ قَالَ أَرَأَيْتَكَ هَذَا الَّذِي كَرَّمْتَ عَلَيَّ لَئِنْ أَخَّرْتَنِ إِلَى يَوْمِ الْقِيَامَةِ لأَحْتَنِكَنَّ ذُرِّيَّتَهُ إِلاَّ قَلِيلاً ٦٢ قَالَ اذْهَبْ فَمَن تَبِعَكَ مِنْهُمْ فَإِنَّ جَهَنَّمَ جَزَاؤُكُمْ جَزَاء مَّوْفُورًا ٦٣ وَاسْتَفْزِزْ مَنِ اسْتَطَعْتَ مِنْهُمْ بِصَوْتِكَ وَأَجْلِبْ عَلَيْهِم بِخَيْلِكَ وَرَجِلِكَ وَشَارِكْهُمْ فِي الأَمْوَالِ وَالأَوْلادِ وَعِدْهُمْ وَمَا يَعِدُهُمُ الشَّيْطَانُ إِلاَّ غُرُورًا ٦٤ إِنَّ عِبَادِي لَيْسَ لَكَ عَلَيْهِمْ سُلْطَانٌ وَكَفَى بِرَبِّكَ وَكِيلاً ٦٥ "]
                },
                {
                    "id": 7,
                    "question": "من مكائد المشركين محاولتهم فتنة النبي ﷺ في الوحي ومحاولتهم إخراجه وسنة الله تعالى التي لا تتحول  ",
                    "ayat":[ "وَإِن كَادُواْ لَيَفْتِنُونَكَ عَنِ الَّذِي أَوْحَيْنَا إِلَيْكَ لِتَفْتَرِيَ عَلَيْنَا غَيْرَهُ وَإِذًا لاَّتَّخَذُوكَ خَلِيلاً ٧٣ وَلَوْلاَ أَن ثَبَّتْنَاكَ لَقَدْ كِدتَّ تَرْكَنُ إِلَيْهِمْ شَيْئًا قَلِيلاً ٧٤ إِذَاً لَّأَذَقْنَاكَ ضِعْفَ الْحَيَاةِ وَضِعْفَ الْمَمَاتِ ثُمَّ لاَ تَجِدُ لَكَ عَلَيْنَا نَصِيرًا ٧٥وَإِن كَادُواْ لَيَسْتَفِزُّونَكَ مِنَ الأَرْضِ لِيُخْرِجُوكَ مِنْهَا وَإِذًا لاَّ يَلْبَثُونَ خِلافَكَ إِلاَّ قَلِيلاً ٧٦ سُنَّةَ مَن قَدْ أَرْسَلْنَا قَبْلَكَ مِن رُّسُلِنَا وَلاَ تَجِدُ لِسُنَّتِنَا تَحْوِيلاً ٧٧ "]
                },
                {
                    "id": 8,
                    "question": " سؤالهم عن الروح، وبيان قدرة الله في سلب الوحى وامتناع الله رحمة وفضلا، والتحدي بالقرآن وتنوع أمثاله",
                    "ayat":[ "وَيَسْأَلُونَكَ عَنِ الرُّوحِ قُلِ الرُّوحُ مِنْ أَمْرِ رَبِّي وَمَا أُوتِيتُم مِّن الْعِلْمِ إِلاَّ قَلِيلاً ٨٥ وَلَئِن شِئْنَا لَنَذْهَبَنَّ بِالَّذِي أَوْحَيْنَا إِلَيْكَ ثُمَّ لاَ تَجِدُ لَكَ بِهِ عَلَيْنَا وَكِيلاً ٨٦ إِلاَّ رَحْمَةً مِّن رَّبِّكَ إِنَّ فَضْلَهُ كَانَ عَلَيْكَ كَبِيرًا ٨٧ قُل لَّئِنِ اجْتَمَعَتِ الإِنسُ وَالْجِنُّ عَلَى أَن يَأْتُواْ بِمِثْلِ هَذَا الْقُرْآنِ لاَ يَأْتُونَ بِمِثْلِهِ وَلَوْ كَانَ بَعْضُهُمْ لِبَعْضٍ ظَهِيرًا ٨٨ وَلَقَدْ صَرَّفْنَا لِلنَّاسِ فِي هَذَا الْقُرْآنِ مِن كُلِّ مَثَلٍ فَأَبَى أَكْثَرُ النَّاسِ إِلاَّ كُفُورًا ٨٩ "]
                },
                {
                    "id": 9,
                    "question": " امتناعهم عن الإيمان و٦ مطالب حسية غير القرآن والرد على تلك المطالب ",
                    "ayat":[ "وَقَالُواْ لَن نُّؤْمِنَ لَكَ حَتَّى تَفْجُرَ لَنَا مِنَ الأَرْضِ يَنبُوعًا ٩٠ أَوْ تَكُونَ لَكَ جَنَّةٌ مِّن نَّخِيلٍ وَعِنَبٍ فَتُفَجِّرَ الأَنْهَارَ خِلالَهَا تَفْجِيرًا ٩١ أَوْ تُسْقِطَ السَّمَاء كَمَا زَعَمْتَ عَلَيْنَا كِسَفًا أَوْ تَأْتِيَ بِاللَّهِ وَالْمَلائِكَةِ قَبِيلاً ٩٢ أَوْ يَكُونَ لَكَ بَيْتٌ مِّن زُخْرُفٍ أَوْ تَرْقَى فِي السَّمَاء وَلَن نُّؤْمِنَ لِرُقِيِّكَ حَتَّى تُنَزِّلَ عَلَيْنَا كِتَابًا نَّقْرَؤُهُ قُلْ سُبْحَانَ رَبِّي هَلْ كُنتُ إِلاَّ بَشَرًا رَّسُولاً ٩٣"]
                },
                {
                    "id": 10,
                    "question": " تسلية النبي ﷺ بذكر مواقف فرعون من آيات موسى، والحوار بينهما وأغراقه",
                    "ayat":[ "وَلَقَدْ آتَيْنَا مُوسَى تِسْعَ آيَاتٍ بَيِّنَاتٍ فَاسْأَلْ بَنِي إِسْرَائِيلَ إِذْ جَاءَهُمْ فَقَالَ لَهُ فِرْعَوْنُ إِنِّي لَأَظُنُّكَ يَا مُوسَى مَسْحُورًا ١٠١ قَالَ لَقَدْ عَلِمْتَ مَا أَنزَلَ هَؤُلاء إِلاَّ رَبُّ السَّمَاوَاتِ وَالأَرْضِ بَصَائِرَ وَإِنِّي لَأَظُنُّكَ يَا فِرْعَوْنُ مَثْبُورًا ١٠٢ فَأَرَادَ أَن يَسْتَفِزَّهُم مِّنَ الأَرْضِ فَأَغْرَقْنَاهُ وَمَن مَّعَهُ جَمِيعًا ١٠٣ وَقُلْنَا مِن بَعْدِهِ لِبَنِي إِسْرَائِيلَ اسْكُنُواْ الأَرْضَ فَإِذَا جَاءَ وَعْدُ الآخِرَةِ جِئْنَا بِكُمْ لَفِيفًا ١٠٤"]
                }
            ]
        },
        {
            "sura":"الكهف",
            "questions":[
                {
                    "id": 1,
                    "question": "In Progress...check back later",
                    "ayat":[ ""
                ]}
            ]
        }
]
