{
  "mahawir": [
    {
      "sura":"البقرة",
      "questions": [
        {
          "id": 1
        }
      ]
    },
    {
      "sura":"آل عمران",
      "questions": [
        {
          "id": 1
        }
      ]
    },     
    {
      "sura":"النساء",
      "questions": [
        {
          "id": 1,
          "question": "المقدمة: أمر الناس بتقوى الله, خالق البشرية، والوصية بمراقبة الله في ذوي الأرحام",
          "ayat": "1"
        },
        {
          "id": 2,
          "question": "إيتاء اليتامى أموالهم والتحذير من استبدالها أو أكلها",
          "ayat": "2"
        },
        {
          "id": 3,
          "question": "نكاح اليتامى وإباحة التعدد مع العدل، أو الاقتصار علي الواحدة أو ملك اليمين عند تعذره",
          "ayat": "3"
        },
        {
          "id": 4,
          "question": "حق المرأة في الصداق و حل ما تطيب به نفسها عنه",
          "ayat": "4"
        },
        {
          "id": 5,
          "question": "وجوه التصرف في أموال السفهاء",
          "ayat": "5"
        },
        {
          "id": 6,
          "question": "اختبار اليتامى قبل دفع أموالهم إليهم، وحكم أكل الولي منها، والإشهاد على تسليمها",
          "ayat": "6"
        },
        {
          "id": 7,
          "question": "اشتراك الرجال والنساء في الميراث، واستحباب إكرام من حضر القسمة من غير الورثة",
          "ayat": " 8 - 7"
        },
        {
          "id": 8,
          "question": "وعظ وتهديد؛ وعظ لكل من أمر ونهى في شأن الوصية وأموال اليتامى، وتهديد الظالمين",
          "ayat": " 10 - 9"
        },
        {
          "id": 9,
          "question": "بيان ما فرض الله للأولاد وللوالدين بعد إخراج الوصية و الدين",
          "ayat": "11"
        },
        {
          "id": 10,
          "question": "بيان فرض الزوج والزوجة، والإخوة لأم \"كلالة الشتاء\" بعد إخراج الوصية والدين بغير مضارة",
          "ayat": "12"
        },
        {
          "id": 11,
          "question": "تأكيد ووعد ووعيد؛ تأكيد التزام حدود الله، ووعد الطائعين، ووعيد العصاة المعتدين",
          "ayat": "14 - 13"
        },
        {
          "id": 12,
          "question": "عقوبة الفاحشة قبل تشريع حد الزنا، وأحوال قبول التوبة وردها",
          "ayat": "18 - 15"
        },
        {
          "id": 13,
          "question": "إبطال عادة الجاهلية في توارث المرأة، وحكم عضلها، والأمر بالمعاشرة بالمعروف، وتقبيح استرجاع شيء من المهر عند رغبة الزوج في الطلاق",
          "ayat": "21 - 19"
        },
        {
          "id": 14,
          "question": "تحريم نكاح ما نكح الآباء، وبيان المحرمات من النساء بالنسب والرضاع والمصاهرة والجمع، وشروط نكاح المحصنات",
          "ayat": "24 - 22"
        },
        {
          "id": 15,
          "question": "الإذن بالزواج من الإماء، وشروطه، وعقوبة فاحشتهن، والترغيب في الصبر عن نكاحهن",
          "ayat": "25"
        },
        {
          "id": 16,
          "question": "موعظة بين الأحكام: بيان الحكمة من الأحكام الشرعية، والتحذير من أهل الشهوات، وبيان ضعف الإنسان",
          "ayat": "27 - 26"
        },
        {
          "id": 17,
          "question": "تذكير المؤمنين بحرمة الأموال والأنفس، ووعيد، ووعد",
          "ayat": "31 - 29"
        },
        {
          "id": 18,
          "question": "النهي عن تمني ما خص الله به كلا من الجنسين، وعلاجه، وبيان أن لكل منهما ورثة، وحق الموالي في النصرة وإتمام العهد",
          "ayat": "33 - 32"
        },
        {
          "id": 19,
          "question": "قوامة الرجال على النساء، وأوصاف الصالحات منهن، وعلاج نشوزهن، وطرق تسوية النزاع بين الأزواج",
          "ayat": "35 - 34"
        },
        {
          "id": 20,
          "question": "بيان الحقوق العَشَرة، والتحذير من الفخر والبخل، وكتمان فضل الله و الإنفاق رياءً، وخسرانهم بكفرهم",
          "ayat": "39 - 36"
        },
        {
          "id": 21,
          "question": "التذكير بعدل الله وكرمه، وشهادة الرسول صلي الله عليه وسلم على قومه، وحسرة الكفار العصاة يوم القيامة",
          "ayat": "42 - 40"
        },
        {
          "id": 22,
          "question": "نهي المؤمنين عن قربان الصلاة حال السكر والجنابة، وتشريع التيمم",
          "ayat": "43"
        },
        {
          "id": 23,
          "question": "بيان ضلال أهل الكتاب وعداوتهم والتحذي منهم",
          "ayat": "45 - 44"
        },
        {
          "id": 24,
          "question": "بعض أفعال وأقوال اليهود القبيحة، ولعن الله لهم",
          "ayat": "46"
        },
        {
          "id": 25,
          "question": "دعوة أهل الكتاب للإيمان وتهديدهم بالطمس واللعن، والحرمان من المغفرة بسبب افتراء الشرك",
          "ayat": "48 - 47"
        },
        {
          "id": 26,
          "question": "تزكية اليهود لأنفسهم وافترائهم الكذب على الله",
          "ayat": "50 - 49"
        },
        {
          "id": 27,
          "question": "بيان كفر أهل الكتاب، وتفضيلهم للكفار، ولعن الله لهم، وبيان بخلهم وحسدهم للمسلمين",
          "ayat": "55 - 51"
        },
        {
          "id": 28,
          "question": "عذاب الكفار ونعيم المؤمنين",
          "ayat": "57 - 56"
        },
        {
          "id": 29,
          "question": "توطئة: الأمر بأداء الأمانات والحكم بالعدل، وطاعة الله ورسوله وأولي الأمر، ورد التنازع إليهما",
          "ayat": "59 - 58"
        },
        {
          "id": 30,
          "question": "فضح المنافقين بذكر تحاكمهم الى الطاغوت، وصدودهم عن الله ورسوله، وحالهم عند نزول المصيبة، وأمر الرسول ﷺ بالإعراض عنهم ووعظهم وزجرهم",
          "ayat": "63 - 60"
        },
        {
          "id": 31,
          "question": "بيان لزوم طاعة الرسول وكفارة مخالفته، وأن تحكيم الشريعة والإستسلام لها برهان الإيمان",
          "ayat": "65 - 64"
        },
        {
          "id": 32,
          "question": "بيان طبع العناد والعصيان عند المنافقين، وحرمانهم من جزاء الطاعة، وفضل الله على المطيعين",
          "ayat": "70 - 66"
        },
        {
          "id": 33,
          "question": "أمر المؤمنين بالحذر من مباغتة الكفار، والتحذير من تثبيط المنافقين، وبيان أقوالهم حال الهزيمة والنصر",
          "ayat": "73 - 71"
        },
        {
          "id": 34,
          "question": "الترغيب بالقتال في سبيل الله ببيان جزائه وضرورته وغايته المبشرة بالنصر",
          "ayat": "76 - 74"
        },
        {
          "id": 35,
          "question": "حال من جبن عن القتال بعد تمنيه، والرد عليهم، وتطير بعضهم بالرسول ﷺ، والرد عليهم، وتأكيد رسالته ﷺ، ولزوم طاعته لتحقيق طاعة الله",
          "ayat": "80 - 77"
        },
        {
          "id": 36,
          "question": "بيان موقف المنافقين من طاعة الرسول ﷺ، وتسليته، والعجب من عدم تدبرهم للقرآن المحكم",
          "ayat": "82 - 81"
        },
        {
          "id": 37,
          "question": "بيان موقف المنافقين من إذاعة الأخبار قبل التحقق من صدقها، تذكير المؤمنين بفضل الله ورحمته",
          "ayat": "83"
        },
        {
          "id": 38,
          "question": "تسلية: أمر النبي ﷺ بالقتال وتحريض المؤمنين عليه، والترغيب في الشفاعة الحسنة والتحذير من شفاعة السوء، وأدب رد التحية وتمجيد الله وتهديد المكذبين",
          "ayat": "87 - 84"
        },
        {
          "id": 39,
          "question": "عتاب المؤمنين لإنقسام موقفهم من المنافقين بعد ظهور ضلالهم، وبيان حرصهم علي تكفير المؤمنين، والنهي عن موالاتهم، والأمر بقتالهم إن لم يهاجروا، وإستثناء أصحاب المواثيق والمستسلمون الكارهون لقتال الفريقين، والأمر بقتل المتلاعبين المحاربين",
          "ayat": "91 - 88"
        },
        {
          "id": 40,
          "question": "أحكام القتل الخطأ وجزاء القتل المتعمد",
          "ayat": "93 - 92"
        },
        {
          "id": 41,
          "question": "أمر المؤمنين بالتبين عند القتل، وعدم التعجل في الحكم بالإسلام أو عدمه",
          "ayat": "94"
        },
        {
          "id": 42,
          "question": "التفاضل بين المجاهدين والقاعدين من غير أولي الضرر",
          "ayat": "96 - 95"
        },
        {
          "id": 43,
          "question": "جزاء تاركي الهجرة بغير عذر، والعفو عن أهل الأعذار، والترغيب في الهجرة",
          "ayat": "100 - 97"
        },
        {
          "id": 44,
          "question": "قصر صلاة السفر، وصفة صلاة الخوف، والأمر بذكر الله على كل حال وإقامة الصلاة في وقتها، والنهي عن الوهن في الجهاد",
          "ayat": "104 - 101"
        },
        {
          "id": 45,
          "question": "عتاب النبي ﷺ، وتوجيه، وبيان",
          "ayat": "109 - 105"
        },
        {
          "id": 46,
          "question": "الحث على الإستغفار، ومسؤولية الفرد عن كسبه، وعظم إثم اتهام البريء",
          "ayat": "112 - 110"
        },
        {
          "id": 47,
          "question": "تذكير النبي بعصمة الله له وفضله عليه",
          "ayat": "113"
        },
        {
          "id": 48,
          "question": "التعريض بالنجوى، واستثناء حالات ثلاث",
          "ayat": "114"
        },
        {
          "id": 49,
          "question": "جزاء مشاقة الله، وحرمان المشرك من مغفرته، وبيان ضعف المعبودات من دونه، وحقيقة الشيطان، وحيله، وجزاء أتباعه، ووعد الله للمؤمنين بالجنات",
          "ayat": "122 - 115"
        },
        {
          "id": 50,
          "question": "لا اعتبار للأماني، والجزاء منوط بالعمل",
          "ayat": "124 - 123"
        },
        {
          "id": 51,
          "question": "الثناء على من أسلم وأحسن لله واتبع خليله إبراهيم عليه السلام",
          "ayat": "125"
        },
        {
          "id": 52,
          "question": "تمام ملك الله وإحاطته",
          "ayat": "126"
        },
        {
          "id": 53,
          "question": "نكاح يتامى النساء، والمستضعفين من الولدان واليتامى",
          "ayat": "127"
        },
        {
          "id": 54,
          "question": "علاج نشوز الرجل أو إعراضه، وتحذير الأزواج من الميل عن زوجة إلى أخرى، ومشروعية الفرقة",
          "ayat": "130 - 128"
        },
        {
          "id": 55,
          "question": "عموم ملك الله، ووصيته للمؤمنين وأهل الكتاب بالتقوى، وغناه عن الكفار",
          "ayat": "131"
        },
        {
          "id": 56,
          "question": "تأكيد ملك الله وقيامه بشؤون خلقه",
          "ayat": "132"
        },
        {
          "id": 57,
          "question": "تهديد الناس بالهلاك و الإستبدال، والترغيب بإخلاص الإرادة والقصد",
          "ayat": "134 - 133"
        },
        {
          "id": 58,
          "question": "أمر المؤمنين بشهادة الحق وحكم العدل، والثبات على الإيمان، وبيان ضلال من تردد بين الكفر والإيمان",
          "ayat": "137 - 135"
        },
        {
          "id": 59,
          "question": "تبشير المنافقين بالعذاب بسبب موالاتهم للكفار",
          "ayat": "139 - 138"
        },
        {
          "id": 60,
          "question": "تحذير المؤمنين من مجالستهم حال كفرهم واستهزائهم بآيات الله",
          "ayat": "140"
        },
        {
          "id": 61,
          "question": "من صور خداع المنافقين، وبيان كسلهم في العبادة، وذبذبتهم",
          "ayat": "143 - 141"
        },
        {
          "id": 62,
          "question": "تحذير المؤمنين من موالاة الكفار",
          "ayat": "144"
        },
        {
          "id": 63,
          "question": "منزلة المنافقين في النار، واستثناء التائبين، ورغبة الله عن عذاب المؤمنين",
          "ayat": "147 - 145"
        },
        {
          "id": 64,
          "question": "تحريم الجهر بالسوء إلا لمن ظلم، والتغيب بعمل الخير والعفو",
          "ayat": "149 - 148"
        },
        {
          "id": 65,
          "question": "بيان كفر أهل الكتاب لتفريقهم بين الإيمان باالله والإيمان برسله، وما أُعد لهم من العذاب، وعظيم أجر المؤمنين بجميعهم",
          "ayat": "152 - 150"
        },
        {
          "id": 66,
          "question": "ذم أهل الكتاب لطلبهم كتاباً من السماء وعرض قبائحهم مع موسى عليه السلام",
          "ayat": "154 - 153"
        },
        {
          "id": 67,
          "question": "عرض بعض جرائم اليهود وافترائهم على مريم والمسيح عليه السلام، وتقرير رفع الله له، وإيمانهم به قبل موته، وشهادته عليهم يوم القيامة",
          "ayat": "159 - 155"
        },
        {
          "id": 68,
          "question": "استكمال جرائم اليهود واستحقاقهم العذاب، واستدراك الراسخين والمؤمنين منهم",
          "ayat": "162 - 160"
        },
        {
          "id": 69,
          "question": "بيان أن الوحي للرسول ﷺ من جنس الوحي للرسل قبله تفصيلاً وإجمالاً، وبيان الحكمة من ارسالهم، وشهادة الله وملائكته بصدق الرسالة",
          "ayat": "166 - 163"
        },
        {
          "id": 70,
          "question": "بيان ضلال الكفار وحرمانهم من المغفرة وخلودهم في جهنم",
          "ayat": "169 - 167"
        },
        {
          "id": 71,
          "question": "دعوة الناس إلى الإيمان بالرسول ﷺ وغنى الله عن الكفار",
          "ayat": "170"
        },
        {
          "id": 72,
          "question": "دعوة النصارى إلى ترك الغلو والتثليث، وبيان حقيقة عيسى عليه السلام، وتأكيد وحدانية الله وملكه",
          "ayat": "171"
        },
        {
          "id": 73,
          "question": "بيان عدم امتناع عيسى عليه السلام والملائكة من العبودية لله تعالى وتوعد المستنفكين بالحشر وجزاء المؤمنين والمستنكفين",
          "ayat": "173 - 172"
        },
        {
          "id": 74,
          "question": "دعوة الناس جميعاً إلى الإيمان بالرسول ﷺ والقرآن، وجزاء المؤمنين",
          "ayat": "175 - 174"
        },
        {
          "id": 75,
          "question": "الخاتمة: استفتاء وفتوى \"كلالة الصيف\"",
          "ayat": "176"
        }
      ]
    },
    {
      "sura":"المائدة",
      "questions":  [
        {
          "id": 1
        }
      ]
    }, 
    {
      "sura":"الأنعام",
      "questions":  [
        {
          "id": 1,
          "question": "المقدمة: حمد الله خالق الكون والإنسان، وبيان اختصاصه بالألوهية وتمام علمه جل جلاله ",
          "ayat": " 3-1"
        },
        {
          "id": 2,
          "question": "بيان إعراضهم، وتهديدهم، وتذكيرهم بهلاك القرون بعد استدراجهم بالنعم ",
          "ayat": " 6-4"
        },
        {
          "id": 3,
          "question": "تسلية النبي صلى الله عليه وسلم: ببيان دأبهم على التكذيب ولو عاينوا نزول القرآن ولامسوه ",
          "ayat": "7"
        },
        {
          "id": 4,
          "question": "طلبهم نزول ملك، وبيان وجه استحالته ",
          "ayat": " 9-8"
        },
        {
          "id": 5,
          "question": "تسلية النبي صلى الله عليه وسلم: بيان أن الاستهزاء بالرسل وعقوبة المستهزئين بهم سنة ماضية ",
          "ayat": " 11-10"
        },
        {
          "id": 6,
          "question": "حجج الوحدانية في ملكوت الكون والتدبير؛ وإعلان الإسلام والخوف من عاقبة العصيان، وأن الضر والخير بيد الله، وهو القاهر جل جلاله ",
          "ayat": "18-12"
        },
        {
          "id": 7,
          "question": "عند الإشهاد والمفاصلة، وبيان حقيقة أهل الكتاب، وتقرير خسران المكذبين وظلمهم ",
          "ayat": "21-19"
        },
        {
          "id": 8,
          "question": "يوم الحشر؛ بيان تبرؤهم من الشرك، وكذبهم على أنفسهم ",
          "ayat": "24-22"
        },
        {
          "id": 9,
          "question": "في الدنيا؛ مجادلتهم في القرآن والآيات والرسول صلى الله عليه وسلم ",
          "ayat": "26-25"
        },
        {
          "id": 10,
          "question": "في النار؛ بيان ندامتهم، وتمنيهم الرجعة للإيمان، وكذبهم، وعودتهم لأقاويلهم المكذبة بالبعث ",
          "ayat": "29-27"
        },
        {
          "id": 11,
          "question": "بين يدي ربهم؛ مواجهة، وإقرار، وجزاء، وخسران، وحسرة، وظهور المفارقة بين دار الدنيا والآخرة ",
          "ayat": "32-30"
        },
        {
          "id": 12,
          "question": "تسلية النبي صلى الله عليه وسلم ببيان حقيقة تكذيبهم، وتذكيره بأحوال الرسل مع أقوامهم، وتيئيسه من إيمانهم بالآيات، وبيان أسباب ذلك ",
          "ayat": "36-33"
        },
        {
          "id": 13,
          "question": "طلبهم آية، والرد عليهم ببيان قدرة الله وإحاطة علمه، وبيان تخبط المكذبين في الظلمات ",
          "ayat": "39-37"
        },
        {
          "id": 14,
          "question": "التهديد بالعذاب والساعة تنبيها على حالهم في التجائهم إلى الله ونسيانهم آلهتهم ",
          "ayat": "41-40"
        },
        {
          "id": 15,
          "question": "تسلية النبي صلى الله عليه وسلم ببيان عذاب الأمم المكذبة واستدراجهم بالنقم والنعم ",
          "ayat": "45-42"
        },
        {
          "id": 16,
          "question": "التهديد بقدرة الله على سلبهم نعم الجوارح، وعلى إنزال العذاب بهم بغتة أو جهرة ",
          "ayat": "47-46"
        },
        {
          "id": 17,
          "question": "بيان مهمة الرسل، وجزاء المؤمنين والمكذبين ",
          "ayat": "49-48"
        },
        {
          "id": 18,
          "question": "تبليغ المشركين بعدم قدرة الرسول صلى الله عليه وسلم على مطالبهم المتعنتة ببيان حقيقة الرسالة لمن تكفر ",
          "ayat": "50"
        },
        {
          "id": 19,
          "question": "الأمر بإنذار المؤمنين خاصة، والتحذير من طردهم، وفتنة الناس بتفاوت عطاءات الله لهم ",
          "ayat": "53-51"
        },
        {
          "id": 20,
          "question": "توجيه النبي صلى الله عليه وسلم في معاملة المؤمنين التائبين، وتفصيل الآيات وبيان سبيل المجرمين ",
          "ayat": "55-54"
        },
        {
          "id": 21,
          "question": "توجيه النبي صلى الله عليه سلم لإعلان براءته من اتباع المشركين، وبيان يقينه فيما كذبوا به، وتفويض الحكم والفصل لله تعالى، والرد على استعجالهم العذاب ",
          "ayat": "58-56"
        },
        {
          "id": 22,
          "question": "الاحتجاج بالربوبية: العلم والقدرة والقهر والحفظ والوفاة والرد والحكم والحساب ",
          "ayat": "62-59"
        },
        {
          "id": 23,
          "question": "الاحتجاج بالتجاء المشركين إلى الله في الكروب، وتهديدهم بقدرته على تسليط العذاب عليهم ",
          "ayat": "65-63"
        },
        {
          "id": 24,
          "question": "تسلية النبي صلى الله عليه وسلم عن مسؤولية تكذيب قومه، وتهديدهم ",
          "ayat": "67-66"
        },
        {
          "id": 25,
          "question": "تعليم النبي صلى الله عليه وسلم أحكام مجالسة الخائضين في القرآن، وكيفية التعامل معهم، وجزاؤهم ",
          "ayat": "70-68"
        },
        {
          "id": 26,
          "question": "تلقين النبي صلى الله عليه وسلم مواجهة المشركين باستنكار الشرك، وتمثيل حال المرتد، وإعلان الاستسلام والعبودية لله، وذكر دلائل قدرته في الخلق، والملك يوم النفخ. ",
          "ayat": "73-71"
        },
        {
          "id": 27,
          "question": "إنكار إبراهيم عليه السلام على أبيه عبادة للأصنام ",
          "ayat": "74"
        },
        {
          "id": 28,
          "question": "نظر إبراهيم عليه السلام في ملكوت السماوات والأرض وتبرئه من الشرك ",
          "ayat": "79-75"
        },
        {
          "id": 29,
          "question": "المحاجة بينه وبين قومه، وبيان فوز الموحدين بالأمن والهداية ",
          "ayat": "82-80"
        },
        {
          "id": 30,
          "question": "تكريمه والإنعام عليه، والثناء على بعض الأنبياء وغيرهم، وبيان هداية الله لهم ونعمه عليهم والحث على الاقتداء بهم",
          "ayat": "90-83"
        },
        {
          "id": 31,
          "question": "الأول من جهالاتهم: إنكار الوحي وتوبيخهم على ذلك، والاحتجاج عليهم بإنزال التوراة، وتوبيخ محرفيها، وتقرير إنزال القرآن، وبعض أوصافه، وغاياته، وأوصاف المؤمنين به ",
          "ayat": "92-91"
        },
        {
          "id": 32,
          "question": "تسلية: تقرير ظلم مدعي الوحي، وحال الظالمين عند الموت وتوبيخهم على شركهم ",
          "ayat": "94-93"
        },
        {
          "id": 33,
          "question": "بيان دلائل الألوهية في الكون: إخراج النبات، والإحياء والإماتة، وفلق الصبح، والأجرام السماوية، والنفس والثمار ",
          "ayat": "99-95"
        },
        {
          "id": 34,
          "question": "الثاني من جهالاتهم: عبادتهم للجن، والرد عليهم بتنزيه الله عن صور الشرك جميعها وبيان ألوهيته وربوبيته وعظمته ",
          "ayat": "103-100"
        },
        {
          "id": 35,
          "question": "تسلية: في الوحي بصائر وبيان، وأمر النبي صلى الله عليه وسلم باتباعه، ونفوذ مشيئة الله، والنهي عن سب آلهة الكفار، وتزين الأعمال، وتأكيد المرجع لله تعالى. ",
          "ayat": "108-104"
        },
        {
          "id": 36,
          "question": "الثالث من جهالاتهم: أيمانهم ووعودهم بالإيمان والرد عليها بمسلكي المنع والتسليم ",
          "ayat": "111-109"
        },
        {
          "id": 37,
          "question": "تسلية: عداوة الشياطين للأنبياء سنة ماضية، والتوجيه بالإعراض عنهم، وتحكيم الله منزل الكتاب التام صدقا وعدلا ",
          "ayat": "115-112"
        },
        {
          "id": 38,
          "question": "التحذير من طاعة الضالين، وإباحة الأكل من المذكى، ونفي المانع منه بعد تفصيل المحرمات، والتحذير من المضلين بالأهواء ",
          "ayat": "119-116"
        },
        {
          "id": 39,
          "question": "التحذير من الإثم، وتحريم الأكل من غير المذكى، والتحذير من طاعة المشركين ",
          "ayat": "121-120"
        },
        {
          "id": 40,
          "question": "المفاضلة بين أهل الإيمان والنور وأهل الكفر والظلمات، وتزين الكفر والمكر للمجرمين، وعرض إحدى صور مكرهم وتوعدهم ",
          "ayat": "123-122"
        },
        {
          "id": 41,
          "question": "بيان أسباب الهداية والضلال، وضرب مثل لضيق قلب الكافر، والتوعد لمن لم يؤمن، وبيان صراط الله وجزاء من لزمه ",
          "ayat": "127-124"
        },
        {
          "id": 42,
          "question": "المواجهة يوم الحشر بتوبيخ الجن لإضلالهم الإنس، ورد الإنس، وبيان جزائهم، وقضاء الله في تولي الظالمين بعضهم وسؤال الجن والإنس عن إرسال الرسل إليهم، وشهادتهم على أنفسهم ",
          "ayat": "130-128"
        },
        {
          "id": 43,
          "question": "سنة الله في إعذار القرى، وتفاضل درجات العاملين في الآخرة أكبر، وكمال غنى الله ورحمته، وبيان قدرته على إهلاكهم واستخلاف غيرهم، وتحقق وعده ",
          "ayat": "134-131"
        },
        {
          "id": 44,
          "question": "أمر الرسول صلى الله عليه وسلم بتوعد المشركين الظاملين وتهديدهم ",
          "ayat": "135"
        },
        {
          "id": 45,
          "question": "تشريع الجاهلية في قسمة الحرث والأنعام بين الله جل جلاله وشركاؤهم، وتناقضهم، وسوء حكمهم فيه",
          "ayat": "136"
        },
        {
          "id": 46,
          "question": "تشريع الجاهلية في وأد البنات، والرد على القدرية، وتوعد المفترين ",
          "ayat": "137"
        },
        {
          "id": 47,
          "question": "تشريع الجاهلية في تقسيم الحرث والأنعام إلى ثلاثة أصناف، وتوعدهم على افترائهم ",
          "ayat": "138"
        },
        {
          "id": 48,
          "question": "تشريع الجاهلية في قسمة أجنة الأنعام، وتوعدهم ",
          "ayat": "139"
        },
        {
          "id": 49,
          "question": "تعقيب: بيان خسران وضلال المشركين في قتلهم أولادهم وتحريمهم ما أحل الله ",
          "ayat": "140"
        },
        {
          "id": 50,
          "question": "التذكير بقدرة الله ونعمه في الزروع، وأداء حق الله فيه، والتحذير من الإسراف ",
          "ayat": "141"
        },
        {
          "id": 51,
          "question": "التذكير بقدرة الله ونعمه في الأنعام، والتحذير من خطوات الشيطان، ونقاش عقلي لإبطال ما حرمه المشركون من الأنعام، والحكم بكذبهم وظلمهم ",
          "ayat": "144-142"
        },
        {
          "id": 52,
          "question": "إبطال ما حرمه المشركون ببيان ما حرم الله من المطعومات على المسلمين وعلى اليهود، وتذكير المكذبين برحمة الله وبأسه ",
          "ayat": "147-145"
        },
        {
          "id": 53,
          "question": "الإعلام باحتجاج المشركين بالمشيئة والرد عليهم بالتوعد والمطالبة بالدليل، وبيان تخرصهم، وظهور حجة الله، ومطالبتهم بالشهود وتوجيهات للنبي صلى الله عليه وسلم تحذر منهم وتذمهم ",
          "ayat": "150-148"
        },
        {
          "id": 54,
          "question": "دعوة المشركين إلى سماع أصول التشريعات الربانية \"الوصايا العشر\" ",
          "ayat": "153-151"
        },
        {
          "id": 55,
          "question": "الاحتجاج على المشركين بالتوراة وأوصافها، وبإنزال القرآن قطعا لأعذارهم عن الاتباع وتوعد الصادفين عنه ",
          "ayat": "157-154"
        },
        {
          "id": 56,
          "question": "إنكارٌ وتهديدٌ لتأخر المشركين عن الإيمان والعمل مع قرب انقطاع فائدتهما بحلول الموت أو الساعة أو بعض أشراطها ",
          "ayat": "158"
        },
        {
          "id": 57,
          "question": "البراءة من المتفرقين في دينهم وتوعدهم بعدالة الجزاء ",
          "ayat": "160-159"
        },
        {
          "id": 58,
          "question": "الخاتمة: إعلان الرسول صلى الله عليه وسلم هداية الله له إلى ملة إبراهيم، وإخلاصه واستسلامه لله، واستنكار الشرك والتذكير بربوبية الله ونعمته في الاستخلاف والابتلاء والجزاء ",
          "ayat": "165-161"
        }
      ]
    },
    {
      "sura":"الأعراف",
      "questions": [
        {
          "id": 1,
          "question": "المقدمة: تثبيت صدر النبي بإنزال الكتاب نذارة وذكرى ",
          "ayat": " 2-1"
        },
        {
          "id": 2,
          "question": "الأمر باتباع أمر الله والنهي عن موالاة غيره، والإنذار بهلاك القرى وبيان ندامتهم في الدنيا، وما يكون في الآخرة من السؤال والمواجهة والوزن للمفلحين والخاسرين ",
          "ayat": " 9-3"
        },
        {
          "id": 3,
          "question": "التذكير بنعمة التمكين والعيش في الأرض، والخلق والتصوير والتكريم لآدم عليه السلام بأمر الملائكة بالسجود له، وامتناع إبليس وتعلله، ثم إهباطه وطلبه الإنظار، ثم قسمه على إغواء بني آدم، وإخراجه من الجنة ",
          "ayat": "18-10"
        },
        {
          "id": 4,
          "question": "اسكان آدم وزوجه الجنة، والتحذير من الشجرة، ثم وسوسةٌ ومقاسمة، ثم معصيةٌ وعقوبةٌ، وعتابٌ وتوبةٌ، وإهباطٌ حتى البعث ",
          "ayat": "25-19"
        },
        {
          "id": 5,
          "question": "التوجيه الأول: التذكير بنعمة الستر واللباس ",
          "ayat": "26"
        },
        {
          "id": 6,
          "question": "التوجيه الثاني: التحذير من فتنة الشيطان وولايته، وضرب من فعال وأقوال أوليائه، والرد عليهم ",
          "ayat": "30-27"
        },
        {
          "id": 7,
          "question": "التوجيه الثالث: الحث على التزين للصلاة، والأكل والشرب بغير إسراف، والرد على من حرم الزينة والطيبات، وتفصيل المحرمات، وتذكير الأمم بحلول الآجال ",
          "ayat": "34-31"
        },
        {
          "id": 8,
          "question": "التوجيه الرابع: الحث على اتباع الرسل، وبيان جزاء أتباعهم وعقوبة المكذبين المستكبرين ",
          "ayat": "36-35"
        },
        {
          "id": 9,
          "question": "أولا: عقوبة مفتري الكذب في الدنيا، وعند الاحتضار، وتلاعن الأمم الكافرة، والحكم باستحالة دخولهم الجنة، وما أُعد لهم في النار من مهاد وغطاء ",
          "ayat": "41-37"
        },
        {
          "id": 10,
          "question": "ثانيا: جزاء المؤمنين العاملين، ونزع الغل منهم، وإدخالهم الجنة، وحمدهم الله على هدايته لهم وتحقق وعد الرسل، ونداء التهنئة لهم ",
          "ayat": "43-42"
        },
        {
          "id": 11,
          "question": "ثالثا: نداء أصحاب الجنة لأصحاب النار وردهم عليهم، والأذان بينهم باللعنة على الظالمين ",
          "ayat": "45-44"
        },
        {
          "id": 12,
          "question": "رابعا: أصحاب الأعراف ينادون أصحاب الجنة مسلمين عليهم، ويستعيذون من النار ثم ينادون أصحاب النار موبخين لهم ",
          "ayat": "49-46"
        },
        {
          "id": 13,
          "question": "خامسا: نداء أصحاب النار لأصحاب الجنة وردهم عليهم ",
          "ayat": "51-50"
        },
        {
          "id": 14,
          "question": "بيان تفصيل الكتاب، والعجب لتأخر الكفار عن الإيمان، وندامتهم في الآخرة، وخسرانهم بافترائهم ",
          "ayat": "53-52"
        },
        {
          "id": 15,
          "question": "بيان ربوبية الله، ودلائلها في الكون خلقًا وأمرًا، وما يستلزمها من الدعاء وترك الإفساد ",
          "ayat": "56-54"
        },
        {
          "id": 16,
          "question": "إرسال الرياح، وإنزال الماء من دلائل قدرة الله على البعث، وبيان التفاوت بين ثمرة البلد الطيب والخبيث ",
          "ayat": "58-57"
        },
        {
          "id": 17,
          "question": "نوح عليه السلام \"أمرٌ بالعبادة وإنذارٌ من العذاب، واتهامٌ له بالضلالة ورده عليهم، ثم تكذيبهم ونجاة المؤمنين وغرق المكذبين العمين\" ",
          "ayat": "64-59"
        },
        {
          "id": 18,
          "question": "هود عليه السلام \"أمرٌ بالعبادة والتقوى، واتهامٌ له بالسفاهة ورده عليهم، وتذكيرهم بنعمة الاستخلاف والبسطة في الخلق، وتمسكهم بدين الآباء، وتوعدهم، ثم نجاة المؤمنين وقطع دابر المكذبين\" ",
          "ayat": "72-65"
        },
        {
          "id": 19,
          "question": "صالح عليه السلام \"أمر بالعبادة، وتذكير بآية الله، ونعمتي الاستخلاف وتبوأ الأرض، والحوار بين مستكبري قومه ومستضعفيهم، ثم عقر الناقة، ثم الرجفة وكلمة الوداع\" ",
          "ayat": "79-73"
        },
        {
          "id": 20,
          "question": "لوط عليه السلام \"إنكار فاحشتهم في الرجال، وردهم، ثم نجاة المؤمنين، وإمطار المجرمين\" ",
          "ayat": "84-80"
        },
        {
          "id": 21,
          "question": "شعيب عليه السلام \"أمرٌ بالعبادة، تذكير بالبينة من الله، وأمرٌ بتوفية الكيل والميزان، ونهيٌ عن الإفساد والصد، وتذكير بنعمة التكثير وبعاقبة المفسدين وضرورة الصبر، وتخير القوم له بين الإخراج أو العودة إلى ملة الكفر والرد عليهم، ثم الرجفة وكلمة الوداع\" ",
          "ayat": "93-85"
        },
        {
          "id": 22,
          "question": "سنة الله في القرى المكذبة؛ ابتلاءٌ بالشدة ثم التبديل إلى النعم، ثم الأخذ بغتة ",
          "ayat": "95-94"
        },
        {
          "id": 23,
          "question": "حرمان أهل القرى من البركات بسبب كفرهم وتكذيبهم ",
          "ayat": "96"
        },
        {
          "id": 24,
          "question": "تخويف أهل القرى من الأمن من بأس الله ومكره، وتقرير خسرانهم بذلك ",
          "ayat": "99-97"
        },
        {
          "id": 25,
          "question": "العجب من عدم اعتبار المتوارثون للأرض بما أصاب من قبلهم بسبب ذنوبهم، وتهديدهم بنظيره ",
          "ayat": "100"
        },
        {
          "id": 26,
          "question": "الغاية من قصص القرى تثبيت النبي ﷺ، وإقامة الحجة على الكفار، وبيان سبب كفرهم ",
          "ayat": "102-101"
        },
        {
          "id": 27,
          "question": "بعثته إلى فرعون وملته، والحوار بينهما واستعراض آيتي العصا واليد ",
          "ayat": "108-103"
        },
        {
          "id": 28,
          "question": "اتهامات الملأ لموسى عليه السلام، وحشر السحرة واشتراطهم الأجر والموافقة عليه ",
          "ayat": "114-109"
        },
        {
          "id": 29,
          "question": "طلب السحرة من موسى عليه السلام الإلقاء، وتقديمه لهم واسترهابهم للناس بسحرهم ",
          "ayat": "116-115"
        },
        {
          "id": 30,
          "question": "الوحي لموسى بإلقاء العصا، وإبطال سحرهم وخسارتهم وذلهم ",
          "ayat": "119-117"
        },
        {
          "id": 31,
          "question": "سجود السحرة وإيمانهم واتهامات فرعون لهم وتوعدهم، وثبات السحرة وردهم ودعائهم ",
          "ayat": "126-120"
        },
        {
          "id": 32,
          "question": "تحريض الملأ لفرعون على موسى عليه السلام وقومه ",
          "ayat": "127"
        },
        {
          "id": 33,
          "question": "موعظة موسى عليه السلام وتصبيره لقومه وضجرهم، ووعدهم بهلاك عدوهم واستخلافهم ",
          "ayat": "129-128"
        },
        {
          "id": 34,
          "question": "ابتلاء قوم فرعون وموقفهم من ذلك، ثم إرسال الآيات المفصلات وطلبهم من موسى الدعاء لهم مقابل الوعد بالإيمان وإرسال بني إسرائيل ثم نكثهم للعهد انتقام الله منهم وإغراقهم بسبب تكذيبهم وغفلتهم ",
          "ayat": "136-130"
        },
        {
          "id": 35,
          "question": "وراثة بني إسرائيل الأرض بعد دمار مصنوعات فرعون وقومه",
          "ayat": "137"
        },
        {
          "id": 36,
          "question": "مجاوزة بني إسرائيل البحر، وطلبهم إلها صنما ورد موسى عليه السلام عليهم بثالث ردود ",
          "ayat": "141-138"
        },
        {
          "id": 37,
          "question": "ميقات الأربعين ليلة واستخلاف موسى لهارون ووصيته ",
          "ayat": "142"
        },
        {
          "id": 38,
          "question": "التكليم في الميقات وطلب الرؤية والصعق والتوبة ",
          "ayat": "143"
        },
        {
          "id": 39,
          "question": "خطاب الاصطفاء لموسى وجملة من الأوامر له ولقومه وتوعد للمخالفين ",
          "ayat": "147-144"
        },
        {
          "id": 40,
          "question": "اتخاذ بني إسرائيل للعجل وندامتهم واستغفارهم ",
          "ayat": "149-148"
        },
        {
          "id": 41,
          "question": "رجوع موسى وغضبه وتوبيخه لقومه وأخذه برأس هارون، وتبرير هارون لموقفه",
          "ayat": "150"
        },
        {
          "id": 42,
          "question": "طلب موسى المغفرة من الله له ولأخيه وبيان غضب الله على عباد العجل وجزاؤهم، ومغفرته للتائبين منهم، وسكون الغضب وتناول الألواح ",
          "ayat": "154-151"
        },
        {
          "id": 43,
          "question": "ميقات السبعين رجل للتوبة والاستغفار، وعقابهم بالرجفة وتضرع موسى لربه ورد الله عليه ببيان أوصاف المستحقين للرحمة، وأوصاف النبي الأمي الذي أمروا باتباعه ",
          "ayat": "157-155"
        },
        {
          "id": 44,
          "question": "أمر النبي ﷺ بإعلان رسالته للجميع ودعوتهم للإيمان والاتباع طلبا للهداية والثناء على أمة من قوم موسى مهتدون ",
          "ayat": "159-158"
        },
        {
          "id": 45,
          "question": "تقطيعهم أسباطا، وبعض نعم الله عليهم في التيه \"الاستسقاء وتظليل الغمام وإنزال المن والسلوى\" ",
          "ayat": "160"
        },
        {
          "id": 46,
          "question": "أولا: موقف الظالمين من الأمر بسكنى القرية، والأكل منها ودخولها ساجدين مستغفرين، وجزاؤهم ",
          "ayat": "162-161"
        },
        {
          "id": 47,
          "question": "ثانيا: تذكيرهم بالقرية التي اعتدت في السبت، وابتلاؤهم بفسقهم، وانقسامهم إلى فرقة عاصية وأخرى ناهية وثالثة ساكتة، وعذاب الله للعاصية ونجاة الناهية، ثم مسخ العاتين قردة خاسئين ",
          "ayat": "166-163"
        },
        {
          "id": 48,
          "question": "ثالثا: إعلام الله لبني إسرائيل بتسليط الناس عليهم بالعذاب إلى يوم القيامة، وتحقق وعده بتقطيعهم في الأرض صالحهم وطالحهم، وابتلاؤهم بالنعم والنقم ",
          "ayat": "168-167"
        },
        {
          "id": 49,
          "question": "رابعا: أوصاف الجيل الوارث للتوراة وانقسامهم إلى فريق حريص على متاع الدنيا متكل على المغفرة وتوبيخهم على ذلك وعلى مخالفتهم للميثاق، وفريق ممسك بالكتاب مأجور على الإصلاح ",
          "ayat": "170-169"
        },
        {
          "id": 50,
          "question": "خامسا: نتق الجبل فوقهم لكي يأخذوا بأحكام التوراة ",
          "ayat": "171"
        },
        {
          "id": 51,
          "question": "التذكير بميثاق بني آدم وشهادتهم بربوبية الله، وبيان أسباب هذا الميثاق، وتفصيل الآيات حثا على الرجوع إلى الفطرة ",
          "ayat": "174-172"
        },
        {
          "id": 52,
          "question": "نبأ رجل انسلخ من آيات الله واتبع الشيطان وأخلد إلى الأرض واتبع هواه وضرب مثل له بالكلب اللاهث، وتقبيح مثل الذين كذبوا وظلموا أنفسهم ",
          "ayat": "177-175"
        },
        {
          "id": 53,
          "question": "التعقيب بأن المهتدي من هداه الله والضالون خاسرون وصفات من خلقهم الله لجهنم والحكم بضلالهم وغفلتهم ",
          "ayat": "179-178"
        },
        {
          "id": 54,
          "question": "إثبات الأسماء الحسنى لله ودعاؤه بها والإعراض عن الملحدين فيها، والثناء على أمة الهداية والعدل، ووعيد المكذبين والإملاء لهم كيدا بهم ",
          "ayat": "182-180"
        },
        {
          "id": 55,
          "question": "التعجب من ترك التفكر في حقيقة الرسول ﷺ، وترك النظر في ملك الله وخلقه، واقتراب آجالهم، وعدم إيمانهم بالقرآن وبيان سببه وهو أن الضالون لا هادي لهم بل لا يزالون حيارى ",
          "ayat": "186-183"
        },
        {
          "id": 56,
          "question": "سؤالهم عن الساعة، والرد ببيان أوصافها، واستنكار سؤالهم وبيان جهل أكثرهم، وتبرؤ النبي ﷺ من الملك والتصرف وإبطال التلازم بين الرسالة وعلم الغيب ",
          "ayat": "188-187"
        },
        {
          "id": 57,
          "question": "بذكر الخلق والتزويج والتناسل والتجاء العباد إلى ربهم في مصالحهم ثم إشراكهم بعد ذلك ",
          "ayat": "190-189"
        },
        {
          "id": 58,
          "question": "ابطال الشرك عقلا؛ بيان عجز الشركاء عن الخلق، والنصر، واتباع الهدى، وبيان عبوديتهم وتحدي قدرتهم على الاستجابة، وبيان فقدانهم لآلاتها، وتحدي كيدها بالرسول ﷺ وإعلانه ولاية الله للصالحين، وعجز المعبودات عن النصر ونفي سمعهم وأبصارهم ",
          "ayat": "198-191"
        },
        {
          "id": 59,
          "question": "الخاتمة: توجيهات للنبي ﷺ إلى مكارم الأخلاق، واتباع الوحي وبيان وصفه والأدب عند قراءته، والحث على ذكر الله والحذر من الغفلة تأسيا بالملائكة المسبحين الساجدين ",
          "ayat": "206-199"
        }
      ]
    },
    {
      "sura":"الرعد",
      "questions":  [
        {
          "id": 1,
          "question": "المقدمة: الإشارة إلى آيات الكتاب، وأنها منزلة من عند الله بالحق، وإن كان أكثر الناس لا يؤمنون ",
          "ayat": "1"
        },
        {
          "id": 2,
          "question": "تفصيل آيات القدرة ودلائل اليقين بالبعث في الكون لقوم يتفكرون ويعقلون ",
          "ayat": " 4-2"
        },
        {
          "id": 3,
          "question": "ثلاث من مواقف جهل الكفار والرد عليها: إنكارهم البعث؛ التعجيب منه والحكم بكفرهم، وبيان جزائهم الآخروي، استعجالهم للعذاب والرد عليهم، طلبهم آية حسية والرد عليهم ",
          "ayat": " 7-5"
        },
        {
          "id": 4,
          "question": "من دلائل علم الله: علم الله لما في الأرحام، واستواء علم الغيب والشهادة عنده، وما أُسر وأُخفي من الأقوال والأعمال، وأن له معقبات يحفظون العباد وأعمالهم، وأنه لا ناصر لهم إن قضى الله بتغير حالهم أو إنزال السوء بهم ",
          "ayat": " 11-8"
        },
        {
          "id": 5,
          "question": "تخويف المجادلين في الله بذكر تصرف الله بالبرق انتقاما وانعاما، وإنشاء السحاب وتسبيح الرعد وإرسال الصواقع ",
          "ayat": "13-12"
        },
        {
          "id": 6,
          "question": "اختصاص الله بدعوة الحق، وضرب مثل لقصور المعبودات من دونه عن الاستجابة لعابديها وضياع دعاؤهم، وبيان خضوع الكون لله طوعا وكرها ",
          "ayat": "15-14"
        },
        {
          "id": 7,
          "question": "الاحتجاج بربوبية الكون لله تعالى، وانتفاء المساواة بين الأعمى والظلمات وضديهما، وعجز أوليائهم عن الخلق، واختصاص الله بالخلق والوحدانية والقهر، وضرب مثلين للحق والباطل، وجزاء المستجيبين لربهم وندامة غير المستجيبين ",
          "ayat": "18-16"
        },
        {
          "id": 8,
          "question": "نفي استواء العالم المؤمن والأعمى الكافر، وبيان تسع أوصاف لأولي الألباب، وجزاؤهم وتحية الملائكة لهم ",
          "ayat": "24-19"
        },
        {
          "id": 9,
          "question": "ثلاث خصال توجب اللعنة وسوء الدار، وتقرير بسط الله وتقديره لمن شاء، وجهل الكفار بفرحهم بالدنيا ",
          "ayat": "26-25"
        },
        {
          "id": 10,
          "question": "طلب الكفار آية حسية، والرد عليهم ببيان اختصاص الله بالإضلال والهداية، وصفات المنيبين وجزاؤهم ",
          "ayat": "29-27"
        },
        {
          "id": 11,
          "question": "أن إرساله ﷺ كالرسل من قبله، وأمره بتلاوة القرآن على الكفار وإعلان توحيده وتوكله ومرجعه لله تعالى ",
          "ayat": "30"
        },
        {
          "id": 12,
          "question": "بيان عظمة القرآن، وتذكير المؤمنين بأن الهداية بمشيئة الله، ووعد الكفار بالقوارع، وأن سنة الله الاملاء للمستهزئين بالرسل ثم أخذهم بالعقاب ",
          "ayat": "32-31"
        },
        {
          "id": 13,
          "question": "استحالة تسوية الله القيوم بغيره، وتوبيخ المشركين لتسمية معبوداتهم شركاء، وإخبارهم عنهم بما لا وجود له في الأرض ولا حقيقة له، وبيان أسباب ضلالهم، وما أعد لهم في الدنيا والآخرة ",
          "ayat": "34-33"
        },
        {
          "id": 14,
          "question": "صفة جنة المتقين وعقباهم، وبيان عقبى الكفار ",
          "ayat": "35"
        },
        {
          "id": 15,
          "question": "الموقف من الوحي: فرحٌ بالكتاب أو إنكارٌ له، وأمر النبي ﷺ بإعلان عبوديته لله ودعوته ومآبه إليه، وتقرير نزول القرآن حكما عربيا وتحذير النبي ﷺ من اتباع أهواء المشركين ",
          "ayat": "37-36"
        },
        {
          "id": 16,
          "question": "لكل الرسل أزواج ودرية، وليس لأحدهم أن يأتي بآية إلا بإذن الله، ولكل شيء نهاية مكتوبة، يمحو الله ما يشاء منها ويثبت، وليس على الرسول إلا البالغ ",
          "ayat": "40-38"
        },
        {
          "id": 17,
          "question": "حكم الله بانتشار الإسلام ونقص الكفر، وتوعد الماكرين بمكر الله وعلمه، والتعريض بخسارتهم للدار الآخرة ",
          "ayat": "42-41"
        },
        {
          "id": 18,
          "question": "الخاتمة: الرد على منكري الرسالة بشهادة الله تعالى، وبشهادة علماء أهل الكتاب ",
          "ayat": "43"
        }
      ]
    },
    {
      "sura":"إبراهيم",
      "questions": [
        {
          "id": 1,
          "question": "المقدمة: إنزال الكتاب على النبي ﷺ وبيان الغاية منه، وتوعد الكافرين وبعض أسباب ضلالهم ",
          "ayat": " 3-1"
        },
        {
          "id": 2,
          "question": "إرسال الرسل بلسان أقوامهم، ومشيئة الله في إضلال قوم أو هدايتهم ",
          "ayat": "4"
        },
        {
          "id": 3,
          "question": "إرسال موسى عليه السلام بالآيات للهداية والتذكير، وتذكيره لقومه نعم الله، وحثهم على الشكر وتحذيرهم من الكفر، وبيان غنى الله ",
          "ayat": " 8-5"
        },
        {
          "id": 4,
          "question": "التذكير بنبأ الأقوام السابقة مع رسلهم وبيان ردهم الفعلي، وردهم القولي بإعلانهم الكفر والشك في الدعوة والرد عليهم، وباعتراضهم على بشرية الرسل والتمسك بعبادة آبائهم والرد عليهم ",
          "ayat": " 12-9"
        },
        {
          "id": 5,
          "question": "تهديد الكفار لرسلهم بالإخراج أو العودة إلى ملتهم، والوحي بهلاك الظالمين وإسكانهم الأرض بعدهم ",
          "ayat": "14-13"
        },
        {
          "id": 6,
          "question": "استفتاحٌ، وخيبةٌ، وصديدٌ لا يستساغ، وموتٌ من كل مكان، وعذاب غليظ ",
          "ayat": "17-15"
        },
        {
          "id": 7,
          "question": "ضرب مثل لحبوط أعمال الكفار ",
          "ayat": "18"
        },
        {
          "id": 8,
          "question": "التنبيه على قدرة الخالق على الإهلاك والإيجاد، وأنه عليه غير غزيز ",
          "ayat": "20-19"
        },
        {
          "id": 9,
          "question": "بروز الضعفاء والمستكبرين يوم القيامة، والحوار فيما بينهم ",
          "ayat": "21"
        },
        {
          "id": 10,
          "question": "خطبة الشيطان في أهل النار وإدخال المؤمنين الجنات وتحيتهم فيها ",
          "ayat": "23-22"
        },
        {
          "id": 11,
          "question": "ضرب مثل للكلمة الطيبة والكلمة الخبيثة، والتعقيب بتثبيت الله للمؤمنين وإضلاله للظالمين ",
          "ayat": "27-24"
        },
        {
          "id": 12,
          "question": "التنبيه إلى مآل من كفر بنعم الله، وبيان دارهم وقرارهم ",
          "ayat": "29-28"
        },
        {
          "id": 13,
          "question": "تهديد متخذي الأنداد المضلين، ودعوة للمؤمنين للتزود من الطاعة قبل الساعة ",
          "ayat": "31-30"
        },
        {
          "id": 14,
          "question": "خلق ورزق وتسخير وإجابة سؤل، نعمٌ لا تحصى لإنسان ظلوم كفار ",
          "ayat": "34-32"
        },
        {
          "id": 15,
          "question": "دعوات إبراهيم عليه السلام ",
          "ayat": "41-35"
        },
        {
          "id": 16,
          "question": "علم الله بأعمال الظالمين وتأخيرهم إلى يوم القيامة وبيان أحوالهم فيه ",
          "ayat": "43-42"
        },
        {
          "id": 17,
          "question": "الأمر بإنذار الناس، وتوعدهم بالعذاب وبيان ندامتهم في يوم العذاب والرد عليهم ",
          "ayat": "45-44"
        },
        {
          "id": 18,
          "question": "مكر الكفار في الدنيا، وتمام وعد الله وانتقامه لرسله يوم التبديل والبروز وجزاء المجرمين فيه ",
          "ayat": "51-46"
        },
        {
          "id": 19,
          "question": "الخاتمة: بلاغٌ وإنذارٌ وإعلامٌ وتذكير ",
          "ayat": "52"
        }
      ]
    },
    {
      "sura":"الحجر",
      "questions": [
        {
          "id": 1,
          "question": "المقدمة: التنويه بشرف الكتاب وبيان القرآن ",
          "ayat": "1"
        },
        {
          "id": 2,
          "question": "ندامة الكفار على تركهم الإسلام، وإمهالهم وتهديدهم بهلاك كغيرهم لا يتقدم ولا يتأخر ",
          "ayat": " 5-2"
        },
        {
          "id": 3,
          "question": "اتهام الكفار للنبي ﷺ بالجنون وطلبهم نزول الملائكة، والرد عليهم ",
          "ayat": " 8-6"
        },
        {
          "id": 4,
          "question": "تسلية النبي ﷺ ببيان حقظ الله للوحي، وإرسال الرسل قبله، وعادة المجرمين في الاستهزاء بهم، وأن الله يسلك ذلك في قلوبهم فيمتنعوا من الإيمان كالأولين من قبلهم ",
          "ayat": "13-9"
        },
        {
          "id": 5,
          "question": "الاستدلال على عناد الكفار وتعنتهم بالفرض والتقدير ",
          "ayat": "16-14"
        },
        {
          "id": 6,
          "question": "حجج كونية تدل على الوحدانية (تزين السماء وحفظها – مد الأرض وتقدير المعايش والأرزاق – وإرسال الرياح بالماء",
          "ayat": "22-17"
        },
        {
          "id": 7,
          "question": "حجج شرعية تبين قدرة الله على الإحياء والإماتة، وإحاطة علمه بالجميع، وقدرته على الحشر ",
          "ayat": "25-23"
        },
        {
          "id": 8,
          "question": "أصل خلق الإنسان والجان ",
          "ayat": "27-26"
        },
        {
          "id": 9,
          "question": "خلق آدم وأمر الملائكة بالسجود له، وإباء إبليس احتقارا للبشر، والحكم عليه بالإخراج واللعنة ",
          "ayat": "35-28"
        },
        {
          "id": 10,
          "question": "طلب إبليس الانظار وإجابته لذلك، وتوعده بإغواء الإنس واستثناء المخلصين ",
          "ayat": "40-36"
        },
        {
          "id": 11,
          "question": "قضاء الله تعالى بأن لا يكون له سلطان إلا على الغاووين، وتوعدهم بجهنم وأبوابها السبعة، ووعد المتقين بالجنات وما فيها من نعيم ",
          "ayat": "48-41"
        },
        {
          "id": 12,
          "question": "الإعلام بأن الله غفور رحيم وذو عذاب أليم ",
          "ayat": "50-49"
        },
        {
          "id": 13,
          "question": "بشارة أضياف إبراهيم بغلام عليم، والاخبار بإرسالهم بالهلاك إلى قوم لوط المجرمين، واستثناء آل لوط منهم، واستثناء امرأته منهم ",
          "ayat": "60-51"
        },
        {
          "id": 14,
          "question": "قدوم الملائكة على قوم لوط، وانكاره لهم، وإخباره بهلاك قومه الذي استعجلوه صباحا ",
          "ayat": "66-61"
        },
        {
          "id": 15,
          "question": "قدوم قوم لوط طلبا لأضيافه، والحوار بينه وبينهم ",
          "ayat": "71-67"
        },
        {
          "id": 16,
          "question": "القسم على عمهم، والخبر بهلاكهم وقلب ديارهم آيات للمتوسمين وعبرة للمارين من المؤمنين ",
          "ayat": "77-72"
        },
        {
          "id": 17,
          "question": "ظلم أصحاب الأيكة، والانتقام منهم ",
          "ayat": "79-78"
        },
        {
          "id": 18,
          "question": "تكذيب أصحاب الحجر وإعراضهم وقوتهم وأمنهم ثم أخذهم بالصيحة دون أن ينفعهم ما كسبوه ",
          "ayat": "84-80"
        },
        {
          "id": 19,
          "question": "الخاتمة: تسلية: خلق السموات والأرض بالحق وتأكيد الساعة وجملة من التوجيهات، وبيان كفاية الله له وتثبيته على الطاعة ",
          "ayat": "99-85"
        }
      ]
    }
  ],
  
  "topics": [
    {
      "sura":"البقرة",
      "questions":[
        {
          "id":1
        }
      ]
    },
    {
      "sura":"آل عمران",
      "questions":[
        {
          "id":1
        }
      ]
    },
    {
      "sura":"النساء",
      "questions":[
        {
          "id":1,
          "question": "Ordering the believers to investigate when going forth to fight, and not be hasty in judging a person’s belief.",
          "ayat": "94"
        }
      ]
    }
  ],

  "maqati": [
    {
      "sura":"البقرة",
      "questions":[
        {
          "id": 1
        }
      ]
    },
    {
      "sura":"آل عمران",
      "questions": [
        {
          "id": 1
        }
      ]
    },
    {
      "sura":"النساء",
      "questions": [
        {
          "id": 1,
          "question": "يَا أَيُّهَا النَّاسُ اتَّقُواْ رَبَّكُمُ…. ذَلِكَ أَدْنَى أَلاَّ تَعُولُواْ",
          "ayat": " 3 - 1"
        },
        {
          "id": 2,
          "question": "وَآتُواْ النِّسَاء صَدُقَاتِهِنَّ نِحْلَةً…. وَكَفَى بِاللَّهِ حَسِيبًا",
          "ayat": " 6 - 3"
        },
        {
          "id": 3,
          "question": "لِّلرِّجَالِ نَصِيبٌ مِّمَّا تَرَكَ الْوَالِدَانِ….. وَسَيَصْلَوْنَ سَعِيرًا",
          "ayat": " 10 - 7"
        },
        {
          "id": 4,
          "question": "يُوصِيكُمُ اللَّهُ فِي أَوْلادِكُمْ... وَاللَّهُ عَلِيمٌ حَلِيمٌ",
          "ayat": "14 - 11"
        },
        {
          "id": 5,
          "question": "تِلْكَ حُدُودُ اللَّهِ ... أُوْلَئِكَ أَعْتَدْنَا لَهُمْ عَذَابًا أَلِيمًا",
          "ayat": "18 - 13"
        },
        {
          "id": 6,
          "question": "يَا أَيُّهَا الَّذِينَ آمَنُواْ لاَ يَحِلُّ لَكُم ...وَخُلِقَ الإِنسَانُ ضَعِيفًا",
          "ayat": "28 - 19"
        },
        {
          "id": 7,
          "question": "يَا أَيُّهَا الَّذِينَ آمَنُواْ لاَ تَأْكُلُواْ أَمْوَالَكُمْ ...إِنَّ اللَّهَ كَانَ عَلِيمًا خَبِيرًا",
          "ayat": "35 - 29"
        },
        {
          "id": 8,
          "question": "وَاعْبُدُواْ اللَّهَ وَلاَ تُشْرِكُواْ بِهِ شَيْئًا...وَلاَ يَكْتُمُونَ اللَّهَ حَدِيثًا",
          "ayat": "42 - 36"
        },
        {
          "id": 9,
          "question": "يَا أَيُّهَا الَّذِينَ آمَنُواْ لاَ تَقْرَبُواْ الصَّلاةَ.... وَكَفَى بِهِ إِثْمًا مُّبِينًا",
          "ayat": "50 - 43"
        },
        {
          "id": 10,
          "question": "أَلَمْ تَرَ إِلَى الَّذِينَ أُوتُواْ نَصِيبًا مِّنَ الْكِتَابِ يُؤْمِنُونَ...وَنُدْخِلُهُمْ ظِلاًّ ظَلِيلاً",
          "ayat": "57 - 51"
        },
        {
          "id": 11,
          "question": "إِنَّ اللَّهَ يَأْمُرُكُمْ أَن تُؤَدُّواْ الأَمَانَاتِ... وَكَفَى بِاللَّهِ عَلِيمًا",
          "ayat": "70 - 58"
        },
        {
          "id": 12,
          "question": "يَا أَيُّهَا الَّذِينَ آمَنُواْ خُذُواْ حِذْرَكُمْ...أَرْسَلْنَاكَ عَلَيْهِمْ حَفِيظًا",
          "ayat": "80 - 71"
        },
        {
          "id": 13,
          "question": "وَيَقُولُونَ طَاعَةٌ...وَمَنْ أَصْدَقُ مِنَ اللَّهِ حَدِيثًا",
          "ayat": "87 - 81"
        },
        {
          "id": 14,
          "question": "فَمَا لَكُمْ فِي الْمُنَافِقِينَ فِئَتَيْنِ...وَأَعَدَّ لَهُ عَذَابًا عَظِيمًا",
          "ayat": "93 - 88"
        },
        {
          "id": 15,
          "question": "يَا أَيُّهَا الَّذِينَ آمَنُواْ إِذَا ضَرَبْتُمْ فِي سَبِيلِ اللَّهِ... إِنَّ الْكَافِرِينَ كَانُواْ لَكُمْ عَدُوًّا مُّبِينًا",
          "ayat": "101 - 94"
        },
        {
          "id": 16,
          "question": "وَإِذَا كُنتَ فِيهِمْ فَأَقَمْتَ لَهُمُ الصَّلاة...وَكَانَ فَضْلُ اللَّهِ عَلَيْكَ عَظِيمًا",
          "ayat": "113 - 102"
        },
        {
          "id": 17,
          "question": "لاَّ خَيْرَ فِي كَثِيرٍ مِّن نَّجْوَاهُمْ... وَمَنْ أَصْدَقُ مِنَ اللَّهِ قِيلاً",
          "ayat": "122 - 114"
        },
        {
          "id": 18,
          "question": "لَّيْسَ بِأَمَانِيِّكُمْ وَلا أَمَانِيِّ أَهْلِ الْكِتَابِ...وَكَفَى بِاللَّهِ وَكِيلاً",
          "ayat": "132 - 123"
        },
        {
          "id": 19,
          "question": "وَلِلَّهِ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ وَكَفَى بِاللَّهِ وَكِيلاً ...فَإِنَّ الْعِزَّةَ لِلَّهِ جَمِيعًا",
          "ayat": "139 - 132"
        },
        {
          "id": 20,
          "question": "وَقَدْ نَزَّلَ عَلَيْكُمْ فِي الْكِتَابِ أَنْ إِذَا سَمِعْتُمْ...فَإِنَّ اللَّهَ كَانَ عَفُوًّا قَدِيرًا",
          "ayat": "149 - 140"
        },
        {
          "id": 21,
          "question": "إِنَّ الَّذِينَ يَكْفُرُونَ بِاللَّهِ وَرُسُلِهِ... وَكَانَ اللَّهُ غَفُورًا رَّحِيمًا",
          "ayat": "152 - 150"
        },
        {
          "id": 22,
          "question": "يَسْأَلُكَ أَهْلُ الْكِتَابِ أَن تُنَزِّل...أُوْلَئِكَ سَنُؤْتِيهِمْ أَجْرًا عَظِيمًا",
          "ayat": "162 - 153"
        },
        {
          "id": 23,
          "question": "إِنَّا أَوْحَيْنَا إِلَيْكَ كَمَا أَوْحَيْنَا...وَكَانَ ذَلِكَ عَلَى اللَّهِ يَسِيرًا",
          "ayat": "169 - 163"
        },
        {
          "id": 24,
          "question": "يَا أَيُّهَا النَّاسُ قَدْ جَاءَكُمُ الرَّسُولُ...وَاللَّهُ بِكُلِّ شَيْءٍ عَلِيمٌ",
          "ayat": "176 - 170"
        }
      ]
    },
    {
      "sura":"المائدة",
      "questions": [
        {
          "id": 1
        },
        {
          "id": 24
        }
      ]
    },
    {
      "sura":"الأنعام",
      "questions": [
        {
          "id": 1,
          "question": "الْحَمْدُ لِلَّهِ الَّذِي خَلَقَ السَّمَاوَاتِ وَالأَرْضَ... وَأَنشَأْنَا مِن بَعْدِهِمْ قَرْنًا آخَرِينَ",
          "ayat": " 6 - 1"
        },
        {
          "id": 2,
          "question": "وَلَوْ نَزَّلْنَا عَلَيْكَ كِتَابًا فِي قِرْطَاسٍ...وَهُوَ الْحَكِيمُ الْخَبِيرُ",
          "ayat": "18 - 7"
        },
        {
          "id": 3,
          "question": "قُلْ أَيُّ شَيْءٍ أَكْبَرُ شَهَادَة...وَإِن يُهْلِكُونَ إِلاَّ أَنفُسَهُمْ وَمَا يَشْعُرُونَ",
          "ayat": "26 - 19"
        },
        {
          "id": 4,
          "question": "وَلَوْ تَرَىَ إِذْ وُقِفُواْ عَلَى النَّارِ... أَفَلاَ تَعْقِلُونَ",
          "ayat": "32 - 27"
        },
        {
          "id": 5,
          "question": "قَدْ نَعْلَمُ إِنَّهُ لَيَحْزُنُكَ الَّذِي يَقُولُونَ...لَعَلَّهُمْ يَتَضَرَّعُونَ",
          "ayat": "42 - 33"
        },
        {
          "id": 6,
          "question": "وَلَقَدْ أَرْسَلْنَا إِلَى أُمَمٍ مِّن قَبْلِكَ... وَلِتَسْتَبِينَ سَبِيلُ الْمُجْرِمِينَ",
          "ayat": "55 - 42"
        },
        {
          "id": 7,
          "question": "قُلْ إِنِّي نُهِيتُ...وَسَوْفَ تَعْلَمُونَ",
          "ayat": "67 - 56"
        },
        {
          "id": 8,
          "question": "وَإِذَا رَأَيْتَ الَّذِينَ يَخُوضُونَ فِي آيَاتِنَا... فِي ضَلالٍ مُّبِينٍ",
          "ayat": "74 - 68"
        },
        {
          "id": 9,
          "question": "وَإِذْ قَالَ إِبْرَاهِيمُ لِأَبِيهِ...إِنْ هُوَ إِلاَّ ذِكْرَى لِلْعَالَمِينَ",
          "ayat": "90 - 74"
        },
        {
          "id": 10,
          "question": "وَمَا قَدَرُواْ اللَّهَ حَقَّ قَدْرِه...سُبْحَانَهُ وَتَعَالَى عَمَّا يَصِفُونَ",
          "ayat": "100 - 91"
        },
        {
          "id": 11,
          "question": "وَجَعَلُواْ لِلَّهِ شُرَكَاء الْجِنَّ...وَلَكِنَّ أَكْثَرَهُمْ يَجْهَلُونَ",
          "ayat": "111 - 100"
        },
        {
          "id": 12,
          "question": "وَكَذَلِكَ جَعَلْنَا لِكُلِّ نَبِيٍّ عَدُوًّا شَيَاطِينَ الإِنسِ وَالْجِنّ...بِمَا كَانُواْ يَمْكُرُونَ",
          "ayat": "124 - 112"
        },
        {
          "id": 13,
          "question": "فَمَن يُرِدِ اللَّهُ أَن يَهْدِيَهُ...إِنَّهُ لاَ يُفْلِحُ الظَّالِمُونَ",
          "ayat": "135 - 125"
        },
        {
          "id": 14,
          "question": "وَجَعَلُواْ لِلَّهِ مِمَّا ذَرَأَ مِنَ الْحَرْثِ وَالأَنْعَامِ...إِنَّ اللَّهَ لاَ يَهْدِي الْقَوْمَ الظَّالِمِينَ",
          "ayat": "144 - 136"
        },
        {
          "id": 15,
          "question": "قُل لاَّ أَجِدُ فِي مَا أُوحِيَ إِلَيَّ مُحَرَّمًا...ذَلِكُمْ وَصَّاكُم بِهِ لَعَلَّكُمْ تَتَّقُونَ",
          "ayat": "153 - 145"
        },
        {
          "id": 16,
          "question": "ثُمَّ آتَيْنَا مُوسَى الْكِتَابَ...وَإِنَّهُ لَغَفُورٌ رَّحِيمٌ",
          "ayat": "165 - 154"
        }
      ]
    },
    {
      "sura":"الأعراف",
      "questions":[
        {
          "id": 1,
          "question": "المص...قلِيلاً مَّا تَشْكُرُونَ",
          "ayat": " 10 - 1"
        },
        {
          "id": 2,
          "question": "وَلَقَدْ خَلَقْنَاكُمْ ثُمَّ صَوَّرْنَاكُمْ... لَعَلَّهُمْ يَذَّكَّرُونَ",
          "ayat": "26 - 11"
        },
        {
          "id": 3,
          "question": "يَا بَنِي آدَمَ لاَ يَفْتِنَنَّكُمُ الشَّيْطَانُ...وَلاَ يَسْتَقْدِمُونَ",
          "ayat": "34 - 27"
        },
        {
          "id": 4,
          "question": "يَا بَنِي آدَمَ إِمَّا يَأْتِيَنَّكُمْ ...أُورِثْتُمُوهَا بِمَا كُنتُمْ تَعْمَلُونَ",
          "ayat": "43 - 35"
        },
        {
          "id": 5,
          "question": "وَنَادَى أَصْحَابُ الْجَنَّةِ...هُدًى وَرَحْمَةً لِّقَوْمٍ يُؤْمِنُونَ",
          "ayat": "52 - 44"
        },
        {
          "id": 6,
          "question": "هَلْ يَنظُرُونَ إِلاَّ...لِقَوْمٍ يَشْكُرُونَ",
          "ayat": "58 - 53"
        },
        {
          "id": 7,
          "question": "لَقَدْ أَرْسَلْنَا نُوحًا...إِنَّهُمْ كَانُواْ قَوْمًا عَمِينَ",
          "ayat": "64 - 59"
        },
        {
          "id": 8,
          "question": "وَإِلَى عَادٍ... وَمَا كَانُواْ مُؤْمِنِينَ",
          "ayat": "72 - 65"
        },
        {
          "id": 9,
          "question": "وَإِلَى ثَمُودَ... وَلَكِن لاَّ تُحِبُّونَ النَّاصِحِينَ",
          "ayat": "79 - 73"
        },
        {
          "id": 10,
          "question": "وَلُوطًا...عَاقِبَةُ الْمُجْرِمِينَ",
          "ayat": "84 - 80"
        },
        {
          "id": 11,
          "question": "وَإِلَى مَدْيَنَ...قَوْمٍ كَافِرِينَ",
          "ayat": "93 - 85"
        },
        {
          "id": 12,
          "question": "وَمَا أَرْسَلْنَا فِي قَرْيَةٍ...عَاقِبَةُ الْمُفْسِدِينَ",
          "ayat": "103 - 94"
        },
        {
          "id": 13,
          "question": "ثُمَّ بَعَثْنَا مِن بَعْدِهِم مُّوسَى...لَعَلَّهُمْ يَذَّكَّرُونَ",
          "ayat": "130 - 103"
        },
        {
          "id": 14,
          "question": "وَلَقَدْ أَخَذْنَا آلَ فِرْعَوْنَ ...اتَّخَذُوهُ وَكَانُواْ ظَالِمِينَ",
          "ayat": "148 - 130"
        },
        {
          "id": 15,
          "question": "وَاتَّخَذَ قَوْمُ مُوسَى ...وَبِهِ يَعْدِلُونَ",
          "ayat": "159 - 148"
        },
        {
          "id": 16,
          "question": "وَقَطَّعْنَاهُمُ اثْنَتَيْ عَشْرَةَ...لَعَلَّكُمْ تَتَّقُونَ",
          "ayat": "171 - 160"
        },
        {
          "id": 17,
          "question": "وَإِذْ أَخَذَ رَبُّكَ...طُغْيَانِهِمْ يَعْمَهُونَ",
          "ayat": "186 - 172"
        },
        {
          "id": 18,
          "question": "يَسْأَلُونَكَ عَنِ السَّاعَةِ...وَهُمْ لاَ يُبْصِرُونَ",
          "ayat": "198 - 187"
        },
        {
          "id": 19,
          "question": "خُذِ الْعَفْوَ...وَيُسَبِّحُونَهُ وَلَهُ يَسْجُدُونَ",
          "ayat": "206 - 199"
        }
      ]
    },
    {
      "sura":"الرعد",
      "questions": [
        {
          "id": 1,
          "question": "المر... إِنَّ فِي ذَلِكَ لَآيَاتٍ لِقَوْمٍ يَعْقِلُونَ",
          "ayat": " 4 - 1"
        },
        {
          "id": 2,
          "question": "وَإِنْ تَعْجَبْ فَعَجَبٌ قَوْلُهُمْ...وَظِلالُهُم بِالْغُدُوِّ وَالآصَالِ",
          "ayat": "15 - 5"
        },
        {
          "id": 3,
          "question": "قُلْ مَن رَّبُّ...إِنَّمَا يَتَذَكَّرُ أُولُو الْأَلْبَابِ",
          "ayat": "19 - 16"
        },
        {
          "id": 4,
          "question": "أَفَمَنْ يَعْلَمُ أَنَّمَا أُنْزِلَ...وَحُسْنُ مَآبٍ",
          "ayat": "29 - 19"
        },
        {
          "id": 5,
          "question": "كَذَلِكَ أَرْسَلْنَاكَ...مِن وَاقٍ",
          "ayat": "34 - 30"
        },
        {
          "id": 6,
          "question": "مَّثَلُ الْجَنَّةِ...وَمَنْ عِندَهُ عِلْمُ الْكِتَابِ",
          "ayat": "43 - 35"
        }
      ]
    },
    {
      "sura":"إبراهيم",
      "questions": [
        {
          "id": 1,
          "question": "الر...صَبَّارٍ شَكُور",
          "ayat": " 5 - 1"
        },
        {
          "id": 2,
          "question": "وَلَقَدْ أَرْسَلْنَا...عَذَابٌ غَلِيظٌ",
          "ayat": "17 - 5"
        },
        {
          "id": 3,
          "question": "مَّثَلُ الَّذِينَ كَفَرُواْ بِرَبِّهِمْ...تَحِيَّتُهُمْ فِيهَا سَلامٌ",
          "ayat": "23 - 18"
        },
        {
          "id": 4,
          "question": "أَلَمْ تَرَ كَيْفَ...نَّعْبُدَ الأَصْنَامَ",
          "ayat": "35 - 24"
        },
        {
          "id": 5,
          "question": "وَإِذْ قَالَ إِبْرَاهِيمُ...تَشْخَصُ فِيهِ الأَبْصَارُ",
          "ayat": "42 - 35"
        },
        {
          "id": 6,
          "question": "وَلاَ تَحْسَبَنَّ اللَّهَ...وَلِيَذَّكَّرَ أُوْلُواْ الأَلْبَابِ",
          "ayat": "52 - 42"
        }
      ]
    },
    {
      "sura":"الحجر",
      "questions": [
        {
          "id": 1,
          "question": "الرَ...وَزَيَّنَّاهَا لِلنَّاظِرِينَ",
          "ayat": "16 - 1"
        },
        {
          "id": 2,
          "question": "وَلَقَدْ جَعَلْنَا فِي السَّمَاء...وَلَقَدْ خَلَقْنَا الإِنسَانَ مِن صَلْصَالٍ مِّنْ حَمَإٍ مَّسْنُونٍ",
          "ayat": "26 - 16"
        },
        {
          "id": 3,
          "question": "وَلَقَدْ خَلَقْنَا الإِنسَانَ...مِّنْهَا بِمُخْرَجِينَ",
          "ayat": "48 - 26"
        },
        {
          "id": 4,
          "question": "نَبِّىءْ عِبَادِي ...إِنَّهَا لَمِنَ الْغَابِرِينَ",
          "ayat": "60 - 49"
        },
        {
          "id": 5,
          "question": "فَلَمَّا جَاءَ آلَ لُوطٍ...لَبِإِمَامٍ مُّبِينٍ",
          "ayat": "79 - 61"
        },
        {
          "id": 6,
          "question": "وَلَقَدْ كَذَّبَ أَصْحَابُ الحِجْرِ...حَتَّى يَأْتِيَكَ الْيَقِينُ",
          "ayat": "99 - 80"
        }
      ]
    }
  ]
}